Repository: jaaf/po_purifier
Catalog: testing_data/After_Installation.po
Languages: fr

source: After the Installation
fr: Après l'installation

source: This chapter describes the initial setup tools which open after you finish the installation, reboot the system, and log in for the first time.
fr: Ce chapitre décrit les outils de configuration initiale qui se présentent à vous après que vous avez terminé l'installation, redémarré et vous êtes connecté pour la première fois.

source: Two separate configuration tools are part of &PRODUCT;. If you installed the <application>GNOME</application> desktop environment (the default &PRODUCT; environment, installed for example as part of the &PRODUCT; Workstation flavor), the <application>GNOME Initial Setup</application> utility will open; for all other graphical environments, the <application>Initial Setup</application> tool serves the same purpose.
fr: Deux outils de configuration font partie de &PRODUCT;. Si vous avez installé l'environnement de bureau <application>GNOME</application> (l'environnement par défaut de &PRODUCT; installé par exemple en tant que partie de la variante « &PRODUCT; Workstation »), l'utilitaire <application>GNOME Initial Setup</application> (Configuration initiale de GNOME) se présente à vous ; pour tous les autres environnements graphiques, l'outil <application>Initial Setup</application> (Configuration initiale) a le même rôle.

source: Both of these tools will allow you to configure user-specific settings which have not been configured during the installation. Some of the settings are available both in the graphical installer (or as Kickstart commands) as well as in the initial-setup utilities; in that case, they will only be displayed after the first reboot if you skipped them during the installation. This means that, for example, if you configured a user account before the installation finished, you will not be prompted to do so again after the installation completes.
fr: L'un ou l'autre de ces outils vous permet de définir des réglages spécifiques à l'utilisateur qui n'ont pas été définis lors de l'installation. Quelques uns de ces réglages sont accessibles à la fois dans l'installateur graphique (ou par des commandes préalables à son lancement sous forme de fichiers Kickstart) et dans l'utilitaire de configuration initiale. Dans ce cas, ils ne seront affichés qu'après un premier redémarrage, si vous les avez sautés pendant l'installation. Cela veut dire que, si par exemple, vous avez configuré un compte utilisateur avant que l'installation ne s'achève, vous n'êtes pas invité à le refaire une fois l'installation terminée.

source: GNOME Initial Setup
fr: Configuration initiale de GNOME

source: The <application>GNOME Initial Setup</application> utility will be displayed after you log in for the first time with any user account, as long as your first login is in the <application>GNOME</application> desktop environment.
fr: L'utilitaire <application>GNOME Initial Setup</application> (Configuration initiale de GNOME) est affiché après votre première connexion en tant qu'utilisateur standard dans l'environnement de bureau <application>GNOME</application> ; l'adjectif « première » s'appréciant ici sans tenir compte d'éventuelles connexions préalables dans d'autres environnements.

source: This utility allows you to configure several user-specific settings, such as system language or the default keyboard layout. Use the <guilabel>Next</guilabel> and <guilabel>Previous</guilabel> buttons at the top of the window to navigate between screens. Some screens (<guilabel>Configure online accounts</guilabel> in particular) are optional and can be skipped using the <guilabel>Skip</guilabel> button in the top right corner.
fr: L'utilitaire vous permet de configurer un certain nombre de réglages spécifiques à l'utilisateur, comme la langue du système ou l'agencement de clavier par défaut. Utilisez les boutons <guilabel>Suivant</guilabel> et <guilabel>Pécédent</guilabel> en haut de la fenêtre pour naviguer d'un écran à l'autre. Quelques écrans (<guilabel>Configurer les comptes en ligne</guilabel> en particulier) sont facultatifs et peuvent être ignorés en utilisant le bouton <guilabel>Passer</guilabel> dans le coin supérieur droit.

source: After you finish configuring all screens, click <guilabel>Start using Fedora</guilabel> to exit the utility. After that, the <guilabel>Getting Started</guilabel> page from GNOME help will be displayed, and you can either browse the help content, or close it and start using your desktop.
fr: Après que vous en avez terminé avec tous les écrans de configuration, cliquez sur le bouton <guilabel>Commencer à utiliser Fedora</guilabel> pour quitter l'utilitaire. À la suite de cela, la page d'aide à la prise en main de GNOME, <guilabel>Premiers pas</guilabel>, s'affiche et vous pouvez soit en parcourir le contenu, soit la fermer et commencer à utiliser votre ordinateur.

source: Common Post-installation Tasks
fr: Tâches courantes suite à l'installation

source: After you finish the installation and go through one of the initial setup utilities described above, your system is ready for use. However, other administrative tasks not covered by the installer or the initial setup utilities may still be necessary, depending on how you plan to use your system. The list below describes some of the more common tasks usually performed immediately after a new installation.
fr: Une fois que vous en avez terminé avec l'installation et l'utilisation d'un des outils de configuration initiale que nous venons de décrire, votre système est prêt à l'emploi. Cependant, certaines autres tâches administratives qui ne sont pas prises en charge par l'installateur ou dans l'utilitaire de configuration initiale peuvent s'avérer nécessaires selon la manière dont vous envisagez d'utiliser votre ordinateur. La liste qui suit décrit quelques unes de ces tâches courantes :

source: Recover a lost <systemitem class="username">root</systemitem> password
fr: Réinitialisation du mot de passe perdu de l'utilisateur « <systemitem class="username">root</systemitem> »

source: The <systemitem class="username">root</systemitem> password, which is configured during the installation, is required for accessing the system as the <systemitem class="username">root</systemitem> user. Without this password you will not be able to configure your system or install additional software. If you lost or forgot your <systemitem class="username">root</systemitem> password, you can reset it by following the steps described in <xref linkend="sect-trouble-after-reset-root-password" />.
fr: Le mot de passe de l'utilisateur « <systemitem class="username">root</systemitem> » défini pendant l'installation est nécessaire pour accéder au système en tant que super utilisateur « <systemitem class="username">root</systemitem> ». Sans ce mot de passe, vous ne serez pas en mesure de configurer votre système ou d'ajouter des applications supplémentaires. Si vous avez perdu votre mot de passe « <systemitem class="username">root</systemitem> », vous pouvez le réinitialiser en suivant les étapes décrites dans la <xref linkend="sect-trouble-after-reset-root-password" />.

source: Configure the network
fr: Configuration du réseau

source: In most cases, network access is configured during the installation process, either in the <application>Anaconda</application> installation program (see <xref linkend="sect-installation-gui-network-configuration" />) or in a Kickstart file (see <xref linkend="sect-kickstart-commands-network" />). For information on configuring the network after the installation, see the <citetitle>&PRODUCT; Networking Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Dans la plupart des cas, le réseau est configuré lors de l'installation, soit dans le programme d'installation <application>Anaconda</application> (voir la <xref linkend="sect-installation-gui-network-configuration" />), soit dans un fichier Kickstart (voir la <xref linkend="sect-kickstart-commands-network" />). Pour de l'information sur la manière de configurer le réseau après l'installation, reportez-vous au <citetitle>Guide de configuration du réseau de &PRODUCT;</citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: Perform an initial system update
fr: Mise à jour initiale du système

source: If you installed &PRODUCT; from a full installation ISO image (such as the Workstation live image or full Server DVD), it is recommended to perform an initial system update, because your installation media likely contained older versions of software packages. During the initial update, all installed packages are updated to their latest available versions. Updates to packages provide security fixes, bug fixes and enhancements.
fr: Si vous avez installé &PRODUCT; à partir d'une image ISO d'installation complète (comme l'image DVD Live complète d'une station de travail ou d'un serveur ), il est recommandé d'effectuer une mise à jour initiale du système parce que votre média d'installation contient probablement des versions non à jour des paquets. Lors de cette mise à jour initiale, les paquets installés sont mis à jour avec leur dernière version disponible. La mise à jour des paquets apporte des correctifs de sécurité, des correctifs d'erreurs et des améliorations.

source: The <application>DNF</application> package manager is used for updating installed packages. For more information about updating your system with <application>DNF</application>, see the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Le gestionnaire de paquets <application>DNF</application> est utilisé pour mettre à jour les paquets installés. Pour plus d'information sur la mise à jour de votre système avec <application>DNF</application>, reportez-vous au <citetitle>Guide de l'administrateur système de &PRODUCT;</citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: Install driver updates
fr: Mise à jour des pilotes

source: Usually, drivers for system devices are already supported in the kernel provided by Red&nbsp;Hat Enterprise&nbsp;Linux. However, occasionally, support for devices that have been released recently could be missing. In these cases, a driver update enabling your device may be available.
fr: Habituellement, les pilotes de périphérique sont déjà pris en charge par le noyau Linux fourni par Red&nbsp;Hat Enterprise&nbsp;Linux. Néanmoins, dans certains cas, la prise en charge de périphériques récents peut faire défaut. Dans ce cas, une mise à jour des pilotes peut faire en sorte que votre périphérique soit pris en charge.

source: Devices necessary to complete the installation can have driver updates provided before the installation begins. If a device is missing a driver, but it is not essential during the installation, it is recommended to wait until after the installation completes, and install additional drivers afterwards. For instructions on installing and enabling additional drivers on the installed system using <application>RPM</application> and <application>DNF</application>, see the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Les périphériques nécessaires à l'installation peuvent faire l'objet d'une mise à jour des pilotes préalable à l'installation. Si un pilote de périphérique manque mais n'est pas essentiel à l'installation, il est recommandé d'attendre que l'installation soit terminée et d'installer le pilote après coup. Pour des explications sur la manière d'installer des pilotes supplémentaires et de les activer sur un système déjà installé avec les commandes <application>RPM</application> et <application>DNF</application>, reportez-vous au <citetitle>Guide de l'administrateur système de &PRODUCT; </citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: Configure additional repositories
fr: Configuration de dépôts supplémentaires

source: New software is installed from <firstterm>package repositories</firstterm>. Package repositories are organized sets of software and metadata that can be accessed by the <application>DNF</application> package manager. By default, several update repositories provided by &PRODUCT; are configured automatically and you can install updates and additional software from those. However, if you want to set up additional repositories, for example ones containing your own software, some extra steps are needed.
fr: Un nouveau programme est installé à partir d'un <firstterm>dépôt de paquets</firstterm>. Les dépôts de paquets sont des ensembles organisés de logiciels et de méta-données qui sont accessibles au gestionnaire de paquets <application>DNF</application>. Certains dépôts de mise à jour fournis par &PRODUCT; sont configurés automatiquement par défaut et vous pouvez installer ou mettre à jour des programmes à partir de ceux-ci. Néanmoins, si vous désirez configurer des dépôts additionnels, par exemple un dépôt contenant vos propres programmes, quelques étapes supplémentaires sont nécessaires.

source: For information about configuring additional software repositories, see the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Pour de l'information sur la configuration de dépôts de paquets supplémentaires, reportez-vous au <citetitle>Guide de l'administrateur système de &PRODUCT; </citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: Install additional packages
fr: Installation de paquets supplémentaires

source: You can control which packages will be installed by selecting an environment in the <systemitem>Software Selection</systemitem> dialog in the graphical installation (see <xref linkend="sect-installation-gui-software-selection" />). This dialog does not provide a way to choose individual packages, only predefined sets. However, you can use the <application>DNF</application> package manager to install additional packages after the installation. See the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />, for more information.
fr: Vous pouvez contrôler quels paquets seront installés en choisissant un environnement dans la boîte de dialogue <systemitem>Sélectionnez les logiciels installés </systemitem> dans l'installateur graphique (voir la <xref linkend="sect-installation-gui-software-selection" />). Cette boîte de dialogue ne vous permet pas de choisir les paquets individuellement mais par ensembles prédéfinis. Cependant, vous pouvez vous servir du gestionnaire de paquets <application>DNF</application> pour installer des paquets supplémentaires une fois l'installation terminée. Pour plus d'information, reportez-vous au <citetitle>Guide de l'administrateur système de &PRODUCT; </citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />

source: Switch to a graphical login
fr: Passage à un environnement graphique

source: Depending on the options you chose during the installation process, it is possible that your system does not have a graphical interface, instead offering only a text-based prompt. If this is the case and you wish to enable a graphical desktop after the installation, you must install the <application>X Window System</application> and your preferred desktop environment (either <application>GNOME</application> or <application>KDE</application>).
fr: Selon les options que vous avez prises lors de l'installation, il se peut que votre système ne présente pas une interface graphique mais vous présente seulement une invite de commande textuelle. Dans ce cas, si vous désirez passer à un environnement de bureau graphique après l'installation, vous devez installer le système <application>X Window</application> ainsi que votre environnement de bureau préféré (soit <application>GNOME</application>, soit <application>KDE</application>).

source: As with all other software, these packages can be installed using the <application>DNF</application> package manager. For information about using <application>DNF</application> to install new packages, see the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />. For information on how to enable graphical login by default, see <xref linkend="sect-trouble-after-graphical-login" />.
fr: Comme tous les autres programmes, ces paquets peuvent être installés avec le gestionnaire de paquets <application>DNF</application>. Pour de l'information sur l'utilisation de <application>DNF</application> pour installer de nouveaux paquets, reportez-vous au <citetitle>Guide de l'administrateur système de &PRODUCT; </citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />. Pour de l'information sur la manière d'activer la connexion graphique par défaut, reportez-vous à la <xref linkend="sect-trouble-after-graphical-login" />.
