Repository: jaaf/po_purifier
Catalog: testing_data/Boot_Options.po
Languages: fr

source: Boot Options
fr: Options de démarrage

source: The <application>Anaconda</application> installer includes a range of boot options for administrators, which modify the default behavior of the installation program by enabling or disabling certain functions. To use one or more boot options, you either have to boot from installation media and append these options at the boot menu (see <xref linkend="sect-boot-menu" />), or you must add them into your PXE server configuration file if you are booting from a network (see <xref linkend="chap-pxe-server-setup" />).
fr: L'installateur <application>Anaconda</application> prévoit une série d'options de démarrage pour les administrateurs qui modifient le comportement par défaut du programme d'installation en activant ou en désactivant certaines fonctions. Pour utiliser une ou plusieurs de ces options de démarrage, vous devez, soit démarrer du média d'installation et ajouter ces options depuis le menu de démarrage (voir la <xref linkend="sect-boot-menu" />), soit les ajouter dans votre fichier de configuration du serveur PXE si vous démarrez depuis le réseau (voir le <xref linkend="chap-pxe-server-setup" />).

source: You can use multiple options at the same time; in that case, separate them by a single space.
fr: Vous pouvez utiliser plusieurs options de démarrage à la fois en les séparant par une espace unique.

source: There are two basic types of options described in this chapter:
fr: Il y a deux types de base pour les options décrites dans ce chapitre :

source: Options presented as ending with an "equals" sign (<literal>=</literal>) require a value to be specified - they cannot be used on their own. For example, the <option>inst.vncpassword=</option> option must also contain a value (in this case, a password). The correct form is therefore <option>inst.vncpassword=<replaceable>password</replaceable></option>. On its own, without a password specified, the option is invalid.
fr: Les options présentées avec un signe « égal » à la fin (<literal>=</literal>) nécessitent que vous spécifiiez une valeur – elles ne peuvent être utilisées telles quelles. Par exemple, l'option <option>inst.vncpassword=</option> doit être assortie d'une valeur (en l'occurrence un mot de passe). La forme correcte est donc : <option>inst.vncpassword=<replaceable>mot_de_passe</replaceable></option>.

source: Options presented without the "<literal>=</literal>" sign do not accept any values or parameters. For example, the <option>rd.live.check</option> option forces <application>Anaconda</application> to verify the installation media before starting the installation; if this option is present, the check will be performed, and if it is not present, the check will be skipped.
fr: Les options présentées sans signe « égal » (<literal>=</literal>) ne prennent aucune valeur. Par exemple, l'option <option>rd.live.check</option> oblige <application>Anaconda</application> à vérifier le média d'installation avant de commencer ; si cette option est présente, la vérification est effectuée ; si elle n'est pas présente, la vérification n'a pas lieu.

source: In addition to the options described in this chapter, the boot prompt also accepts <application>dracut</application> kernel options. A list of these options is available as the <systemitem>dracut.cmdline(7)</systemitem> man page.
fr: En plus des options décrites dans ce chapitre, l'invite de commande de démarrage accepte aussi des options du noyau Linux pour <application>dracut</application>. Une liste de ces options est disponible dans la page de manuel <systemitem>dracut.cmdline(7)</systemitem>.

source: Boot options specific to the installation program always start with <literal>inst.</literal> in this guide. Currently, this prefix is optional - for example, <option>resolution=1024x768</option> will work exactly the same as <option>inst.resolution=1024x768</option>. However, it is expected that the <literal>inst.</literal> prefix will be mandatory in future releases.
fr: Dans ce guide, les options de démarrage spécifiques au programme d'installation commencent toujours par <literal>inst.</literal>. D'une façon générale, ce préfixe est facultatif – par exemple <option>resolution=1024x768</option> donne le même résultat que <option>inst.resolution=1024x768</option>. Néanmoins, on peut s'attendre à ce que ce préfixe <literal>inst.</literal> devienne obligatoire dans les prochaines versions.

source: Configuring the Installation System at the Boot Menu
fr: Configuration du système d'installation depuis le menu de démarrage

source: The exact way to specify custom boot options is differs based on your system's architecture, firmware and the method you use to boot the installation. If you are booting from local media, you can specify options in the boot menu, before you begin the installation; if you are booting from a network using a PXE server, you must add boot options into the boot loader configuration file before you boot the installation system. For specific instructions, see <xref linkend="sect-boot-menu" /> if you are booting from local media, and <xref linkend="chap-pxe-server-setup" /> if you are booting from a server.
fr: La manière précise de spécifier les options personnalisées de démarrage diffère selon l'architecture de votre système, le micrologiciel de votre machine et la méthode que vous utilisez pour démarrer l'installation. Si vous démarrez d'un média local, vous pouvez spécifier les options dans le menu de démarrage ; si vous démarrez à partir d'un réseau en utilisant un serveur PXE, vous devez ajouter les options de démarrage dans le fichier de configuration du chargeur de démarrage avant de démarrer le système d'installation. Pour des instructions spécifiques, reportez-vous à la <xref linkend="sect-boot-menu" /> si vous utilisez un média local, et au <xref linkend="chap-pxe-server-setup" /> si vous utilisez un serveur PXE.

source: Available Boot Options
fr: Options de démarrage disponibles

source: The following options are available in &PRODUCT;:
fr: Les options suivantes sont disponibles dans &PRODUCT; :

source: Specifying the Installation Source
fr: Définition de la source d'installation

source: Specifies the installation source - that is, a location where the installation program can find the images and packages it requires. For example:
fr: Spécifie la source d'installation, c'est à dire l'emplacement où l'installateur peut trouver les images et les paquets dont il a besoin. Par exemple :

source: The source must be either:
fr: La source doit être au choix :

source: an installable tree, which is a directory structure containing the installation program's images, packages and repodata as well as a valid <filename>.treeinfo</filename> file
fr: Un arbre installable, c'est à dire une structure de dossiers contenant les images du programme d'installation, les paquets et les « repodata » (données sur les dépôts) ainsi qu'un fichier <filename>.treeinfo</filename> valide.

source: a DVD (a physical disk present in the system's DVD drive)
fr: Un DVD (un disque physique présent dans le lecteur de DVD du système).

source: an ISO image of the full &PRODUCT; installation DVD, placed on a hard drive or a network location accessible from the installation system
fr: Une image ISO du DVD d'installation complète de &PRODUCT; placée sur un disque dur ou un emplacement réseau accessible au système d'installation.

source: This option allows for the configuration of different installation methods using different formats. The syntax is described in the table below.
fr: Cette option permet la configuration de diverses méthodes d'installation avec des formats différents. La syntaxe est décrite dans le tableau ci-dessous :

source: Installation Sources
fr: Sources d'installation

source: Installation source
fr: Source d'installation

source: Option format
fr: Format d'option

source: Any CD/DVD drive
fr: N'importe quel lecteur CD/DVD

source: Specific CD/DVD drive
fr: Un lecteur CD/DVD particulier

source: <option>inst.repo=cdrom:<replaceable>device</replaceable></option>
fr: <option>inst.repo=cdrom:<replaceable>périphérique</replaceable></option>

source: Hard Drive
fr: Un disque dur

source: <option>inst.repo=hd:<replaceable>device</replaceable>:/<replaceable>path</replaceable></option>
fr: <option>inst.repo=hd:<replaceable>périphérique</replaceable>:/<replaceable>chemin</replaceable></option>

source: HTTP Server
fr: Un serveur HTTP

source: <option>inst.repo=http://<replaceable>host</replaceable>/<replaceable>path</replaceable></option>
fr: <option>inst.repo=http://<replaceable>hôte</replaceable>/<replaceable>chemin</replaceable></option>

source: HTTPS Server
fr: Un serveur HTTPS

source: <option>inst.repo=https://<replaceable>host</replaceable>/<replaceable>path</replaceable></option>
fr: <option>inst.repo=https://<replaceable>hôte</replaceable>/<replaceable>chemin</replaceable></option>

source: FTP Server
fr: Un serveur FTP

source: <option>inst.repo=ftp://<replaceable>username</replaceable>:<replaceable>password</replaceable>@<replaceable>host</replaceable>/<replaceable>path</replaceable></option>
fr: <option>inst.repo=ftp://<replaceable>nom_utilisateur</replaceable>:<replaceable>mot_de_passe</replaceable>@<replaceable>hôte</replaceable>/<replaceable>chemin</replaceable></option>

source: NFS Server
fr: Un serveur NFS

source: <option>inst.repo=nfs:[<replaceable>options</replaceable>:]<replaceable>server</replaceable>:/<replaceable>path</replaceable></option> <footnote> <para> This option uses NFS protocol version 3 by default. To use a different version, add <option>+nfsvers=<replaceable>X</replaceable></option> to <replaceable>options</replaceable>. </para> </footnote>
fr: <option>inst.repo=nfs:[<replaceable>options</replaceable>:]<replaceable>serveur</replaceable>:/<replaceable>chemin</replaceable></option> <footnote> <para> Cette option utilise le protocole NFS version 3 par défaut. Pour utiliser une version différente, ajoutez <option>+nfsvers=<replaceable>X</replaceable></option> dans les <replaceable>options</replaceable>.</para></footnote>

source: Disk device names may be specified using the following formats:
fr: Les noms de périphérique des disques peuvent être indiqués avec les formats suivants :

source: Kernel device name, for example <systemitem>/dev/sda1</systemitem> or <systemitem>sdb2</systemitem>
fr: un nom de périphérique noyau, par exemple <systemitem>/dev/sda</systemitem> ou <systemitem>sdb2</systemitem> ;

source: File system label, for example <systemitem>LABEL=Flash</systemitem> or <systemitem>LABEL=RHEL7</systemitem>
fr: une étiquette de système de fichiers, par exemple <systemitem>LABEL=Flash</systemitem> ou <systemitem>LABEL=RHEL7</systemitem> ;

source: File system UUID, for example <systemitem>UUID=8176c7bf-04ff-403a-a832-9557f94e61db</systemitem>
fr: un UUID du système de fichiers, par exemple <systemitem>UUID=8176c7bf-04ff-403a-a832-9557f94e61db</systemitem>.

source: Non-alphanumeric characters must be represented as <literal>\x<replaceable>NN</replaceable></literal>, where <replaceable>NN</replaceable> is the hexadecimal representation of the character. For example, <literal>\x20</literal> is a white space ("<literal> </literal>").
fr: Les caractères non-alpha-numériques doivent être présentés sous la forme <literal>\x<replaceable>NN</replaceable></literal>, où <replaceable>NN</replaceable> est la représentation hexadécimale du caractère. Par exemple, <literal>\x20</literal> représente un espace ("<literal> </literal>").

source: Specifies the location of the installation program runtime image to be loaded. The syntax is the same as in <xref linkend="tabl-boot-options-sources" />. This option expects a path to a directory containing a valid <filename>.treeinfo</filename> file; the location of the runtime image will be read from this file if found. If a <filename>.treeinfo</filename> file is not available, <application>Anaconda</application> will try to load the image from <filename>LiveOS/squashfs.img</filename>.
fr: Spécifie l'emplacement de l'image exécutable du programme d'installation à charger. La syntaxe est la même que dans le <xref linkend="tabl-boot-options-sources" />. Cette option attend un chemin vers un dossier contenant un fichier <filename>.treeinfo</filename> valide ; l'emplacement de l'image exécutable est lu depuis ce fichier s'il est trouvé. Si aucun fichier <filename>.treeinfo</filename> n'est disponible, <application>Anaconda</application> tente de charger l'image depuis <filename>LiveOS/squashfs.img</filename>.

source: By default, this boot option is used on the installation media and set to a specific label (for example, <option>inst.stage2=hd:LABEL=F21\x20Server.x86_64</option>). If you modify the default label of the file system containing the runtime image, you must also edit this option to match the new label.
fr: Par défaut, cette option de démarrage est utilisée sur le média d'installation pour définir une étiquette spécifique (par exemple, <option>inst.stage2=hd:LABEL=F21\x20Server.x86_64</option>). Si vous modifiez l'étiquette par défaut du système de fichiers contenant l'image exécutable, vous devez également éditer cette option pour qu'elle corresponde à la nouvelle étiquette.

source: If you need to perform a driver update during the installation, use the <option>inst.dd=</option> option. It can be used multiple times. The location of a driver RPM package can be specified using any of the formats described in <xref linkend="tabl-boot-options-sources" />. With the exception of the <option>inst.dd=cdrom</option> option, the device name must always be specified. For example:
fr: Si vous devez effectuer une mise à jour de pilote durant l'installation, utilisez l'option <option>inst.dd=</option>. Elle peut être utilisée plusieurs fois. L'emplacement du paquet RPM d'un pilote peut être indiqué en utilisant les formats décrits dans le <xref linkend="tabl-boot-options-sources" />. À l'exception de l'option <option>inst.dd=cdrom</option>, le nom du périphérique doit toujours être spécifié. Par exemple :

source: Using this option without any parameters (only as <option>inst.dd</option>) will prompt the installation program to ask you for a driver update disk with an interactive menu.
fr: Utiliser cette option sans paramètre (seulement sous la forme <option>inst.dd</option>) conduit le programme d'installation à vous inviter à insérer un disque de pilotes et à procéder à une mise à jour des pilotes à l'aide d'un menu interactif.

source: You should never attempt to perform a driver update during the installation unless a missing our faulty driver is preventing you from completing the installation. Updating drivers which are not essential during the installation should always be performed after the system is installed.
fr: Vous ne devez jamais tenter de mettre les pilotes à jour durant une installation sauf si un pilote défectueux ou manquant vous empêche de terminer l'installation. La mise à jour des pilotes qui ne sont pas essentiels pour l'installation doit toujours être faite après l'installation du système.

source: Prevents the installer from trying to automatically configure an installation source.
fr: Empêche l'installateur de tenter de configurer une source d'installation automatiquement.

source: Normally, when you first enter the <guilabel>Installation Summary</guilabel> screen, the installer will attempt to configure an installation source based on the type of media you used to boot. The full &PRODUCT; Server DVD will configure the source as local media, the netinst ISO image will configure the closest network mirror, etc. This process takes time; therefore, if you plan to use a different source than the default, this option will allow you to enter the <guilabel>Installation Source</guilabel> screen immediately without having to wait for the initial configuration to finish.
fr: Normalement, lorsque vous atteignez l'écran <guilabel>Résumé de l'installation</guilabel>, l'installateur tente de configurer une source d'installation en se basant sur le type de média que vous avez utilisé pour démarrer. Le DVD de &PRODUCT; Server configure la source en tant que média local, l'image ISO « netinst » configure le miroir réseau le plus proche, etc. Ce processus prend du temps ; c'est pourquoi, si vous envisagez d'utiliser une source d'installation différente de la source par défaut, cette option vous permet d'atteindre l'écran <guilabel>Source d'installation</guilabel> immédiatement sans attendre que la configuration initiale ne soit terminée.

source: Using this option will leave the installation source configuration in an error state - you must manually specify a source in the <guilabel>Installation Source</guilabel> screen to proceed with the installation. Alternatively, you can use the <option>inst.repo=</option> option described above to configure a specific source directly in the boot menu.
fr: Utiliser cette option laisse la configuration de la source d'installation en erreur – vous devrez spécifier manuellement une source dans l'écran <guilabel>Source d'installation</guilabel> pour pouvoir commencer l'installation. En alternative, vous pouvez utiliser l'option <option>inst.repo=</option> décrite plus haut pour configurer une source spécifique dans le menu de démarrage.

source: Kickstart Boot Options
fr: Options de démarrage « Kickstart »

source: Gives the location of a Kickstart file to be used to automate the installation. Locations can be specified using any of the formats valid for <option>inst.repo=</option>. See <xref linkend="tabl-boot-options-sources" /> for valid formats.
fr: Fournit l'emplacement d'un fichier Kickstart à utiliser pour automatiser l'installation. L'emplacement peut être spécifié en utilisant n'importe quel format valable pour l'option <option>inst.repo=</option>. Voir le <xref linkend="tabl-boot-options-sources" /> pour les formats valables.

source: If you only specify a device and not a path, the installation program will look for the Kickstart file in <filename>/ks.cfg</filename> on the specified device. If you use this option without specifying a device, the installation program will use the following:
fr: Si vous spécifiez seulement un périphérique et non pas un chemin, le programme d'installation recherche le fichier Kickstart dans <filename>/ks.cfg</filename> sur le périphérique spécifié. Si vous utilisez cette option sans spécifier un périphérique, le programme d'installation utilise ceci :

source: <option>inst.ks=nfs:<replaceable>next-server</replaceable>:/<replaceable>filename</replaceable></option>
fr: <option>inst.ks=nfs:<replaceable>serveur_suivant</replaceable>:/<replaceable>nom_du_fichier</replaceable></option>

source: In the above example, <replaceable>next-server</replaceable> is the DHCP <literal>next-server</literal> option or the IP address of the DHCP server itself, and <replaceable>filename</replaceable> is the DHCP <literal>filename</literal> option, or <filename>/kickstart/</filename>. If the given file name ends with the <literal>/</literal> character, <literal><replaceable>ip</replaceable>-kickstart</literal> is appended. For example:
fr: Dans l'exemple ci-dessus, <replaceable>serveur_suivant</replaceable> désigne l'option <literal>next-server</literal> du fichier de configuration de DHCP ou l'adresse IP du serveur DHCP lui-même, et <replaceable>nom_du_fichier</replaceable> représente l'option <literal>filename</literal> de DHCP, ou bien <filename>/kickstart/</filename>. Si le nom du fichier indiqué se termine par le caractère <literal>/</literal>, <literal><replaceable>ip</replaceable>-kickstart</literal> lui est ajouté. Par exemple :

source: Default Kickstart File Location
fr: Emplacement par défaut du fichier « Kickstart »

source: DHCP server address
fr: Adresse du serveur DHCP

source: Client address
fr: Adresse du client

source: Kickstart file location
fr: Emplacement du fichier « Kickstart »

source: Adds headers to outgoing <systemitem class="protocol">HTTP</systemitem> requests with the MAC addresses of all network interfaces. For example:
fr: Ajoute des en-têtes aux requêtes <systemitem class="protocol">HTTP</systemitem> sortantes avec les adresses MAC de toutes les interfaces réseau. Par exemple :

source: This can be useful when using <option>inst.ks=http</option> to provision systems.
fr: Cela peut être utile avec <option>inst.ks=http</option> pour provisionner des systèmes.

source: Adds a header to outgoing <systemitem class="protocol">HTTP</systemitem> requests. This header will contain the system's serial number, read from <filename>/sys/class/dmi/id/product_serial</filename>. The header has the following syntax:
fr: Ajoute un en-tête aux requêtes <systemitem class="protocol">HTTP</systemitem> sortantes. Cet en-tête contient le numéro de série du système, lu à partir de <filename>/sys/class/dmi/id/product_serial</filename>. La syntaxe de l'en-tête est la suivante :

source: Console, Environment and Display Options
fr: Options de console, d'environnement et d'affichage

source: This kernel option specifies a device to be used as the primary console. For example, to use a console on the first serial port, use <option>console=ttyS0</option>. This option should be used along with the <option>inst.text</option> option.
fr: Cette option du noyau spécifie un périphérique à utiliser comme console primaire. Par exemple, pour utiliser une console sur le premier port série, utilisez <option>console=ttyS0</option>. Cette option doit être utilisée avec l'option <option>inst.text</option>.

source: You can use this option multiple times. In that case, the boot message will be displayed on all specified consoles, but only the last one will be used by the installation program afterwards. For example, if you specify <option>console=ttyS0 console=ttyS1</option>, the installation program will only use <literal>ttyS1</literal>.
fr: Vous pouvez utiliser cette option plusieurs fois. Dans ce cas, le message au démarrage sera affiché sur toutes les consoles spécifiées, mais seule la dernière est utilisée par le programme d'installation par la suite. Par exemple, si vous spécifiez <option>console=ttyS0 console=ttyS1</option>, le programme d'installation utilise seulement <literal>ttyS1</literal>.

source: Disables access to the root shell during the installation. This is useful with automated (Kickstart) installations - if you use this option, a user can watch the installation progress, but they cannot interfere with it by accessing the root shell by pressing <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F2</keycap></keycombo>.
fr: Interdit l'accès à l'interpréteur de commandes en tant que super-utilisateur (root) durant l'installation. Ceci est utile avec des installations automatisées (Kickstart) – si vous utilisez cette option, un utilisateur peut regarder l'avancement de l'installation mais ne peut interférer avec elle en accédant à l'interpréteur de commandes en tant que super-utilisateur (root) en pressant <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F2</keycap></keycombo>.
