Repository: jaaf/po_purifier
Catalog: testing_data/Boot_Options.po
Languages: fr

source: See <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> for more information about GPT and MBR, and <xref linkend="sect-disk-partitioning-guid-partition-table" /> for more general information about GPT, MBR and disk partitioning in general.
fr: Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> pour plus d'information sur la GPT et le MBR, et à la <xref linkend="sect-disk-partitioning-guid-partition-table" /> pour une information plus générale sur la GPT, le MBR et le partitionnement des disques.

source: This option controls the usage of <firstterm>zRAM</firstterm> swap during the installation. It creates a compressed block device inside the system RAM and uses it for swap space instead of the hard drive. This allows the installer to essentially increase the amount of memory available, which makes the installation faster on systems with low memory.
fr: Cette option contrôle l'utilisation de la <firstterm>zRAM</firstterm> en swap pendant l'installation. Elle crée un périphérique de blocs compressé dans la RAM système et l'utilise en tant qu'espace d'échange (swap) à la place du disque dur. Ceci permet essentiellement à l'installateur d'augmenter la quantité de mémoire disponible, ce qui accélère l'installation sur les systèmes disposant de peu de mémoire.

source: By default, swap on zRAM is enabled on systems with 2 GB or less RAM, and disabled on systems with more than 2 GB of memory. You can use this option to change this behavior - on a system with more than 2 GB RAM, use <option>inst.zram=1</option> to enable it, and on systems with 2 GB or less memory, use <option>inst.zram=0</option> to disable this feature.
fr: Par défaut, l'espace d'échange (swap) sur zRAM est activé sur les systèmes disposant de 2 Go, ou moins, de mémoire, et désactivé sur les systèmes disposant de plus de 2 Go de mémoire. Vous pouvez utiliser cette option pour changer ce comportement – sur un système avec plus de 2 Go de RAM, utilisez <option>inst.zram=1</option> pour activer cette fonctionnalité, et sur les systèmes avec 2 Go ou moins, utilisez <option>inst.zram=0</option> pour la désactiver.

source: Perform a check at the beginning of the installation to determine if there is enough available RAM. If there is not enough memory detected, the installation will stop with an error message. This option is enabled by default; use <option>inst.memcheck=0</option> to disable it.
fr: Vérifie en début d'installation s'il y a suffisamment de mémoire RAM disponible. S'il n'y en pas assez, l'installation s'arrête et émet un message d'erreur. Cette option est activée par défaut ; utilisez <option>inst.memcheck=0</option> pour la désactiver.

source: Use the older <application>Yum</application> backend for package installation and dependency resolution instead of <application>DNF</application>. See the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="https://docs.fedoraproject.org/" />, for details about <application>DNF</application>.
fr: Utilise <application>Yum</application> pour l'installation des paquets et la résolution des dépendances plutôt que <application>DNF</application>. Reportez-vous au <citetitle>Guide de l'administrateur système &PRODUCT; </citetitle>, disponible à <ulink url="https://docs.fedoraproject.org/" />, pour des détails sur <application>DNF</application>.

source: Turns the <application>Kdump</application> installer add-on <literal>on</literal> or <literal>off</literal> (the add-on is off by default). If you use <option>inst.kdump_addon=on</option>, a new screen, which allows you to configure the <application>Kdump</application> kernel crash dumping mechanism, will appear in the main menu of the graphical or text interface (see <xref linkend="sect-installation-gui-kdump" />). Enabling this add-on is also necessary to use the <xref linkend="sect-kickstart-commands-kdump" /> Kickstart command.
fr: Fait passer le module d'extension <application>Kdump</application> de l'installateur à <literal>on</literal> (en service) ou à <literal>off</literal> (hors service) (le module est hors service par défaut). Si vous utilisez <option>inst.kdump_addon=on</option>, un nouvel écran, qui vous permet de configurer le mécanisme de <application>Kdump</application> de photographie de la mémoire et des registres lors des plantages du noyau (kernel crash dumping) apparaît dans le menu principal de l'interface graphique ou textuelle (voir la <xref linkend="sect-installation-gui-kdump" />). L'activation de ce module d'extension est aussi nécessaire pour utiliser la commande Kickstart <xref linkend="sect-kickstart-commands-kdump" />.

source: Enabling Remote Access Using VNC
fr: Autorisation de l'accès à distance par VNC

source: The following options are necessary to configure <application>Anaconda</application> for remote graphical installation. See <xref linkend="chap-vnc-installations" /> for more details.
fr: Les options suivantes sont nécessaires pour configurer <application>Anaconda</application> pour une installation graphique à distance. Voir le <xref linkend="chap-vnc-installations" /> pour plus de détails.

source: Specifies that the installation program's graphical interface should be run in a <systemitem class="protocol">VNC</systemitem> session. If you specify this option, you will need to connect to the system using a <systemitem class="protocol">VNC</systemitem> client application to be able to interact with the installation program. <systemitem class="protocol">VNC</systemitem> sharing is enabled, so multiple clients can connect to the system at the same time.
fr: Spécifie que l'interface graphique du programme d'installation doit être exécutée dans une session <systemitem class="protocol">VNC</systemitem>. Si vous spécifiez cette option, vous devez vous connecter au système en utilisant une application cliente <systemitem class="protocol">VNC</systemitem> afin de pouvoir interagir avec le programme d'installation. Le partage <systemitem class="protocol">VNC</systemitem> est activé de manière à ce que plusieurs clients puissent se connecter au système en même temps.

source: A system installed using <systemitem class="protocol">VNC</systemitem> will start in text mode by default.
fr: Un système installé avec <systemitem class="protocol">VNC</systemitem> démarre en mode texte par défaut.

source: <systemitem class="protocol">VNC</systemitem> server used by the installation program. Any <systemitem class="protocol">VNC</systemitem> client attempting to connect to the system will have to provide the correct password to gain access. For example, <option>inst.vncpassword=<replaceable>testpwd</replaceable></option> will set the password to <literal>testpwd</literal>. The password must be between 6 and 8 characters long.
fr: Un client <systemitem class="protocol">VNC</systemitem> cherchant à se connecter au serveur <systemitem class="protocol">VNC</systemitem> utilisé par le programme d'installation doit, pour obtenir l'accès, fournir un mot de passe correct . Par exemple, <option>inst.vncpassword=<replaceable>mdptest</replaceable></option> définit le mot de passe <literal>mdptest</literal>. Le mot de passe doit comprendre entre 6 et 8 caractères.

source: If you specify an invalid password (one that is too short or too long), you will be prompted to specify a new one by a message from the installation program:
fr: Si vous spécifiez un mot de passe non valide (trop long ou trop court), le programme d'installation vous invite à en définir un autre sous forme d'un message ressemblant à ceci :

source: VNC password must be six to eight characters long. Please enter a new one, or leave blank for no password. Password:
fr: Le mot de passe VNC doit comprendre entre 6 et 8 caractères. Veuillez entrer un nouveau mot de passe ou laisser en blanc si vous ne voulez pas de mot de passe. Mot de passe :

source: Connect to a listening <systemitem class="protocol">VNC</systemitem> client at a specified host and port once the installation starts. The correct syntax is <option>inst.vncconnect=<replaceable>host</replaceable>:<replaceable>port</replaceable></option>. The <replaceable>port</replaceable> parameter is optional - if you do not specify one, the installation program will use <literal>5900</literal>.
fr: Se connecte à un client <systemitem class="protocol">VNC</systemitem> sur un hôte et un port spécifiés lorsque l'installation commence. La syntaxe correcte est : <option>inst.vncconnect=<replaceable>hôte</replaceable>:<replaceable>port</replaceable></option>. Le paramètre <replaceable>port</replaceable> est facultatif – si vous n'en spécifiez pas, le programme d'installation utilise le port <literal>5900</literal>.

source: Debugging and Troubleshooting
fr: Débogage et dépannage

source: Specifies the location of the <filename>updates.img</filename> file to be applied to the installation program runtime. The syntax is the same as in the <option>inst.repo</option> option - see <xref linkend="tabl-boot-options-sources" /> for details. In all formats, if you do not specify a file name but only a directory, the installation program will look for a file named <filename>updates.img</filename>.
fr: Spécifie l'emplacement du fichier <filename>updates.img</filename> à appliquer à l'exécutable du programme d'installation. La syntaxe est la même que pour l'option <option>inst.repo</option> – voir le <xref linkend="tabl-boot-options-sources" /> pour les détails. Dans tous les formats, si vous ne spécifiez pas un nom de fichier mais seulement un répertoire, le programme d'installation y recherche un fichier nommé <filename>updates.img</filename>.

source: Specifies the minimum level for messages to be logged on a terminal. This only concerns real-time logging in a terminal; log files will always contain messages of all levels.
fr: Spécifie le niveau minimum des messages qui sont renvoyés sur un terminal. Cela ne concerne que la connexion temps réel dans un terminal : les fichiers journaux contiennent toujours les messages de tous les niveaux.

source: Possible values for this option from the lowest to highest level are: <literal>debug</literal>, <literal>info</literal>, <literal>warning</literal>, <literal>error</literal> and <literal>critical</literal>. The default value is <literal>info</literal>, which means that by default, the logging terminal will display messages ranging from <literal>info</literal> to <literal>critical</literal>, but not <literal>debug</literal>.
fr: Les valeurs possibles pour cette options sont, par niveau d'abstraction croissant : <literal>debug</literal>, <literal>info</literal>, <literal>warning</literal>, <literal>error</literal> et <literal>critical</literal>. La valeur par défaut est <literal>info</literal>, ce qui signifie que par défaut, le terminal de connexion affiche les messages allant du niveau <literal>info</literal> au niveau <literal>critical</literal>, mais n'affiche pas ceux du niveau <literal>debug</literal>.

source: Once the installation starts, this option sends log messages to the syslog process on the specified host. The remote syslog process must be configured to accept incoming connections.
fr: Dès que l'installation commence, cette option dirige les messages sur le processus syslog de l'hôte spécifié. Le processus syslog distant doit être configuré pour accepter les connexions entrantes.

source: Specifies a <systemitem>virtio</systemitem> port (a character device at <filename>/dev/virtio-ports/<replaceable>name</replaceable></filename>) to be used for forwarding logs. The default value is <literal>org.fedoraproject.anaconda.log.0</literal>; if this port is present, it will be used.
fr: Définit un port <systemitem>virtio</systemitem> (un périphérique mode caractère à <filename>/dev/virtio-ports/<replaceable>nom</replaceable></filename>) à utiliser pour transférer les journaux. La valeur par défaut est <literal>org.fedoraproject.anaconda.log.0</literal> ; si ce port est présent, il est utilisé.

source: Deprecated Boot Options
fr: Options de démarrage obsolètes

source: Options in this list are <emphasis>deprecated</emphasis>. They will still work, but there are other options which offer the same functionality and should be preferred. Using deprecated options is not recommended and they are expected to be removed in future releases.
fr: Les options de cette liste sont <emphasis>obsolètes</emphasis>. Elles fonctionneront encore mais il y a d'autres options offrant les mêmes fonctionnalités qui leurs sont préférables. L'utilisation d'options obsolètes n'est pas recommandée et il faut s'attendre à ce qu'elles soient retirées dans les versions futures.

source: Note that as described in the introduction to this chapter, options specific to the installation program now use the <literal>inst.</literal> prefix. For example, the <option>vnc=</option> option is considered deprecated and replaced by the <option>inst.vnc=</option> option. However, these changes are not listed here.
fr: Notez bien que, comme décrit en introduction de ce chapitre, les options spécifiques au programme d'installation utilisent désormais le préfixe <literal>inst.</literal>. Par exemple, l'option <option>vnc=</option> est considérée comme étant obsolète et est remplacée par l'option <option>inst.vnc=</option>. Néanmoins, ces changements ne sont pas mentionnés ici.

source: Used to specify that the machine being installed onto does not have any display hardware, and to prevent the installer from trying to detect a display.
fr: Utilisé pour spécifier que la machine sur laquelle le système sera installé ne dispose pas de moniteur, empêchant ainsi l'installateur de rechercher un moniteur.

source: Configured the installation method. Use the <option>inst.repo=</option> option instead.
fr: Servait à configurer la méthode d'installation. Utilisez l'option <option>inst.repo=</option> à la place.

source: <option>repo=nfsiso:<replaceable>server</replaceable>:/<replaceable>path</replaceable></option>
fr: <option>repo=nfsiso:<replaceable>serveur</replaceable>:/<replaceable>chemin</replaceable></option>

source: In NFS installations, specified that the target is an ISO image located on an NFS server instead of an installable tree. The difference is now detected automatically, which means this option is the same as <option>inst.repo=nfs:<replaceable>server</replaceable>:/<replaceable>path</replaceable></option>.
fr: Dans les installation NFS, servait à spécifier que la cible était une image ISO située sur un serveur NFS plutôt qu'un arbre installable. La différence est désormais détectée automatiquement, ce qui signifie que cette option est remplaçable par <option>inst.repo=nfs:<replaceable>serveur</replaceable>:/<replaceable>chemin</replaceable></option>.

source: Configured the Domain Name Server (DNS). Use the <option>nameserver=</option> option instead.
fr: Servait à configurer le serveur de noms (DNS). Utilisez l'option <option>nameserver=</option> à la place.

source: These options have been consolidated under the <option>ip=</option> option.
fr: Ces options ont été consolidées sous l'option <option>ip=</option>.

source: Select network device to be used at early stage of installation. Different values have been replaced with different options; see the table below.
fr: Sélectionne le périphérique réseau à utiliser à un stade précoce de l'installation. Différentes valeurs ont été remplacées par différentes options ; reportez-vous au tableau qui suit.

source: Current behavior
fr: Comportement actuel

source: Not present
fr: Non renseignée

source: All devices are attempted to be activated using <systemitem class="protocol">dhcp</systemitem>, unless desired device and configuration is specified by <option>ip=</option> option and/or the <option>BOOTIF</option> option.
fr: Une tentative d'activation de tous les périphériques a lieu en utilisant <systemitem class="protocol">dhcp</systemitem>, sauf si les périphériques désirés et la configuration sont spécifiés par l'option <option>ip=</option> ou l'option <option>BOOTIF</option>.

source: Similar to the above, with the difference that network will always be activated in the initramfs, whether it is needed or not. The supported <option>rd.neednet</option> option (provided by <application>dracut</application>) should be used instead.
fr: Similaire au cas ci-dessus, à la différence que le réseau est toujours activé dans l'initramfs, que ce soit nécessaire ou pas. L'option prise en charge <option>rd.neednet</option> (fournie par <application>dracut</application>) doit être utilisée à la place.

source: Ignored (the BOOTID= option is used by default when specified)
fr: Ignoré (l'option « BOOTID= » est utilisée par défaut si indiquée)

source: Replaced with the <option>ip=ibft</option> option
fr: Remplacée par l'option <option>ip=ibft</option>

source: Replaced with <option>BOOTIF=<replaceable>MAC</replaceable></option>
fr: Remplacée par l'option <option>BOOTIF=<replaceable>MAC</replaceable></option>

source: <option>ksdevice=<replaceable>device</replaceable></option>
fr: <option>ksdevice=<replaceable>périphérique</replaceable></option>

source: Replaced by specifying the device name using the <option>ip=</option> option.
fr: Remplacée en spécifiant le nom du périphérique à l'aide de l'option <option>ip=</option>.

source: When performing a Kickstart installation, booting from local media and having the Kickstart file on local media as well, the network will not be initialized. This means that any other Kickstart options requiring network access, such as pre-installation or post-installation scripts accessing a network location, will cause the installation to fail. This is a known issue; see BZ#<ulink url="https://bugzilla.redhat.com/show_bug.cgi?id=1085310">1085310</ulink> for details.
fr: Lors d'une installation Kickstart, si on démarre sur un média local tout en ayant également le fichier Kickstart sur un média local, le réseau n'est pas initialisé. Cela signifie que l'utilisation de n'importe quelle autre option Kickstart requérant l'accès au réseau, comme la pré-installation ou la post-installation, conduit à un échec de l'installation. C'est un problème connu ; voir BZ#<ulink url="https://bugzilla.redhat.com/show_bug.cgi?id=1085310">1085310</ulink> pour les détails.

source: To work around this issue, either use the <option>ksdevice=link</option> boot option, or add the <option>--device=link</option> option to the <command>network</command> command in your Kickstart file.
fr: Un moyen de contourner ce problème consiste à utiliser l'option de démarrage <option>ksdevice=link</option>, ou à ajouter l'option <option>--device=link</option> à la commande <command>network</command> dans votre fichier Kickstart.

source: Used to disable specified drivers. This is now handled by the <option>modprobe.blacklist=</option> option.
fr: Servait à neutraliser des pilotes spécifiques. Ceci est désormais pris en charge par l'option <option>modprobe.blacklist=</option>.

source: Disabled support for the FireWire interface. You can disable the FireWire driver (<literal>firewire_ohci</literal>) by using the <option>modprobe.blacklist=</option> option instead:
fr: Servait à interdire la prise en charge de l'interface FireWire. Vous pouvez maintenant neutraliser le pilote FireWire (<literal>firewire_ohci</literal>) en utilisant l'option <option>modprobe.blacklist=</option> à la place :

source: Removed Boot Options
fr: Options de démarrage supprimées

source: The following options are removed. They were present in previous releases of &PRODUCT;, but they cannot be used anymore.
fr: Les options suivantes sont supprimées. Elles existaient dans des versions de &PRODUCT; antérieures à celle-ci mais elles ne peuvent plus être utilisées.

source: The installation program's <systemitem>initramfs</systemitem> is now completely non-interactive, which means that this option are not available anymore. Use <option>ip=</option> to configure network settings.
fr: L'<systemitem>initramfs</systemitem> du système d'installation est maintenant complètement non interactive. Ceci signifie que ces options sont maintenant indisponibles. Utilisez l'option <option>ip=</option> pour configurer le réseau.

source: This option forced <application>Anaconda</application> to use the <literal>/dev/ttyS0</literal> console as the output. Use the <option>console=/dev/ttyS0</option> (or similar) instead.
fr: Cette option forçait <application>Anaconda</application> à utiliser la console <literal>/dev/ttyS0</literal> comme sortie. Utilisez l'option <option>console=/dev/ttyS0</option> (ou similaire) à là place.

source: Specified the location of updates for the installation program. Use the <option>inst.updates=</option> option instead.
fr: Servait à spécifier l'emplacement des mises à jour pour le programme d'installation. Utilisez l'option <option>inst.updates=</option> option à la place.

source: Configured wireless network access. Network configuration is now being handled by <application>dracut</application>, which does not support wireless networking, rendering these options useless.
fr: Ces options servaient à configurer l'accès au réseau sans fil. La configuration du réseau est maintenant prise en charge par <application>dracut</application> qui ne prend pas en charge le réseau sans fil ; ces options sont donc devenues inutiles.

source: Used in the past to configure additional low-level network settings. All network settings are now handled by the <option>ip=</option> option.
fr: Utilisé dans le passé pour configurer des réglages de niveau bas pour le réseau. Tous les réglages réseau sont maintenant pris en charge par l'option <option>ip=</option>.

source: Allowed you to debug the loader. Use <option>rd.debug</option> instead.
fr: Vous permettait de déboguer le chargeur. Utilisez l'option <option>rd.debug</option> à la place.

source: Verified the installation media before starting the installation. Replaced with the <option>rd.live.check</option> option.
fr: Cette option vérifiait le média avant de démarrer l'installation. Remplacée par l'option <option>rd.live.check</option>.

source: Specified a floppy disk as the Kickstart file source. Floppy drives are not supported anymore.
fr: Servait à spécifier un disque souple en tant que fichier Kickstart. Les disques souples ne sont plus pris en charge aujourd'hui.

source: Configured a remote display. Replaced with the <option>inst.vnc</option> option.
fr: Servait à configurer un moniteur distant. Remplacée par l'option <option>inst.vnc</option>.

source: Added UTF8 support when installing in text mode. UTF8 support now works automatically.
fr: Servait à ajouter la prise en charge de l'UTF8 lors d'une installation en mode texte. La prise en charge de l'UTF8 est désormais automatique.

source: Used to disable IPv6 support in the installation program. IPv6 is now built into the kernel so the driver cannot be blacklisted; however, it is possible to disable IPv6 using the <option>ipv6.disable</option> option.
fr: Servait à empêcher la prise en charge de d'IPv6 par le programme d'installation. L'IPv6 est désormais prise en charge par le noyau Linux, ce qui fait que le pilote ne peut plus être mis en liste noire. Néanmoins, il est possible de neutraliser l'IPv6 en utilisant l'option <option>ipv6.disable</option>.

source: Upgrades are done in a different way in current &PRODUCT; releases. For more information about upgrading your system, see <xref linkend="chap-upgrading" />.
fr: Les montées en version sont effectuées d'une manière différente dans la version actuelle de &PRODUCT;. Pour plus d'information sur la manière de monter votre système en version, reportez-vous au <xref linkend="chap-upgrading" />.
