Repository: jaaf/po_purifier
Catalog: testing_data/Boot_Options.po
Languages: fr

source: Sets the language to be used during the installation. Language codes are the same as the ones used in the <command>lang</command> Kickstart command as described in <xref linkend="sect-kickstart-commands-lang" />. On systems where the <package>system-config-language</package> package is installed, a list of valid values can also be find in <filename>/usr/share/system-config-language/locale-list</filename>.
fr: Définit la langue à utiliser pendant l'installation. Les codes de langue sont les mêmes que ceux utilisés par la commande Kickstart <command>lang</command> comme cela est expliqué dans la <xref linkend="sect-kickstart-commands-lang" />. Sur les systèmes où le paquet <package>system-config-language</package> est installé, une liste des codes valides est disponible dans le fichier <filename>/usr/share/system-config-language/locale-list</filename>.

source: If you perform the installation interactively, the language you specified using this option will be selected by default, but you will still be able to change it at the beginning of the graphical installation.
fr: Si vous procédez à l'installation de façon interactive, la langue que vous spécifiez avec cette option est choisie par défaut, mais vous aurez toujours la possibilité de la changer au début de l'installation en mode graphique.

source: Configures geolocation usage in the installation program. Geolocation is used to pre-set the language and time zone, and uses the following syntax: <option>inst.geoloc=<replaceable>value</replaceable></option>
fr: Configure l'utilisation de la géolocalisation dans le programme d'installation. La géolocalisation est utilisée pour pré-définir la langue et le fuseau horaire : <option>inst.geoloc=<replaceable>valeur</replaceable></option>.

source: The <replaceable>value</replaceable> parameter can be any of the following:
fr: Le paramètre <replaceable>valeur</replaceable> peut être l'un des suivants :

source: Valid Values for the inst.geoloc Option
fr: Valeurs valides pour l'option « inst.geoloc »

source: Disable geolocation
fr: Désactive la géolocalisation

source: Use the Fedora GeoIP API
fr: Utilise l'API GeoIP de Fedora

source: Use the Hostip.info GeoIP API
fr: Utilise l'API GeoIP de « Hostip.info »

source: If this option is not specified, <application>Anaconda</application> will use <literal>provider_fedora_geoip</literal>.
fr: Si cette option n'est pas spécifiée, <application>Anaconda</application> utilise <literal>provider_fedora_geoip</literal>.

source: Specifies the keyboard layout to be used by the installation program. Layout codes are the same as the ones used in the <command>keyboard</command> Kickstart command as described in <xref linkend="appe-kickstart-syntax-reference" />.
fr: Spécifie l'agencement de clavier qui est utilisé par le programme d'installation. Les codes d'agencement sont les mêmes que ceux utilisés par la commande Kickstart <command>keyboard</command> telle que décrite dans l'<xref linkend="appe-kickstart-syntax-reference" />.

source: Forces the installation program to run in text mode instead of graphical mode. The text user interface is limited, for example, it does not allow you to modify the partition layout or set up LVM. When installing a system on a machine with a limited graphical capabilities, it is recommended to use VNC as described in <xref linkend="sect-boot-options-vnc" />.
fr: Force le programme d'installation à fonctionner en mode texte plutôt qu'en mode graphique. L'interface texte de l'utilisateur est limitée, par exemple, elle ne permet pas de modifier l'agencement des partitions ou de configurer LVM. Lorsque vous installez un système sur une machine avec des capacités graphiques limitées, il est recommandé d'utiliser VNC comme cela est expliqué dans la <xref linkend="sect-boot-options-vnc" />.

source: Forces the installation program to run in command line mode. This mode does not allow any interaction, all options must be specified in a Kickstart file or on the command line.
fr: Force le programme d'installation à fonctionner en mode ligne de commande. Ce mode ne permet aucune interaction, toutes les options doivent être spécifiées dans un fichier Kickstart ou en ligne de commande.

source: Forces the installation program to run in graphical mode. This mode is the default.
fr: Force le programme à fonctionner en mode graphique. Ce mode est le mode par défaut.

source: Specifies the screen resolution in graphical mode. The format is <replaceable>N</replaceable>x<replaceable>M</replaceable>, where <replaceable>N</replaceable> is the screen width and <replaceable>M</replaceable> is the screen height (in pixels). The lowest supported resolution is <literal>800x600</literal>.
fr: Spécifie la résolution d'écran en mode graphique. Le format est <replaceable>N</replaceable>x<replaceable>M</replaceable>, où <replaceable>N</replaceable> représente la largeur d'écran et <replaceable>M</replaceable> représente la hauteur d'écran (en pixels). La résolution la plus basse prise en charge est <literal>800x600</literal>.

source: Specifies the name of the <systemitem>X</systemitem> driver to be used both during the installation and on the installed system.
fr: Définit le nom du pilote <systemitem>X</systemitem> à utiliser à la fois lors de l'installation, puis sur le système installé.

source: Tells the installation program to use the frame buffer <systemitem>X</systemitem> driver instead of a hardware-specific driver. This option is equivalent to <option>inst.xdriver=fbdev</option>.
fr: Demande au programme d'installation d'utiliser le pilote de tampon de trames <systemitem>X</systemitem> plutôt qu'un pilote spécifique au matériel. Cette option est équivalente à l'option <option>inst.xdriver=fbdev</option>.

source: Blacklists (completely disables) one or more drivers. Drivers (mods) disabled using this option will be prevented from loading when the installation starts, and after the installation finishes, the installed system will keep these settings. The blacklisted drivers can then be found in the <filename class="directory">/etc/modprobe.d/</filename> directory.
fr: Inscrit en liste noire ( neutralise complètement) un ou plusieurs pilotes. Les pilotes neutralisés par cette option ne peuvent être chargés lorsque l'installation démarre, ni après qu'elle est achevée ; le système installé conserve ces neutralisations. La liste des pilotes en liste noire est disponible dans le répertoire <filename class="directory">/etc/modprobe.d/</filename> directory.

source: Use a comma-separated list to disable multiple drivers. For example:
fr: Pour neutraliser plusieurs pilotes, saisissez leur nom en les séparant par une virgule. Par exemple :

source: Starts the <systemitem class="service">sshd</systemitem> service during the installation, which allows you to connect to the system during the installation using <systemitem class="protocol">SSH</systemitem> and monitor its progress. For more information on <systemitem class="protocol">SSH</systemitem>, see the <systemitem>ssh(1)</systemitem> man page and the corresponding chapter in the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Démarre le service <systemitem class="service">sshd</systemitem> pendant l'installation, ce qui vous permet de vous connecter au système durant l'installation en utilisant <systemitem class="protocol">SSH</systemitem> et de surveiller son avancement. Pour plus d'information sur <systemitem class="protocol">SSH</systemitem>, consultez la page de manuel de <systemitem>ssh(1)</systemitem> et le chapitre correspondant dans le <citetitle>Guide de l'administrateur système de &PRODUCT;</citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: During the installation, the <systemitem class="username">root</systemitem> account has no password by default. You can set a root password to be used during the installation with the <command>sshpw</command> Kickstart command as described in <xref linkend="sect-kickstart-commands-sshpw" />.
fr: Pendant l'installation, le compte <systemitem class="username">root</systemitem> ne dispose pas d'un mot de passe par défaut. Vous pouvez définir un mot de passe à utiliser pendant l'installation avec la commande Kickstart <command>sshpw</command> comme expliqué dans la <xref linkend="sect-kickstart-commands-sshpw" />.

source: Network Boot Options
fr: Options de démarrage réseau

source: Initial network initialization is handled by <application>dracut</application>. This section only lists some of the more commonly used options; for a complete list, see the <systemitem>dracut.cmdline(7)</systemitem> man page. Additional information on networking is also available in the <citetitle>&PRODUCT; Networking Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: La première initialisation du réseau est prise en charge par <application>dracut</application>. Cette section ne liste que les options les plus utilisées ; pour une liste exhaustive, reportez-vous à la page de manuel <systemitem>dracut.cmdline(7)</systemitem>. De l'information complémentaire est aussi disponible dans le <citetitle>Guide de l'administration réseau de &PRODUCT;</citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: Configures one or more network interfaces. To configure multiple interfaces, use the <literal>ip</literal> option multiple times - once for each interface. If multiple interfaces are configured, you must specify a primary boot interface using the <option>bootdev</option> option described below.
fr: Configure une ou plusieurs interfaces réseau. Pour configurer plusieurs interfaces, utilisez l'option <literal>ip</literal> à plusieurs reprises – une pour chacune des interfaces. Si plusieurs interfaces sont configurées, vous devez spécifier une interface de démarrage primaire en utilisant l'option <option>bootdev</option> décrite plus bas.

source: The following table lists valid values for this option:
fr: Le tableau suivant liste des valeurs valides pour cette option :

source: Network Interface Configuration Formats
fr: Formats de configuration d'interfaces réseau

source: Configuration Method
fr: Méthode de configuration

source: Automatic configuration of any interface
fr: Configuration automatique de toute interface

source: <option>ip=<replaceable>method</replaceable></option>
fr: <option>ip=<replaceable>méthode</replaceable></option>

source: Automatic configuration of a specific interface
fr: Configuration automatique d'une interface donnée

source: <option>ip=<replaceable>interface</replaceable>:<replaceable>method</replaceable></option>
fr: <option>ip=<replaceable>interface</replaceable>:<replaceable>méthode</replaceable></option>

source: Static configuration
fr: Configuration statique

source: <option>ip=<replaceable>ip</replaceable>::<replaceable>gateway</replaceable>:<replaceable>netmask</replaceable>:<replaceable>hostname</replaceable>:<replaceable>interface</replaceable>:none</option>
fr: <option>ip=<replaceable>ip</replaceable>::<replaceable>passerelle</replaceable>:<replaceable>masque_réseau</replaceable>:<replaceable>nom_hôte</replaceable>:<replaceable>interface</replaceable>:none</option>

source: Automatic configuration of a specific interface with an override <footnote> <para> Brings up the specified interface using the specified method of automatic configuration, such as <literal>dhcp</literal>, but overrides the automatically obtained IP address, gateway, netmask, hostname or other specified parameter. All parameters are optional; only specify the ones you wish to override and automatically obtained values will be used for the others. </para> </footnote>
fr: Configuration automatique d'une interface donnée par surcharge <footnote> <para> Détecte l'interface donnée avec la méthode de configuration automatique indiquée, par exemple <literal>dhcp</literal>, mais surcharge l'adresse IP, la passerelle, le masque de réseau, le nom d'hôte ou tout autre paramètre donné obtenu automatiquement. Tous les paramètres sont optionnels ; ne précisez que ceux que vous voulez surcharger, les valeurs obtenues automatiquement pour les autres seront conservées. </para> </footnote>

source: <option>ip=<replaceable>ip</replaceable>::<replaceable>gateway</replaceable>:<replaceable>netmask</replaceable>:<replaceable>hostname</replaceable>:<replaceable>interface</replaceable>:<replaceable>method</replaceable>:<replaceable>mtu</replaceable></option>
fr: <option>ip=<replaceable>ip</replaceable>::<replaceable>passerelle</replaceable>:<replaceable>masque_réseau</replaceable>:<replaceable>nom_hôte</replaceable>:<replaceable>interface</replaceable>:<replaceable>méthode</replaceable>:<replaceable>taille_maximale</replaceable></option>

source: The <option>method</option> parameter can be any the following:
fr: Le paramètre <option>méthode</option> peut être l'un des suivants :

source: Automatic Interface Configuration Methods
fr: Méthodes de configuration automatique d'interface

source: Automatic configuration method
fr: Méthode de configuration automatique

source: Value
fr: Valeur

source: IPv6 automatic configuration
fr: Configuration automatique IPv6

source: iBFT (iSCSI Boot Firmware Table)
fr: iBFT (table de micrologiciels de démarrage iSCSI)

source: If you use a boot option which requires network access, such as <option>inst.ks=http://<replaceable>host</replaceable>:/<replaceable>path</replaceable></option>, without specifying the <option>ip</option> option, the installation program will use <option>ip=dhcp</option>.
fr: Si vous utilisez une option de démarrage qui requiert un accès au réseau, comme <option>inst.ks=http://<replaceable>nom_hôte</replaceable>:/<replaceable>chemin</replaceable></option>, sans spécifier l'option <option>ip</option>, le programme d'installation utilisera <option>ip=dhcp</option>.

source: In the above tables, the <replaceable>ip</replaceable> parameter specifies the client's IP address. <systemitem class="protocol">IPv6</systemitem> addresses can be specified by putting them in square brackets, for example, <literal>[2001:DB8::1]</literal>.
fr: Dans les tableaux ci-dessus, le paramètre <replaceable>ip</replaceable> représente l'adresse IP du client. Les adresses <systemitem class="protocol">IPv6</systemitem> peuvent être indiquées en les mettant entre crochets, par exemple, <literal>[2001:DB8::1]</literal>.

source: The <replaceable>gateway</replaceable> parameter is the default gateway. IPv6 addresses are accepted here as well.
fr: Le paramètre <replaceable>passerelle</replaceable> désigne la passerelle par défaut. Les adresses IPv6 sont également acceptées ici.

source: The <replaceable>netmask</replaceable> parameter is the netmask to be used. This can either be a full netmask (for example <literal>255.255.255.0</literal>) or a prefix (for example <literal>64</literal>).
fr: Le paramètre <replaceable>masque_réseau</replaceable> est le masque réseau à utiliser. Il peut être, soit un masque réseau complet (par exemple <literal>255.255.255.0</literal>), soit un préfixe (par exemple <literal>64</literal>).

source: The <replaceable>hostname</replaceable> parameter is the host name of the client system. This parameter is optional.
fr: Le paramètre <replaceable>nom_hôte</replaceable> est le nom d'hôte du système client. Ce paramètre est facultatif.

source: Specifies the address of the name server. This option can be used multiple times.
fr: Spécifie l'adresse du serveur de noms. Cette option peut être utilisée à plusieurs reprises.

source: Specifies the boot interface. This option is mandatory if you use more than one <option>ip</option> option.
fr: Spécifie l'interface de démarrage. Cette option est obligatoire si vous utilisez plus d'une option <option>ip</option>.

source: Assigns a given interface name to a network device with a given MAC address. Can be used multiple times. The syntax is <option>ifname=<replaceable>interface</replaceable>:<replaceable>MAC</replaceable></option>. For example:
fr: Assigne un nom d'interface à un périphérique réseau doté d'une adresse MAC donnée. Cette option peut être utilisée à plusieurs reprises. La syntaxe est <option>ifname=<replaceable>interface</replaceable>:<replaceable>MAC</replaceable></option>. Par exemple :

source: Specifies the DHCP vendor class identifier. The <systemitem class="service">dhcpd</systemitem> service will see this value as <literal>vendor-class-identifier</literal>. The default value is <literal>anaconda-$(uname -srm)</literal>.
fr: Spécifie l'identifiant DHCP de classe du fabricant. Le service <systemitem class="service">dhcpd</systemitem> considère cette valeur comme le <literal>vendor-class-identifier</literal> . La valeur par défaut est : <literal>anaconda-$(uname -srm)</literal>.

source: Sets up a Virtual LAN (VLAN) device on a specified interface with a given name. The syntax is <option>vlan=<replaceable>name</replaceable>:<replaceable>interface</replaceable></option>. For example:
fr: Configure un périphérique de réseau local virtuel (VLAN) sur une interface spécifiée avec un nom donné. La syntaxe est : <option>vlan=<replaceable>nom</replaceable>:<replaceable>interface</replaceable></option>. Par exemple :

source: The above will set up a VLAN device named <literal>vlan5</literal> on the <literal>em1</literal> interface. The <replaceable>name</replaceable> can take the following forms:
fr: La déclaration ci-dessus configure un périphérique VLAN nommé <literal>vlan5</literal> sur l'interface <literal>em1</literal>. La valeur <replaceable>nom</replaceable> peut prendre l'une des formes suivantes :

source: VLAN Device Naming Conventions
fr: Conventions de nommage des périphériques VLAN

source: Naming scheme
fr: Schéma de nommage

source: Example
fr: Exemple

source: Set up a bonding device with the following syntax: <option>bond=<replaceable>name</replaceable>[:<replaceable>slaves</replaceable>][:<replaceable>options</replaceable>]</option>. Replace <replaceable>name</replaceable> with the bonding device name, <replaceable>slaves</replaceable> with a comma-separated list of physical (ethernet) interfaces, and <replaceable>options</replaceable> with a comma-separated list of bonding options. For example:
fr: Définit un périphérique agrégé (bonding device) avec la syntaxe suivante : <option>bond=<replaceable>nom</replaceable>[:<replaceable>esclaves</replaceable>][:<replaceable>options</replaceable>]</option>. Remplacez <replaceable>nom</replaceable> par le nom du périphérique agrégé, <replaceable>esclaves</replaceable> par une liste de noms d'interface physique (Ethernet) séparés l'un de l'autre par une virgule, et <replaceable>options</replaceable> par une liste des options d'agrégation séparées l'une de l'autre par une virgule. Par exemple :

source: For a list of available options, execute the <command>modinfo bonding</command> command.
fr: Pour connaître la liste des options disponibles exécutez la commande <command>modinfo bonding</command>.

source: Using this option without any parameters will assume <option>bond=bond0:eth0,eth1:mode=balance-rr</option>.
fr: Utiliser cette option sans paramètre revient à supposer : <option>bond=bond0:eth0,eth1:mode=balance-rr</option>.

source: Set up a team device with the following syntax: <option>team=<replaceable>master</replaceable>:<replaceable>slaves</replaceable></option>. Replace <replaceable>master</replaceable> with the name of the master team device and <replaceable>slaves</replaceable> with a comma-separated list of physical (ethernet) devices to be used as slaves in the team device. For example:
fr: Configure un périphérique en équipe (team device) avec la syntaxe suivante : <option>team=<replaceable>maître</replaceable>:<replaceable>esclaves</replaceable></option>. Remplacez <replaceable>maître</replaceable> par le nom du périphérique maître de l'équipe et <replaceable>esclaves</replaceable> par la liste de noms des périphériques physiques (Ethernet) à utiliser en tant qu'esclaves dans le périphérique en équipe, séparés l'un de l'autre par une virgule. Par exemple :

source: Advanced Installation Options
fr: Options d'installation avancées

source: Configure the system for multilib packages (that is, to allow installing 32-bit packages on a 64-bit x86 system) and install packages specified in this section as such.
fr: Configure le système pour les paquets « multilib » (c'est à dire, autorise l'installation de paquets 32 bits sur un système x86 64 bits) et installe les paquets indiqués dans cette section comme tels.

source: Normally, on an AMD64 or Intel&nbsp;64 system, only packages for this architecture (marked as <literal>x86_64</literal>) and packages for all architectures (marked as <literal>noarch</literal> would be installed. When you use this option, packages for 32-bit AMD or Intel systems (marked as <literal>i686</literal>) will be automatically installed as well if available.
fr: Normalement, sur un système AMD64 ou Intel&nbsp;64, seuls les paquets pour cette architecture (marqués par <literal>x86_64</literal>) et les paquets pour toutes les architectures (marqués par <literal>noarch</literal> sont installés. Lorsque vous utilisez cette option, les paquets prévus pour les systèmes 32-bit AMD ou Intel (marqués par <literal>i686</literal>) sont eux aussi automatiquement installés s'ils sont disponibles.

source: This only applies to packages directly specified in the <literal>%packages</literal> section. If a package is only installed as a dependency, only the exact specified dependency will be installed. For example, if you are installing package <package>foo</package> which depends on package <package>bar</package>, the former will be installed in multiple variants, while the latter will only be installed in variants specifically required.
fr: Cela ne concerne que les paquets directement définis dans la section <literal>%packages</literal>. Si un paquet n'est installé qu'en tant que dépendance, seule la dépendance exactement indiquée est installée. Par exemple, si vous êtes en train d'installer le paquet <package>foo</package> qui dépend du paquet <package>bar</package>, le premier est installé dans ses multiples variantes, alors que le dernier n'est installé que dans les variantes spécialement requises.

source: Force the installation program to install partition information into a GUID Partition Table (GPT) instead of a Master Boot Record (MBR). This option is meaningless on UEFI-based systems, unless they are in BIOS compatibility mode.
fr: Force le programme d'installation à placer les informations de partitionnement dans une table de partitions GUID (GPT) plutôt que dans un enregistrement maître de démarrage (MBR). Cette option n'est pas reconnue par les systèmes dotés d'un micrologiciel UEFI, sauf si ce dernier est dans le mode « compatible BIOS ».

source: Normally, BIOS-based systems and UEFI-based systems in BIOS compatibility mode will attempt to use the MBR schema for storing partitioning information, unless the disk is larger than 2 TB. Using this option will change this behavior, allowing a GPT to be written even to disks smaller than 2 TB.
fr: Ordinairement, les systèmes démarrés par un micrologiciel BIOS et les systèmes démarrés par un micrologiciel UEFI en mode « compatible BIOS » essayent d'utiliser le schéma MBR pour stocker leurs informations de partitionnement, sauf si la capacité du disque est plus grande que 2 To. En utilisant cette option, le comportement est modifié, autorisant ainsi à écrire dans une GPT même si la capacité du disque est inférieure à 2 To.
