Repository: jaaf/po_purifier
Catalog: testing_data/Boot_Options.po
Languages: fr

source: Used to configure Virtual LAN (802.1q tag) devices. Use the <option>vlan=</option> option instead.
fr: Servait à configurer les périphériques de réseau local virtuel (802.1q tag). Utilisez l'option <option>vlan=</option> à la place.

source: Used to enable <application>DNF</application> to handle package installation and dependency resolution in &PRODUCT; 21. <application>DNF</application> is now used by default and this option has been replaced with <option>inst.nodnf</option>, which reverts back to <application>Yum</application>.
fr: Était utilisé pour autoriser <application>DNF</application> à gérer les paquets et à résoudre les dépendances dans &PRODUCT; 21. Le gestionnaire de paquets <application>DNF</application> est maintenant utilisé par défaut et cette option a été remplacée par l'option <option>inst.nodnf</option>, qui permet de revenir au gestionnaire <application>Yum</application>.

source: Using the Maintenance Boot Modes
fr: Utilisation des modes de démarrage de maintenance

source: Loading the Memory (RAM) Testing Mode
fr: Chargement du mode de test de la mémoire (RAM)

source: Faults in memory (RAM) modules may cause your system to freeze or crash unpredictably. In some cases, memory faults may only cause errors with particular combinations of software. For this reason, you should test the memory of a computer before you install &PRODUCT; for the first time, even if it has previously run other operating systems.
fr: Des défauts de modules de mémoire peuvent geler votre système ou le planter de manière imprédictible. Dans certains cas, les défauts de la mémoire peuvent seulement entraîner des erreurs dans des combinaisons particulières de programmes. Pour cette raison, vous devriez tester la mémoire d'un ordinateur avant d'installer &PRODUCT; pour la première fois, même si l'ordinateur a fonctionné avec d'autres systèmes d'exploitation.

source: &PRODUCT; includes the <application>Memtest86+</application> memory testing application. To start memory testing mode, choose <guisubmenu>Troubleshooting</guisubmenu> &gt; <guimenuitem>Memory test</guimenuitem> at the boot menu. Testing will begin immediately. By default, <application>Memtest86+</application> carries out ten tests in every pass; a different configuration can be specified by accessing the configuration screen using the <keycap>c</keycap> key. After the first pass completes, a message will appear at the bottom informing you of the current status, and another pass will start automatically.
fr: &PRODUCT; comprend le programme <application>Memtest86+</application> pour tester la mémoire. Pour entrer dans le mode de test de la mémoire, choisissez <guisubmenu>Troubleshooting</guisubmenu> &gt; <guimenuitem>Memory test</guimenuitem> dans le menu de démarrage . Le test démarre immédiatement. Par défaut, le programme <application>Memtest86+</application> effectue 10 tests à chacune des passes ; un fonctionnement différent peut être spécifié en accédant à l'écran de configuration en pressant la touche <keycap>c</keycap>. À la fin de la première passe, un message apparaît en bas de l'écran pour vous informer de l'état courant et une autre passe démarre automatiquement.

source: <application>Memtest86+</application> only works on systems with BIOS firmware. Support for UEFI systems is currently unavailable.
fr: Le programme <application>Memtest86+</application> ne fonctionne que sur les machines avec un micrologiciel BIOS. La prise en charge du micrologiciel UEFI n'est pas disponible pour le moment.

source: Memory Check Using Memtest86+
fr: Test de la mémoire avec Memtest86+

source: The main screen displayed while testing is in progress is divided into three main areas:
fr: L'écran principal affiché pendant le test est divisé en trois zones principales :

source: The upper left corner shows information about your system's memory configuration - the amount of detected memory and processor cache and their throughputs and processor and chipset information. This information is detected when <application>Memtest86+</application> starts.
fr: Le coin supérieur gauche affiche des informations sur la configuration mémoire de votre système – la quantité de mémoire détectée et de mémoire cache du processeur, leur débit d'accès et des informations sur le processeur et le jeu de circuits (chipset). Ces informations sont détectées au démarrage de <application>Memtest86+</application>.

source: The upper right corner displays information about the tests - progress of the current pass and the currently running test in that pass as well as a description of the test.
fr: Le coin supérieur droit affiche des informations sur le test – avancement de la passe en cours, le test en cours dans cette passe et la description de ce test.

source: The central part of the screen is used to display information about the entire set of tests from the moment when the tool has started, such as the total time, the number of completed passes, number of detected errors and your test selection. On some systems, detailed information about the installed memory (such as the number of installed modules, their manufacturer, frequency and latency) will be also displayed here. After the each pass completes, a short summary will appear in this location. For example:
fr: La partie centrale de l'écran est utilisée pour afficher des information sur la totalité du jeu de tests depuis que l'outil a démarré, telles que le nombre de passes effectuées, le nombre d'erreurs détectées et votre sélection de tests. Sur certains systèmes, des informations détaillées sur la mémoire installée (comme le nombre de modules installés, leur fabricant, leur fréquence et leur latence) y seront également affichées. Après que chacune des passes est terminée, un bref résumé y est affiché. Par exemple :

source: If <application>Memtest86+</application> detects an error, it will also be displayed in this area and highlighted red. The message will include detailed information such as which test detected a problem, the memory location which is failing, and others.
fr: Lorsque <application>Memtest86+</application> détecte une erreur, elle est également affichée dans cette zone et mise en évidence par la couleur rouge. Le message inclut des informations détaillées telles que le nom du test qui a détecté le problème, l'emplacement défaillant en mémoire et autres.

source: In most cases, a single successful pass (that is, a single run of all 10 tests) is sufficient to verify that your RAM is in good condition. In some rare circumstances, however, errors that went undetected on the first pass might appear on subsequent passes. To perform a thorough test on an important system, leave the tests running overnight or even for a few days in order to complete multiple passes.
fr: Dans la plupart des cas une seule passe réussie (c'est à dire une seule sur les dix prévues) est suffisante pour vérifier que votre mémoire RAM est en bon état. Dans certaines circonstances rares cependant, des erreurs qui n'ont pas été détectées lors d'une première passe, le sont aux passes suivantes. Pour accomplir un test complet sur des systèmes importants, laissez le test fonctionner toute une nuit, voire plusieurs jours, pour effectuer à coup sûr plusieurs passes.

source: The amount of time it takes to complete a single full pass of <application>Memtest86+</application> varies depending on your system's configuration (notably the RAM size and speed). For example, on a system with 2&nbsp;GB of DDR2 memory at 667&nbsp;MHz, a single pass will take roughly 20&nbsp;minutes to complete.
fr: Le temps nécessaire pour effectuer une seule passe de <application>Memtest86+</application> dépend de la configuration de votre système (notamment de la taille de sa mémoire et de sa vitesse). Par exemple, sur un système doté de 2 Go de mémoire DDR2 à 667 MHz, une seule passe prend environ 20 minutes.

source: To halt the tests and reboot your computer, press the <keycap>Esc</keycap> key at any time.
fr: Pour arrêter votre test et redémarrer l'ordinateur, pressez la touche d'échappement (échap) à n'importe quel moment.

source: For more information about using <application>Memtest86+</application>, see the official website at <ulink url="http://www.memtest.org/" />. A <filename>README</filename> file is also located in <filename class="directory">/usr/share/doc/memtest86+-<replaceable>version</replaceable>/</filename> on &PRODUCT; systems with the <package>memtest86+</package> package installed.
fr: Pour plus d'information sur <application>Memtest86+</application>, reportez-vous à son site officiel à <ulink url="http://www.memtest.org/" />. Un fichier <filename>README</filename> est également disponible dans le dossier <filename class="directory">/usr/share/doc/memtest86+-<replaceable>version</replaceable>/</filename> sur les systèmes &PRODUCT; avec le paquet <package>memtest86+</package> installé.

source: Verifying Boot Media
fr: Vérification du média de démarrage

source: You can test the integrity of an ISO-based installation source before using it to install &PRODUCT;. These sources include DVDs and ISO images stored on a local hard drive or NFS server. Verifying that the ISO images are intact before you attempt an installation helps to avoid problems that are often encountered during installation.
fr: Vous pouvez vérifier l'intégrité d'une source d'installation basée sur une image ISO avant de l'utiliser pour installer &PRODUCT;. Une telle source peut être un DVD ou une image ISO stockée sur un disque dur local ou sur un serveur NFS. Vérifier que l'image ISO est intègre avant de se lancer dans l'installation permet de s'affranchir de certains problèmes lors de l'installation.

source: To test the integrity of an ISO image, append the <option>rd.live.check</option> to the boot loader command line. Note that this option is used automatically if you select the default installation option from the boot menu (<guimenuitem>Test this media &amp; install Fedora</guimenuitem>).
fr: Pour vérifier l'intégrité d'une image ISO, ajoutez l'option <option>rd.live.check</option> à la ligne de commande du chargeur de démarrage. Notez bien que cette option est utilisée automatiquement si vous sélectionnez l'option par défaut du menu de démarrage (<guimenuitem>Test this media &amp; install Fedora</guimenuitem>).

source: Booting Your Computer in Rescue Mode
fr: Démarrage de l'ordinateur en mode de secours

source: You may boot a command-line Linux system from an installation disc without actually installing &PRODUCT; on the computer. This enables you to use the utilities and functions of a running Linux system to modify or repair already installed operating systems.
fr: Vous pouvez démarrer un système Linux en ligne de commande depuis un disque d'installation sans installer &PRODUCT; sur l'ordinateur. Ceci vous permet d'utiliser les utilitaires et les fonctionnalités d'un système Linux en marche pour modifier ou réparer un système d'exploitation déjà installé.

source: To load the rescue system with the installation disk or USB drive, choose <guimenuitem>Rescue a &PRODUCT; system</guimenuitem> from the <guisubmenu>Troubleshooting</guisubmenu> submenu in the boot menu, or use the <option>inst.rescue</option> boot option.
fr: Pour charger le système de dépannage depuis le disque ou la clé USB d'installation, choisissez <guimenuitem>Rescue a &PRODUCT; system</guimenuitem> (Dépanner un système Fedora) dans le sous-menu <guisubmenu>Troubleshooting</guisubmenu> (Résolution des problèmes) du menu de démarrage ou utilisez l'option de démarrage <option>inst.rescue</option>.

source: Specify the language, keyboard layout and network settings for the rescue system with the screens that follow. The final setup screen configures access to the existing system on your computer.
fr: Précisez la langue, l'agencement de clavier et les réglages réseau pour le système de dépannage dans les écrans qui suivent. L'écran de paramétrage final configure un accès au système existant sur l'ordinateur.

source: By default, rescue mode attaches an existing operating system to the rescue system under the directory <filename>/mnt/sysimage/</filename>.
fr: Par défaut, le mode dépannage attache un système d'exploitation existant au système de dépannage dans le répertoire <filename>/mnt/sysimage/</filename>.
