Repository: jaaf/po_purifier
Catalog: testing_data/Booting_the_Installation.po
Languages: fr

source: Booting the Installation
fr: Démarrer sur le média d'installation

source: This chapter will explain 2 MB how to 3 Mio MBR MBR boot the installer from local media or a network server as well as how to navigate the boot menu and use custom options.
fr: Ce chapitre explique comment démarrer l'installateur depuis un média local ou un serveur réseau ainsi que comment naviguer dans le menu de démarrage et utiliser les options de personnalisation.

source: Preparing to Boot
fr: Préparation du démarrage

source: After you have made a bootable USB flash drive or a CD or DVD using the steps described in <xref linkend="sect-preparing-boot-media" />, you are ready to boot the installation. Note that the steps described below are generic and the exact steps will vary somewhat depending on your system - particularly on your motherboard manufacturer.
fr: Après que vous avez créé une clé USB, un CD ou un DVD amorçable en suivant les étapes indiquées à la <xref linkend="sect-preparing-boot-media" />, vous êtes prêt à démarrer l'installation. Notez bien que les étapes indiquées ci-dessous sont génériques et qu'elles peuvent varier un peu selon votre système – en particulier selon le fabricant de votre carte mère.

source: There are no separate media provided for BIOS and UEFI systems; all of them can boot from the same ISO image. However, once you install &PRODUCT;, you can not switch between UEFI and BIOS. The system must run on the same firmware it was installed on; if you, for example, perform the installation on an UEFI system in UEFI mode, and then switch it to BIOS compatibility mode, &PRODUCT; will no longer boot and will require a reinstallation.
fr: Il n'y a pas de média différent selon que le système est doté d'un micrologiciel BIOS ou d'un micrologiciel UEFI ; ils sont tous les deux capables démarrer sur la même image ISO. Cependant, une fois que &PRODUCT; est installée, vous ne pouvez pas basculer de BIOS vers UEFI et inversement. Le système doit être amorcé par le même micrologiciel que celui avec lequel il a été installé. Si, par exemple, vous avez effectué l'installation sur un système UEFI dans le mode UEFI, et que vous passez ensuite dans le mode compatible BIOS, &PRODUCT; refuse de démarrer et nécessite une réinstallation.

source: &PRODUCT; does not support UEFI booting for 32-bit x86 systems. Only BIOS boot is supported on these systems.
fr: &PRODUCT; ne prend pas en charge le démarrage UEFI pour les systèmes 32 bits x86. Seul le démarrage BIOS est pris en charge pour de tels systèmes.

source: Also note that &PRODUCT; only fully supports version 2.2 of the UEFI specification. Hardware that supports version 2.3 or later will boot and work normally, but the additional functionality defined by these later specifications will not be available. The UEFI specifications are available from <ulink url="http://www.uefi.org/specs/agreement/" />.
fr: Notez aussi que &PRODUCT; ne prend en charge que la version 2.2 de la spécification UEFI. Les matériels qui prennent en charge la version 2.3, ou postérieures, démarrent et fonctionnent normalement, mais les fonctionnalités additionnelles que ces versions présentent ne sont pas disponibles. Les spécifications UEFI sont disponibles à <ulink url="http://www.uefi.org/specs/agreement/" />.

source: To boot the &PRODUCT; installer, follow these steps:
fr: Pour démarrer l'installateur de &PRODUCT;, suivez les étapes suivantes :

source: Booting the &PRODUCT; Installer
fr: Démarrage de l'installateur &PRODUCT;

source: Plug in the boot USB drive, or insert the boot CD or DVD into your computer's optical disc drive. Alternatively, if you plan on booting from a network boot (PXE) server, make sure that the network cable is plugged in.
fr: Branchez la clé USB ou insérez le CD ou DVD de démarrage dans votre lecteur optique. Autrement, si vous envisagez de démarrer sur un serveur de démarrage réseau (PXE), assurez-vous que le câble du réseau est raccordé.

source: Restart the system. Once it starts rebooting, it should display a prompt similar to the following (usually at the bottom of the screen):
fr: Redémarrez le système. Dès qu'il commence son redémarrage, il affiche une invite semblable à la suivante (généralement en bas de l'écran) :

source: Press F12 to select boot device, or Del to enter SETUP
fr: Pressez la touche F12 pour sélectionner le périphérique de démarrage, ou la touche de suppression pour entrer dans le menu du micrologiciel.

source: Follow the on-screen instructions to access the boot menu. If no instructions are displayed (some systems only display a graphical logo during early stages of boot), try pressing <keycap>F12</keycap>, <keycap>F11</keycap>, <keycap>F10</keycap> or <keycap>Del</keycap> several times; these are most commonly used keys. Note that there is usually a very short time window provided to access the menu; once it passes, you need to restart the system and try again.
fr: Suivez les instructions données à l'écran pour accéder au menu d'ordre de démarrage. Si aucune instruction n'est donnée (certains systèmes se contentent d'afficher un logo dans les phases précoces de l'installation), essayez en pressant une des touches de fonction <keycap>F12</keycap>, <keycap>F11</keycap>, <keycap>F10</keycap> ou <keycap>Del</keycap> plusieurs fois ; ce sont les touches le plus couramment employées. Notez bien que ces touches ne sont utilisables que pendant un bref laps de temps ; passé ce laps de temps, il vous faut redémarrer à nouveau et réessayer.

source: Some older systems may not support choosing a boot device at startup. In that case, enter the system's SETUP (BIOS), and change the default boot order so that your boot media (CD, DVD, USB or network) has higher priority than internal hard drives.
fr: Certains systèmes anciens ne prennent pas en charge le menu de choix de l'ordre de démarrage. Dans ce cas, il vous faut entrer dans le micrologiciel (BIOS) du système et y changer l'ordre de démarrage par défaut de manière à ce que votre média d'installation (CD, DVD, USB ou réseau) ait priorité sur les disques durs internes.

source: On Mac hardware, hold down the <keycap>Option</keycap> key to enter the boot media selection menu.
fr: Sur les ordinateurs MAC, maintenez la touche <keycap>Option</keycap> enfoncée pour entrer dans le menu de sélection du média de démarrage.

source: When your system's boot menu opens, select an entry such as <guilabel>Boot from USB</guilabel> if you created a bootable USB drive, <guilabel>Boot from CD/DVD</guilabel> if you are using an optical disc to install &PRODUCT;, or <guilabel>Boot from PXE</guilabel> if you want to boot from a network location.
fr: Lorsque le menu de démarrage de votre système apparaît, choisissez <guilabel>Boot from USB</guilabel> si vous voulez utiliser une clé USB ou un disque USB, <guilabel>Boot from CD/DVD</guilabel> si vous voulez utiliser un disque optique pour installer &PRODUCT;, ou encore <guilabel>Boot from PXE</guilabel> si vous voulez démarrer depuis un emplacement réseau.

source: Wait until the boot menu is displayed. The boot menu is described further in this chapter.
fr: Patientez jusqu'à ce que le menu de démarrage apparaisse. Le menu de démarrage est décrit plus loin dans ce chapitre.

source: The Boot Menu
fr: Le menu de démarrage

source: In most cases, when you boot the &PRODUCT; installer from your prepared boot media or server, the boot menu will be the first thing that appears. From this menu, you can either start the actual installation, or you can use the boot media to rescue an existing system.
fr: Dans la plupart des cas, lorsque vous démarrez l'installateur de &PRODUCT; depuis le média de démarrage que vous avez préparé, le menu de démarrage est la première chose qui se présente à vous. Depuis ce menu, vous pouvez, au choix, démarrer une installation ou dépanner un système existant.

source: The way the boot menu will look and function will vary somewhat depending on your system's firmware - BIOS systems use the <application>SYSLINUX</application> boot loader, and UEFI systems use <application>GRUB2</application>. However, both of the menus described below function very similarly from a user's point of view.
fr: L'apparence et la manière dont le menu fonctionne dépendent du micrologiciel de votre machine – le BIOS utilise le chargeur de démarrage <application>SYSLINUX</application> , et l'UEFI utilise le chargeur de démarrage <application>GRUB2</application>. Néanmoins, les deux menus décrits ci-après fonctionnent de manière très similaire du point de vue de l'utilisateur.

source: Use arrow keys to select an entry in the menu, and <keycap>Enter</keycap> to confirm your selection. The first two entries in the list will both proceed with the installation; the first one will start the installer directly, and the second one will verify the integrity of the boot media before starting the installation.
fr: Utilisez les touches de direction pour sélectionner une entrée du menu, et la touche <keycap>Entrée</keycap> pour confirmer votre sélection. Les deux premières entrées de la liste permettent de démarrer l'installation ; la première démarre l'installateur directement, et la seconde vérifie l'intégrité du média d'installation avant de le lancer.

source: The final entry in the list is <guilabel>Troubleshooting</guilabel>; this is a submenu. Selecting this entry and pressing <keycap>Enter</keycap> will display a new set of selections, where you can choose to install in basic graphics mode (useful if you want to do a manual graphical installation but your system has issues with the default graphical installer), rescue an existing system, or test your system's memory modules for errors (on BIOS systems only). The troubleshooting menu also allows you to exit the boot menu and boot normally from your system's hard drive via the <guilabel>Boot from local drive</guilabel> option.
fr: La dernière entrée de la liste est <guilabel>Troubleshooting</guilabel> (Dépannage) ; il s'agit d'un sous-menu. Sélectionner cette entrée et presser la touche <keycap>Entrée</keycap> provoque l'affichage d'un nouveau jeu de sélections possibles. Vous pouvez y choisir d'installer en mode graphique (utile si vous désirez faire une installation graphique manuelle et si votre système a des problèmes avec l'installateur graphique par défaut), de dépanner un système existant ou de tester les modules mémoires de votre système pour y déceler des erreurs (sur les systèmes à BIOS seulement). Le menu de dépannage vous permet aussi de sortir du menu de démarrage et de redémarrer sur le disque dur de votre système via l'option <guilabel>Boot from local drive</guilabel> (Démarrer du disque local).

source: Every menu entry in the list is a predefined set of boot options, and these options can be customized to change some aspects of the installer's behavior. To edit the default set of boot options, press <keycap>Tab</keycap> on BIOS systems, or <keycap>e</keycap> on UEFI systems. The key to use is also displayed at the bottom of the screen.
fr: Chacune des entrées dans la liste correspond à un jeu prédéfini d'options de démarrage. Ces options peuvent être personnalisées pour changer quelques comportements de l'installateur. Pour éditer le jeu d'options par défaut, pressez la touche <keycap>Tab</keycap> sur un système avec BIOS, ou la touche <keycap>e</keycap> sur un système avec UEFI. La touche à utiliser est affichée en bas de l'écran.

source: Editing boot options in <application>GRUB2</application> (on UEFI systems) will display the entire configuration for the selected entry. Actual boot options are configured on the line which starts with the <literal>linux</literal> (or <literal>linux16</literal> or <literal>linuxefi</literal>) keyword. Do not modify any other lines in the configuration.
fr: L'édition des options de démarrage dans <application>GRUB2</application> (sur un système UEFI) affiche la configuration complète de l'entrée sélectionnée. Les options de démarrage réelles sont configurées sur la ligne qui commence par le mot clé <literal>linux</literal>, <literal>linux16</literal>, ou <literal>linuxefi</literal>. Ne changez aucune autre ligne dans la configuration.

source: On systems with BIOS firmware, only the actual boot options are displayed when you press <keycap>Tab</keycap>.
fr: Sur les systèmes dotés d'un micrologiciel BIOS, seules les options de démarrage réelles sont affichées lorsque vous pressez la touche <keycap>Tab</keycap>.

source: When editing the default set of options, you can change the existing ones as well as append additional ones. Once you finish, press <keycap>Enter</keycap> on BIOS or <keycombo><keycap>Ctrl</keycap><keycap>X</keycap></keycombo> on UEFI to boot the installer using your customized options.
fr: Lorsque vous éditez le jeu d'options par défaut, vous pouvez changer celles qui existent ou en ajouter d'autres. Une fois que vous avez terminé, pressez la touche <keycap>Entrée</keycap> sur BIOS, ou <keycombo><keycap>Ctrl</keycap><keycap>X</keycap></keycombo> sur UEFI, pour que l'installateur démarre avec vos options personnalisées.

source: Editing boot options on a system with BIOS firmware
fr: Édition des options de démarrage sur un système doté d'un micrologiciel BIOS

source: All available <application>Anaconda</application> boot options are described in <xref linkend="sect-boot-options-available" />.
fr: Toutes les options de démarrage valides d'<application>Anaconda</application> sont décrites dans la <xref linkend="sect-boot-options-available" />.
