Repository: jaaf/po_purifier
Catalog: testing_data/CustomSpoke_SoftwareRAID.po
Languages: fr

source: Creating Software RAID
fr: Création d'un RAID logiciel

source: <firstterm>Redundant arrays of independent disks</firstterm> (RAIDs) are constructed from multiple storage devices that are arranged to provide increased performance and, in some configurations, greater fault tolerance. See <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> a description of different kinds of RAIDs.
fr: Les <firstterm>Redundant arrays of independent disks</firstterm> (RAIDs)(Groupements redondant de disques indépendants) sont fabriqués à partir de plusieurs périphériques de stockage qui sont agencés pour procurer une meilleure performance et, dans certaines configuration, une plus grande tolérance aux erreurs. Voir la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> pour une description des différentes sortes de RAID.

source: A RAID device is created in one step, and disks are added or removed as necessary. One RAID partition per physical disk is allowed for each device, so the number of disks available to the installation program determines which levels of RAID device are available to you. For example, if your system has two hard drives, the installation program will not allow you to create a RAID10 device, which requires 4 separate partitions.
fr: Un périphérique RAID est créé en une étape, et les disques sont ajoutés et retirés si besoin. Une partition RAID par disque physique est autorisée pour chaque périphérique, ainsi le nombre de disques disponibles par l'installateur détermine quels niveaux de RAID vous sont disponibles. Par exemple, si votre système possède deux disques durs, l'installateur ne pourra vous laisser créer un RAID10 qui a besoin de 4 partitions séparées.

source: This section only explains how to create software RAID with standard (physical) partitions. However, you can also configure LVM volume groups and Btrfs volumes to use RAID and place their logical volumes or Btrfs subvolumes on top of this RAID array. See <xref linkend="sect-installation-gui-manual-partitioning-lvm" /> and <xref linkend="sect-installation-gui-manual-partitioning-btrfs" /> for instructions on creating RAID in LVM and Btrfs.
fr: Cette section se limite à expliquer comment créer des RAID logiciel avec des partitions standard (physiques). Néanmoins, vous pouvez aussi configurer les groupes de volumes LVM et les volumes Btrfs pour qu'ils utilisent le RAID et placent leurs volumes logiques ou sous-volumes (pour Btrfs) sur ces groupement RAID. Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-lvm" /> et à la <xref linkend="sect-installation-gui-manual-partitioning-btrfs" /> pour des instructions sur la manière de créer des RAIDs pour LVM et Btrfs.

source: Create Software RAID
fr: Création d'un RAID logiciel

source: RAID configuration options are only visible if you have selected two or more disks for installation. At least two disks are required to create a RAID device, and some RAID layouts will require more. Requirements for different types of RAID are described in <xref linkend="sect-installation-gui-manual-partitioning-filesystems" />.
fr: Les options de configuration du RAID sont seulement visibles si vous avez sélectionné deux disques ou plus pour l'installation. Au moins deux disques sont nécessaires pour créer un périphérique RAID et certains niveaux de RAID en requièrent plus. Les exigences pour les différents types de RAID sont décrites à la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" />.

source: Follow the procedure below to create software RAID:
fr: Suivez la procédure ci-dessous pour créer un RAID logiciel :

source: Click the <guilabel>+</guilabel> button at the bottom of the list showing existing mount points. A new dialog window will open.
fr: Cliquez sur le bouton <guilabel>+</guilabel> en bas de la liste des points de montage. Une nouvelle fenêtre de dialogue s'ouvre.

source: In the new dialog window, specify a mount point for which you want to create a separate software RAID partition - for example, <filename class="directory">/</filename>. Optionally, specify a size for the new partition using standard units such as MB or GB (for example, <literal>50GB</literal>). Then, click <guilabel>Add mount point</guilabel> to add the mount point and return to the main partitioning screen.
fr: Dans cette fenêtre de dialogue, spécifiez un point de montage pour lequel vous voulez créer une partition séparée RAID logiciel – par exemple, <filename class="directory">/</filename>. En option, vous pouvez spécifier une taille pour la nouvelle partition en utilisant les unités standard telles que Mo ou Go (par exemple, <literal>50 Go</literal>). Cliquez ensuite sur le bouton <guilabel>Ajouter un point de montage</guilabel> pour ajouter le point de montage et retourner à l'écran de partitionnement principal.

source: When creating a mount point for swap on software RAID, specify the mount point as <literal>swap</literal>.
fr: Lors de la création d'un point de montage pour la partition d'échange sur RAID logiciel, spécifiez le point de montage en tant que <literal>swap</literal>.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a software RAID partition by changing the <guilabel>Device Type</guilabel> option to <guilabel>RAID</guilabel>.
fr: Le point de montage a maintenant été créé en utilisant les réglages par défaut, c'est à dire qu'il a été créé en tant que volume logique. Sélectionnez le point de montage nouvellement créé dans le panneau de gauche et configurez le plus en détail. Convertissez-le en partition RAID logiciel en changeant l'option <guilabel>Type de périphérique</guilabel> en <guilabel>RAID</guilabel>.

source: Choose a RAID type from the <guilabel>RAID Level</guilabel> drop-down menu. Available RAID types and their requirements are described in <xref linkend="sect-installation-gui-manual-partitioning-filesystems" />.
fr: Choisissez un type de RAID dans le menu déroulant <guilabel>Niveau de RAID</guilabel>. Les types de RAID disponibles et leurs exigences sont décrits à la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" />.

source: In the <guilabel>Device(s)</guilabel> section on the right side of the screen, you can see that the partition has been assigned to several physical disks. Click the <guilabel>Modify</guilabel> button to configure on which drives this partition will be created.
fr: Dans la section <guilabel>Périphérique(s)</guilabel> à droite de l'écran, vous pouvez constater que plusieurs disques ont été assignés à la partition. Cliquez sur le bouton <guilabel>Modifier</guilabel> pour configurer quels disques seront utilisés pour cette partition.

source: In the <guilabel>Configure Mount Point</guilabel> dialog, you can specify which physical devices (disks) this partition <emphasis>may</emphasis> reside on. You can select one or more disks which will be used to hold this partition by holding down <keycap>Ctrl</keycap> and clicking each disk in the list. If you want to make sure that this partition is placed on a specific set of hard drives, select only those drives and unselect all others.
fr: Dans la fenêtre de dialogue <guilabel>Configurer le point de montage</guilabel>, vous pouvez spécifier sur quels disques physiques cette partition <emphasis>peut</emphasis> résider. Vous pouvez sélectionner un ou plusieurs disques à utiliser en maintenant la touche <keycap>Ctrl</keycap> enfoncée et en cliquant sur chacun des disques dans la liste. Si vous voulez être sûr que la partition sera placée sur un ensemble donné de disques, ne sélectionnez que ceux-ci et dé-sélectionnez les autres.

source: After you finish configuring the partition's location, click <guilabel>Save</guilabel> to return to the main <guilabel>Manual Partitioning</guilabel> screen.
fr: Une fois la configuration de l'emplacement de votre partition achevée, cliquez sur le bouton <guilabel>Enregistrer</guilabel> pour sauvegarder vos choix et retourner à l'écran <guilabel>Partitionnement manuel</guilabel>.

source: Configure other settings specific to the partition - its <guilabel>Mount Point</guilabel>, <guilabel>Desired Capacity</guilabel>, and <guilabel>File System</guilabel>. Press <guilabel>Update Settings</guilabel> to apply any changes to the configuration.
fr: Continuez la configuration de votre partition – son <guilabel>Point de montage</guilabel>, sa <guilabel>Capacité souhaitée</guilabel> et son <guilabel>Système de fichiers</guilabel>. Cliquez sur le bouton <guilabel>Mise à jour des paramètres </guilabel> pour appliquer les changements à la configuration.

source: Repeat this procedure for any additional standard partitions with software RAID you want to create.
fr: Répétez cette procédure pour toute partition additionnelle standard avec RAID logiciel que vous voulez créer.
