Repository: jaaf/po_purifier
Catalog: testing_data/CustomSpoke_PartitioningAdvice.po
Languages: fr

source: Advice on Partitions
fr: Conseils sur le partitionnement

source: There is no best way to partition every system; the optimal setup depends on how you plan to use the system being installed. However, the following tips may help you find the optimal layout for your needs:
fr: Il n'y a pas de meilleure façon de partitionner valable pour tous les systèmes. L'optimal dépend de la manière dont vous envisagez d'utiliser le système installé. Néanmoins, les conseils qui suivent sont susceptibles de vous aider à trouver le partitionnement qui répond le mieux à vos besoins.

source: Consider encrypting any partitions and volumes which might contain sensitive data. Encryption prevents unauthorized people from accessing the data on the partitions, even if they have access to the physical storage device. In most cases, you should at least encrypt the <filename class="directory">/home</filename> partition, which contains user data.
fr: Envisagez de chiffrer les partitions et volumes qui sont destinés à accueillir des données sensibles. Le chiffrement empêche des personnes non autorisées d'accéder aux données des partitions, même si elles ont accès au média physique. Dans la plupart des cas, vous devriez au moins chiffrer la partition <filename class="directory">/home</filename> qui contient les données des utilisateurs.

source: In some cases, creating separate mount points for directories other than <filename class="directory">/</filename>, <filename class="directory">/boot</filename> and <filename class="directory">/home</filename> may be useful; for example, on a server running a <application>MySQL</application> database, having a separate mount point for <filename class="directory">/var/lib/mysql</filename> will allow you to preserve the database during a reinstallation without having to restore it from backup afterwards. However, having unnecessary separate mount points will make storage administration more difficult.
fr: Dans certains cas, créer des points de montage séparés pour des dossiers autres que <filename class="directory">/</filename>, <filename class="directory">/boot</filename> et <filename class="directory">/home</filename> peut s'avérer utile ; par exemple, sur un serveur de base de données <application>MySQL</application>, avoir un point de montage sur <filename class="directory">/var/lib/mysql</filename> permet de préserver la base de données lors d'une réinstallation sans avoir à la restaurer depuis une sauvegarde par la suite. Néanmoins, le fait d'avoir des points de montage séparés inutiles rend l'administration plus difficile.

source: Some special restrictions apply to certain directories with regards on which partitioning layouts can they be placed. Notably, the <filename class="directory">/boot</filename> directory must always be on a physical partition (not on an LVM volume or a Btrfs subvolume), and <filename class="directory">/usr</filename> can not be on a Btrfs subvolume.
fr: Des restrictions particulières s'appliquent à certains dossiers, eu égard au type de partitionnement sur lesquels ils sont placés. Notablement, le dossier <filename class="directory">/boot</filename> doit toujours se trouver sur une partition physique (pas sur un volume LVM ou un sous-volume Btrsf) et le dossier <filename class="directory">/usr</filename> ne peut pas se trouver sur un sous-volume Btrsf.

source: If you are new to Linux, consider reviewing the <citetitle>Linux Filesystem Hierarchy Standard</citetitle> at <ulink url="http://refspecs.linuxfoundation.org/FHS_2.3/fhs-2.3.html" /> for information about various system directories and their contents.
fr: Si vous découvrez Linux, consultez la norme <citetitle>Linux Filesystem Hierarchy Standard</citetitle> (Hiérarchie du système de fichiers Linux) à <ulink url="http://refspecs.linuxfoundation.org/FHS_2.3/fhs-2.3.html" /> pour des informations sur les différents dossiers système et leur usage.

source: Each kernel installed on your system requires approximately 20 MB on the <filename class="directory">/boot</filename> partition. The default partition size of 500 MB for <filename class="directory">/boot</filename> should suffice for most common uses; increase the size of this partition if you plan to keep many kernels installed at the same time.
fr: Chacun des noyaux installés sur votre système a besoin de 20 Mo dans le dossier <filename class="directory">/boot</filename>. La taille par défaut de 500 Mo pour la partition <filename class="directory">/boot</filename> devrait suffire dans la majorité des cas ordinaires ; augmentez la taille de cette partiton si vous envisagez d'avoir plusieurs noyaux installés simultanément.

source: The <filename class="directory">/var</filename> directory holds content for a number of applications, including the <application>Apache</application> web server, and is used by the <application>DNF</application> package manager to temporarily store downloaded package updates. Make sure that the partition or volume containing <filename class="directory">/var</filename> has at least 3 GB.
fr: Le dossier <filename class="directory">/var</filename> accueille des contenus pour un certain nombre d'applications, y compris le serveur Web <application>Apache</application>, et est utilisé par le gestionnaire de paquets <application>DNF</application> pour y stocker temporairement les mises à jour de paquets téléchargées. Assurez-vous que la partition ou le volume monté sur <filename class="directory">/var</filename> a une taille d'au moins 3 Go.

source: The contents of the <filename class="directory">/var</filename> directory usually change very often. This may cause problems with older solid state drives (SSDs), as they can handle a lower number of read/write cycles before becoming unusable. If your system root is on an SSD, consider creating a separate mount point for <filename class="directory">/var</filename> on a classic (platter) HDD.
fr: Le contenu du dossier <filename class="directory">/var</filename> change en général très souvent. Cela peut être un problème si la partition qui y est montée réside sur un ancien disque statique (SSD) qui ne supportent qu'un nombre limité de cycles de lecture/écriture. Si la racine de votre système est placée sur un SSD, envisagez sérieusement de créer un point de montage sur <filename class="directory">/var</filename> pour y monter un disque dur classique (HDD).

source: The <filename class="directory">/usr</filename> directory holds the majority of software on a typical &PRODUCT; installation. The partition or volume containing this directory should therefore be at least 5 GB for minimal installations, and at least 10 GB for installations with a graphical environment.
fr: Le dossier <filename class="directory">/usr</filename> accueille la majorité des programmes qui constituent une installation typique de &PRODUCT; . La partition ou le volume contenant ce dossier devrait être d'une taille d'au moins 5 Go pour une installation minimale, et d'au moins 10 Go pour une installation utilisant un environnement graphique.

source: If <filename>/usr</filename> or <filename>/var</filename> is partitioned separately from the rest of the root volume, the boot process becomes much more complex because these directories contain boot-critical components. In some situations, such as when these directories are placed on an iSCSI drive or an FCoE location, the system may either be unable to boot, or it may hang with a <computeroutput>Device is busy</computeroutput> error when powering off or rebooting.
fr: Si les dossiers <filename>/usr</filename> ou <filename>/var</filename> résident sur des partitions différentes de celle du reste du volume <filename>/</filename> (root), le processus de démarrage commence à devenir plus complexe parce que ces dossiers contiennent des composants critiques pour le démarrage. Dans certaines situations, comme par exemple celle où ces dossiers sont placés sur un disque iSCSI ou sur un emplacement FCoE, le système peut, soit être incapable de démarrer, soit rester planté en annonçant une erreur <computeroutput>Le périphérique est occupé</computeroutput> à la mise hors tension ou au redémarrage.

source: This limitation only applies to <filename>/usr</filename> or <filename>/var</filename>, not to directories below them. For example, a separate partition for <filename>/var/www</filename> will work without issues.
fr: Cette limitation concerne seulement les dossiers <filename>/usr</filename> ou <filename>/var</filename>, pas leurs sous-dossiers. Par exemple, une partition séparée pour <filename>/var/www</filename> ne crée pas de problème.

source: Consider leaving a portion of the space in an LVM volume group unallocated. This unallocated space gives you flexibility if your space requirements change but you do not wish to remove data from other volumes. You can also select the <guilabel>Thin provisioning</guilabel> device type for the partition to have the unused space handled automatically by the volume.
fr: Laissez une portion de l'espace dans un volume LVM non allouée. Cet espace non alloué vous donne de la flexibilité si vos exigences d'allocation d'espace viennent à changer et que vous ne voulez pas retirer des données sur les volumes en place. Vous pouvez sélectionner le type de périphérique <guilabel>Allocation fine LVM</guilabel> pour que l'espace non alloué soit automatiquement géré par le volume.

source: The size of an <systemitem>XFS</systemitem> file system can not be reduced - if you need to make a partition or volume with this file system smaller, you must back up your data, destroy the file system, and create a new, smaller one in its place. Therefore, if you expect needing to manipulate your partitioning layout later, you should use the <systemitem>ext4</systemitem> file system instead.
fr: La taille d'un système de fichiers <systemitem>XFS</systemitem> ne peut pas être réduite – si vous avez besoin de rétrécir une partition ou un volume avec ce système de fichiers, vous devez sauvegarder vos données, détruire le système de fichiers et en créer un plus petit à la place. En conséquence, si vous envisagez de modifier votre partitionnement ultérieurement, vous devriez utiliser le système de fichiers <systemitem>ext4</systemitem> à la place.

source: Use Logical Volume Management (LVM) if you anticipate expanding your storage by adding more hard drives after the installation. With LVM, you can create physical volumes on the new drives, and then assign them to any volume group and logical volume as you see fit - for example, you can easily expand your system's <filename class="directory">/home</filename> (or any other directory residing on a logical volume).
fr: Utilisez la gestion de volumes logiques (Logical Volume Management – LVM) si vous envisagez d'agrandir votre capacité de stockage en ajoutant des disques durs après l'installation. Avec LVM, vous pouvez créer des volumes physiques sur les nouveaux disques et les assigner ensuite à n'importe quel groupe de volumes et volume logique en fonction de votre besoin – par exemple, vous pouvez facilement étendre votre dossier <filename class="directory">/home</filename> (ou tout autre dossier résidant dans un volume logique).

source: Creating a BIOS Boot partition or an EFI System Partition may be necessary, depending on your system's firmware, boot drive size, and boot drive disk label. See <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> for information about these partitions. Note that the graphical installer will not let you create a BIOS Boot or EFI System Partition if your system does <emphasis>not</emphasis> require one - in that case, they will be hidden from the menu.
fr: Il peut être nécessaire de créer une partition BIOS Boot ou une partition EFI System selon le micrologiciel qui équipe votre machine, la taille du disque de démarrage et l'étiquette de votre disque. Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> pour des informations sur ces partitions. Notez que l'installateur graphique ne vous permet pas de créer une partition BIOS Boot ou EFI System si votre système n'en a <emphasis>pas</emphasis> besoin – dans ce cas, ce type de partition n'apparaît pas dans le menu.

source: If you need to make any changes to your storage configuration after the installation, &PRODUCT; repositories offer several different tools which can help you do this. If you prefer a command line tool, try <package>system-storage-manager</package>.
fr: Si vous avez besoin de modifier votre configuration de stockage après l'installation, les dépôts de &PRODUCT; mettent à votre disposition plusieurs outils pour vous y aider. Si vous préférez un outil en ligne de commande, essayez le paquet <package>system-storage-manager</package>.
