Repository: jaaf/po_purifier
Catalog: testing_data/CustomSpoke_AddBtrfs.po
Languages: fr

source: Creating a Btrfs Layout
fr: Création d'un partitionnement Btrfs

source: <firstterm>Btrfs</firstterm> is a type of file system, but it has several features characteristic of a storage device. It is designed to make the file system tolerant of errors, and to facilitate the detection and repair of errors when they occur. It uses checksums to ensure the validity of data and metadata, and maintains snapshots of the file system that can be used for backup or repair.
fr: <firstterm>Btrfs</firstterm> est un type de système de fichiers, mais il présente plusieurs des caractéristiques d'un périphérique de stockage. Il est conçu pour rendre le système de fichiers tolérant aux erreurs, et pour faciliter la détection et la réparation des erreurs quand elles surviennent. Il utilise les sommes de contrôle pour garantir la validité des données et des méta-données, et maintient des instantanés du système de fichiers utilisables pour sauvegarde et réparation.

source: Creating a Btrfs layout is somewhat similar to LVM (described in <xref linkend="sect-installation-gui-manual-partitioning-lvm" />) with slightly different terminology. A Btrfs <firstterm>volume</firstterm> is the equivalent of an LVM volume group, and a Btrfs <firstterm>subvolume</firstterm> is similar to a LVM logical volume. An important difference to note is how <application>Anaconda</application> reports sizes for separate mount points: For LVM, the exact size of each logical volume is shown next to each mount point in the left pane, while with Btrfs, the total size of the entire volume is shown next to each subvolume.
fr: La création d'un partitionnement Btrfs ressemble assez à la création d'un partitionnement LVM (décrit à la <xref linkend="sect-installation-gui-manual-partitioning-lvm" />) avec une terminologie légèrement différente. Un <firstterm>volume</firstterm> Btrfs est l'équivalent d'un groupe de volumes LVM, et un <firstterm>sous-volume</firstterm> est équivalent à un volume logique LVM. Une différence importante à noter est la manière dont <application>Anaconda</application> rapporte la taille de points de montage séparés : pour LVM, la taille exacte de chaque volume logique est montrée à coté de chacun des points de montage dans le panneau de gauche, tandis qu'avec Btrfs, la taille totale du volume tout entier est montrée à côté de chacun des sous-volumes.

source: Some partition types - notably the <filename class="directory">/boot</filename> and <filename class="directory">/usr</filename> directories and the BIOS Boot and EFI partitions - can not be placed on Btrfs subvolumes. Use standard physical volumes for them (or an LVM logical volume for <filename class="directory">/usr</filename>). See <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> for more information.
fr: Quelques types de partitions – notablement les partitions <filename class="directory">/boot</filename> et <filename class="directory">/usr</filename> ainsi que les partitions BIOS Boot and EFI – ne peuvent pas être placées sur des sous-volumes Btrfs. Utilisez des volumes physiques standard pour celles-ci (ou un volume logique LVM pour <filename class="directory">/usr</filename>). Voir la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> pour plus d'informations.

source: Create Btrfs Subvolume
fr: Création d'un sous-volume Btrfs

source: Follow the procedure below to create Btrfs volumes and subvolumes:
fr: Suivez la procédure ci-après pour créer des volumes et sous-volumes Btrfs :

source: Creating Btrfs Subvolumes and Volumes
fr: Création de volumes et sous-volumes Btrfs

source: Click the <guilabel>+</guilabel> button at the bottom of the list showing existing mount points. A new dialog window will open.
fr: Cliquez sur le bouton <guilabel>+</guilabel> en bas de la liste des points de montage. Une nouvelle fenêtre de dialogue s'ouvre.

source: In the new dialog window, specify a mount point for which you want to create a separate logical volume - for example, <filename class="directory">/</filename>. Optionally, specify a size for the volume using standard units such as MB or GB (for example, <literal>50GB</literal>). Then, click <guilabel>Add mount point</guilabel> to add the volume and return to the main partitioning screen.
fr: Dans la nouvelle fenêtre de dialogue, spécifiez un point de montage pour lequel vous voulez créer un volume logique séparé – par exemple, <filename class="directory">/</filename>. En option, spécifiez une taille pour le volume en utilisant les unités standard telles que Mo ou Go (par exemple, <literal>50 Go</literal>). Ensuite, cliquez sur le bouton <guilabel>Ajouter un point de montage</guilabel> pour ajouter le volume et retourner à l'écran de partitionnement principal.

source: When creating a mount point for swap on Btrfs, specify the mount point as <literal>swap</literal>.
fr: Lors de la création d'un point de montage pour swap sur Btrfs, spécifiez le point de montage comme <literal>swap</literal>.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a Btrfs subvolume by changing the <guilabel>Device Type</guilabel> option to <guilabel>Btrfs</guilabel>. Then, click <guilabel>Update Settings</guilabel> in the bottom right corner of the screen.
fr: Le point de montage a maintenant été créé en utilisant les réglages par défaut, ce qui signifie qu'il a été créé comme un volume logique LVM. Sélectionnez-le dans le panneau de gauche pour le configurer plus en détail et convertissez-le en sous-volume Btrfs en changeant l'option <guilabel>Type de périphérique</guilabel> en <guilabel>Btrfs</guilabel>. Ensuite, cliquez sur le bouton <guilabel>Mise à jour des paramètres</guilabel> dans l'angle inférieur droit de l'écran.

source: In the <guilabel>Volume</guilabel> menu, you can see that the subvolume has been assigned to an automatically created volume, which is named after the &PRODUCT; variant you are installing (for example, <literal>fedora-server00</literal>. Click the <guilabel>Modify</guilabel> button under the drop-down menu to access the volume settings.
fr: Dans le menu <guilabel>Volume</guilabel>, vous pouvez voir que le sous-volume a été assigné à un volume créé automatiquement et nommé en prenant en compte la variante de &PRODUCT; que vous êtes en train d'installer (par exemple, <literal>fedora-server00</literal>). Cliquez sur le bouton <guilabel>Modifier</guilabel> sous le menu déroulant pour accéder aux réglage du volume.

source: In the <guilabel>Configure Volume</guilabel> dialog, you can change the volume's name, its <guilabel>RAID level</guilabel> (see <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> for information about available RAID types), and you can also specify which physical devices (disks) this volume should reside on. You can select one or more disks which will be used to hold this volume by holding down <keycap>Ctrl</keycap> and clicking each disk in the list.
fr: Dans la fenêtre de dialogue <guilabel>Configurer volume</guilabel>, vous pouvez changer le nom du volume, son <guilabel>niveau RAID</guilabel> (voir la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> pour des informations sur les types de RAID disponibles), et vous pouvez aussi spécifier sur quel périphérique physique (disque) ce volume va résider. Vous pouvez sélectionner un ou plusieurs disques qui seront utilisés pour contenir ce volume en maintenant la touche <keycap>Ctrl</keycap> enfoncée et en cliquant sur chacun des disques dans la liste.

source: If you select a redundant RAID type (such as <guilabel>RAID1 (Redundancy)</guilabel>), the volume will take up twice its actual size on your disks. A 5 GB volume with RAID1 will take up 10 GB of space.
fr: Si vous sélectionnez un type de RAID redondant tel que <guilabel>RAID1 (Redundancy)</guilabel>, le volume prendra deux fois sa taille nominale sur les disques. Un volume de type RAID1 de 5 Go occupera 10 Go d'espace.

source: You can also make sure that the volume is encrypted by selecting the <guilabel>Encrypt</guilabel> option; this will enable LUKS encryption for the entire volume. See the <citetitle>&PRODUCT; Security Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />, for information about LUKS disk encryption.
fr: Vous pouvez également faire en sorte que le volume soit chiffré en sélectionnant l'option <guilabel>Chiffrer</guilabel>. Cela active le chiffrement LUKS pour le volume tout entier. Reportez-vous au <citetitle>Guide de la sécurité de &PRODUCT;</citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />, pour des informations sur le chiffrement des disques avec LUKS.

source: Additionally, you can set a fixed size for the volume by selecting the <guilabel>Fixed</guilabel> option from the <guilabel>Size policy</guilabel> menu and entering a size for the volume group.
fr: De plus, vous pouvez déclarer une taille fixe pour le volume en sélectionnant l'option <guilabel>Défini</guilabel> dans le menu déroulant <guilabel>Stratégie sur la taille</guilabel>, et en entrant une taille pour le groupe de volume.

source: After you finish configuring the Btrfs volume settings, click <guilabel>Save</guilabel> to return to the main <guilabel>Manual Partitioning</guilabel> screen.
fr: Après avoir terminé la configuration du volume Btrfs, cliquez sur le bouton <guilabel>Enregistrer</guilabel> pour retourner à l'écran <guilabel>Partitionnement manuel</guilabel>.

source: If you need to create more than one Btrfs volume, open the <guilabel>Volume</guilabel> drop-down menu and select the <guilabel>Create a new volume group</guilabel> option. A new dialog window will open, identical to the one described in the previous step. Again, select a name, storage devices, encryption settings, RAID level and size policy for the new volume, and click <guilabel>Save</guilabel>. The new volume will then become available in the <guilabel>Volume Group</guilabel> drop-down menu; you can then go through your existing mount points and change this setting to assign them to a different volume.
fr: Si vous avez besoin de créer plus d'un volume Btrfs, ouvrez le menu déroulant <guilabel>Volume</guilabel> et choisissez l'option <guilabel>Créer un nouveau volume</guilabel>. Une nouvelle fenêtre de dialogue s'ouvre, identique à celle décrite à l'étape précédente. À nouveau, sélectionnez un nom, des périphériques de stockage, des réglages de chiffrement, un niveau de RAID et une politique de taille pour le nouveau volume et cliquez sur <guilabel>Enregistrer</guilabel>. Le nouveau volume devient alors visible dans le menu déroulant <guilabel>Volume</guilabel>. Vous pouvez ensuite parcourir vos points de montage existants et changer leurs réglages pour les assigner à un volume différent.

source: Configure other settings specific to the subvolume - its <guilabel>Mount Point</guilabel>, <guilabel>Desired Capacity</guilabel>, <guilabel>File System</guilabel>, and <guilabel>Name</guilabel>. Press <guilabel>Update Settings</guilabel> to apply any changes to the configuration.
fr: Configurez d'autres réglages spécifiques au sous-volume – son <guilabel>Point de montage</guilabel>, sa <guilabel>Capacité souhaitée</guilabel>, son <guilabel>système de fichiers</guilabel> et son <guilabel>Étiquette</guilabel>. Cliquez sur le bouton <guilabel>Mise à jour des paramètres</guilabel> pour appliquer les changements à la configuration.

source: Repeat this procedure for any additional Btrfs subvolumes you want to create. Note that when creating additional subvolumes, a new volume is not automatically created each time; instead, any additional subvolumes are assigned to an existing volume.
fr: Répétez cette procédure pour tous les sous-volumes Btrfs additionnels que vous voulez créer. Notez que lors de la création d'un sous-volume additionnel, un nouveau volume n'est pas automatiquement créé à chaque fois ; au lieu de cela, tout sous-volume additionnel est assigné à un volume existant.

source: For each mount point you create, review its settings and make sure that it is assigned to the correct volume, that it has sufficient capacity, and that it has a descriptive name so you can identify the subvolume later if you need to.
fr: Pour chaque point de montage que vous créez, passez ces réglages en revue et assurez-vous que le volume correct y est monté, qu'il a une capacité suffisante et qu'il a un nom évocateur de façon à ce que vous puissiez l'identifier facilement par la suite si vous en avez besoin.
