Repository: jaaf/po_purifier
Catalog: testing_data/CustomSpoke_RecommendedScheme.po
Languages: fr

source: Recommended Partitioning Scheme
fr: Schéma de partitionnement recommandé

source: In most cases, at least the following mount points should always be created:
fr: Dans la plupart des cas, des partitions séparées doivent être montées sur au moins les points de montage suivants :

source: <filename class="directory">/boot</filename> - 500 MB
fr: <filename class="directory">/boot</filename> - 500 Mo

source: This partition contains the operating system kernel, which allows &PRODUCT; to boot. It also contains other files used during the bootstrap process. Due to the limitations of most firmware, creating a separate, small standard partition for this directory is recommended. In most scenarios, a 500 MB <filename class="directory">/boot</filename> partition is adequate.
fr: Cette partition contient le noyau du système d'exploitation qui permet à &PRODUCT; de démarrer. Elle contient également d'autres fichiers utilisés durant le processus de démarrage. À cause des limitations de la plupart des micrologiciels, la création de cette petite partition standard est recommandée. Dans la plupart des scénarios, une partition de 500 Mo pour <filename class="directory">/boot</filename> convient.

source: If your system has a hardware RAID controller, be aware that some BIOS types do not support booting from it. In that case, the <filename class="directory">/boot</filename> partition must be created on a partition outside of the RAID array, such as on a separate hard drive.
fr: Si votre système dispose d'un contrôleur RAID matériel, soyez conscient que quelques micrologiciels BIOS ne prennent pas en charge le démarrage à partir de tels RAIDs. Dans ce cas, la partition <filename class="directory">/boot</filename> doit être créée en dehors de ce regroupement RAID comme par exemple sur un disque séparé.

source: Also note that the <filename class="directory">/boot</filename> directory can not be placed on a LVM logical volume or a Btrfs subvolume. Use a standard partition.
fr: Notez aussi que le dossier <filename class="directory">/boot</filename> ne peut être placé sur un volume logique LVM ou sur un sous-volume Btrfs ; utilisez une partition standard.

source: <filename class="directory">/</filename> (root) - 10 GB
fr: <filename class="directory">/</filename> (root) - 10 Go

source: This is where the root directory is located. The root directory is the top level of the directory structure. By default, all files are written to this partition unless a different partition is mounted in the path being written to (for example, <filename class="directory">/boot</filename> or <filename class="directory">/home</filename>). If you follow the recommended scheme described in this section, this will be the partition where most software packages will be installed.
fr: C'est là que se trouve le dossier racine (/). Le dossier racine est le niveau le plus haut dans la structure des dossiers. Par défaut, tout fichier est écrit dans cette partition sauf si une partition différente est montée sur le chemin qui mène à ce fichier (par exemle, <filename class="directory">/boot</filename> ou <filename class="directory">/home</filename>). Si vous suivez le schéma recommandé décrit dans cette section, c'est la partition dans laquelle la plupart des paquets logiciels sont installés.

source: For a minimal installation, a 5 GB root partition will be sufficient. However, for most common installations which include extra packages and a graphical user interface, the root partition should be at least 10 GB; with 20 GB being sufficient for most common use cases.
fr: Pour une installation minimale, une partition racine de 5 Go est suffisante. Cependant, pour la plupart des installations qui incluent des paquets supplémentaires et une interface graphique, la partition racine doit être d'au moins 10 Go ; 20 Go étant suffisant pour la plupart des cas d'usage courants.

source: The <filename class="directory">/</filename> mount point is the top of the Linux Filesystem Hierarchy, and is referred to as the <firstterm>root file system</firstterm>, or root. The <filename class="directory">/root</filename> directory, sometimes pronounced "<firstterm>slash-root</firstterm>", is the home directory for the <systemitem class="username">root</systemitem> user.
fr: Le point de montage <filename class="directory">/</filename> est le sommet de la hiérarchie du Système de fichiers Linux et on y fait référence sous l'appellation <firstterm>système de fichiers racine</firstterm> ou root. Le dossier <filename class="directory">/root</filename>, parfois prononcé "<firstterm>slash-root</firstterm>", est le dossier racine des dossiers de l'utilisateur <systemitem class="username">root</systemitem>.

source: <filename class="directory">/home</filename> - at least 10 GB
fr: <filename class="directory">/home</filename> - au moins 10 Go

source: To store user data separately from system data, create a dedicated mount point for the <filename>/home</filename> directory. This partition should be sized based on the amount of data that will be stored locally, number of users, and so on. This will allow you to upgrade or reinstall &PRODUCT; without erasing user data files. During the installation, a separate <filename class="directory">/home</filename> partition will be created if there are 50 GB or more free space for your &PRODUCT; installation.
fr: Afin de stocker les données de l'utilisateur séparément de celles du système, créez une partition et montez-la sur <filename>/home</filename>. Cette partition doit être dimensionnée d'après la quantité de données à stocker localement, le nombre d'utilisateurs, etc. Elle vous permet de monter &PRODUCT; en version ou de le réinstaller sans effacer les fichiers de l'utilisateur. Lors de l'installation, une partition <filename class="directory">/home</filename> est créée s'il reste 50 Go ou plus d'espace pour installer &PRODUCT;.

source: When using &PRODUCT; as a workstation for normal use with a graphical environment, this mount point should have the most disk space assigned to it, as it will likely hold the most data (user settings, images, videos, etc).
fr: Si vous utilisez la station de travail &PRODUCT; en usage normal avec un environnement graphique, cette partition doit avoir le plus d'espace possible qui lui est assigné car elle contiendra probablement la plupart des données (réglages utilisateurs, images, vidéos, etc.).

source: swap - based on your system parameters
fr: swap -taille basée sur les paramètres de votre système

source: Swap partitions support virtual memory; data is written to them when there is not enough RAM to store the data your system is processing. This partition's size is a function of system memory workload, not total system memory, and therefore is not equal to the total system memory size. Therefore, it is important to analyze what applications a system will be running and the load those applications will serve in order to determine the system memory workload. Application providers and developers should be able to provide some guidance.
fr: Les partitions d'échange (swap) prennent en charge la mémoire virtuelle ; les données y sont écrites lorsqu'il n'y a plus assez de mémoire RAM pour stocker les données que votre système est en train de traiter. La taille de cette partition est fonction de la charge mémorielle de votre système, pas de la taille de sa mémoire RAM et n'y est donc pas égale. Il est donc important d'analyser quelles applications le système va exécuter et la charge mémorielles que ces applications impliquent pour déterminer la charge mémorielle totale. Les fournisseurs d'application et les développeurs sont à même de vous renseigner.

source: When the system runs out of swap space, the kernel terminates processes as the system RAM memory is exhausted. Configuring too much swap space results in storage devices being allocated but idle and is a poor use of resources. Too much swap space can also hide memory leaks. The maximum size for a swap partition and other additional information can be found in the <systemitem>mkswap(8)</systemitem> man page.
fr: Lorsque le système est à cours d'espace d'échange, le noyau arrête de fonctionner. Par contre, configurer un espace d'échange trop important aboutit à une allocation fréquente de cet espace, ce qui se traduit par une perte de vitesse et un mauvais usage des ressources. Trop d'espace d'échange peut aussi masquer des fuites de mémoire. Des informations sur la taille maximum d'une partition d'échange et d'autres informations complémentaires sont disponibles dans la page de manuel <systemitem>mkswap(8)</systemitem>.

source: The table below provides the recommended size of a swap partition depending on the amount of RAM in your system and whether you want sufficient memory for your system to hibernate. If you let the installation program partition your system automatically, the swap partition size will be established using these guidelines. Automatic partitioning setup assumes hibernation is not in use, and the maximum size of the swap partition is limited to 10% of the total size of the hard drive. If you want to set up enough swap space to allow for hibernation, or if you want to set the swap partition size to more than 10% of the system's storage space, you must edit the partitioning layout manually.
fr: Le tableau qui suit fournit des recommandations sur la taille de la partition d'échange selon la quantité de RAM dans votre système et vos besoins d'hibernation. Si vous laissez l'installateur partitionner votre système, la taille de la partition d'échange est fixée d'après ces recommandations. Le partitionnement automatique présuppose que l'hibernation n'est pas activée, et la taille maximum de la partition d'échange est limitée à 10% de la taille du disque dur. Si vous désirez définir une taille d'espace d'échange compatible avec l'hibernation, ou si vous désirez aller au-delà de 10% de la taille du disque, vous devez partitionner à la main.

source: Recommended System Swap Space
fr: Espace d'échange (swap) recommandé

source: Amount of RAM in the system
fr: Quantité de RAM du système

source: Recommended swap space
fr: Espace d'échange (swap) recommandé

source: Recommended swap space if allowing for hibernation
fr: Espace d'échange recommandé pour permettre l'hibernation

source: less than 2 GB
fr: moins de 2 Go

source: 2 times the amount of RAM
fr: 2 fois la quantité de RAM

source: 3 times the amount of RAM
fr: 3 fois la quantité de RAM

source: 2 GB - 8 GB
fr: 2 Go - 8 Go

source: Equal to the amount of RAM
fr: Égale à la quantité de RAM

source: 8 GB - 64 GB
fr: 8 Go - 64 Go

source: 0.5 times the amount of RAM
fr: 0,5 fois la quantité de RAM

source: 1.5 times the amount of RAM
fr: 1,5 fois la quantité de RAM

source: more than 64 GB
fr: plus de 64 Go

source: workload dependent
fr: dépend de la charge mémorielle

source: hibernation not recommended
fr: hibernation non recommandée

source: At the border between each range listed above (for example, a system with 2 GB, 8 GB, or 64 GB of system RAM), discretion can be exercised with regard to chosen swap space and hibernation support. If your system resources allow for it, increasing the swap space may lead to better performance.
fr: À la limite des plages listées ci-dessus (par exemple, un système doté de 2 Go, 8 Go ou 64 Go de RAM), le choix est à votre discrétion en considérant l'espace d'échange choisi et la prise en charge ou pas de l'hibernation. Si les ressources de votre système le permettent, augmenter la taille de l'espace d'échange peut améliorer la performance.

source: Distributing swap space over multiple storage devices - particularly on systems with fast drives, controllers and interfaces - also improves swap space performance.
fr: Distribuer l'espace d'échange sur plusieurs périphériques – en particulier sur les systèmes dotés de disques, contrôleurs et interfaces rapides – améliore également la performance de l'espace d'échange.

source: BIOS Boot (1 MB) or EFI System Partition (200 MB)
fr: BIOS Boot (1 Mo) ou EFI System (200 Mo)

source: The <application>GRUB2</application> boot loader can be installed either in the <firstterm>Master Boot Record</firstterm> (MBR) or the <firstterm>GUID Partition Table</firstterm> (GPT) of the boot device. In order to determine which of these methods to use, the installation program considers the following variations:
fr: Le chargeur de démarrage <application>GRUB2</application> peut être installé, soit dans le <firstterm>Master Boot Record</firstterm> (MBR), soit dans la <firstterm>table des partitions GUID</firstterm> (GPT) du disque de démarrage. Afin de déterminer lequel des deux utiliser, l'installateur prend en considération les éléments suivants :

source: Systems with BIOS firmware and UEFI systems in BIOS compatibility mode
fr: Systèmes avec un micrologiciel BIOS et systèmes avec un micrologiciel UEFI en mode compatible BIOS

source: If the disk is already formatted, the partitioning scheme is retained. If the disk is not formatted, or you have erased all existing partitions from the disk, the installer will choose the following:
fr: Si le disque est déjà formaté, le schéma de partitionnement est retenu. Si le disque n'est pas formaté, ou si vous avez supprimé toutes les partitions du disque, l'installateur choisit ce qui suit :

source: MBR if the size of the disk is less than 2 TB (terabytes)
fr: MBR si la taille du disque est inférieure à 2 To (téraoctets)

source: GPT if the size of the disk is more than 2 TB
fr: GPT si la taille du disque dépasse 2 To

source: You can force the installer to use GPT on disks smaller than 2 TB by using the <option>inst.gpt</option> boot option as described in <xref linkend="chap-anaconda-boot-options" />. However, the opposite is not possible - you can not use MBR on disks larger than 2 TB.
fr: Vous pouvez forcer l'installateur à utiliser GPT sur des disques de moins de 2 To en utilisant l'option de démarrage <option>inst.gpt</option> comme expliqué au <xref linkend="chap-anaconda-boot-options" />. Néanmoins, l'inverse n'est pas possible - vous ne pouvez pas utiliser MBR sur des disques de taille supérieure à 2 To.

source: You need to create a <firstterm>BIOS Boot</firstterm> partition with a size of 1 MB to install on a system with BIOS firmware if the disk containing the boot loader uses GPT. If the disk uses a MBR, no special partition is necessary on a BIOS system.
fr: Vous devez créer une partition <firstterm>BIOS Boot</firstterm> d'une taille de 1 Mo pour installer &PRODUCT; sur un système doté d'un micrologiciel BIOS si le disque qui contient le chargeur de démarrage utilise la GPT. Si le disque utilise un MBR, aucune partition n'est requise sur un système doté d'un micrologiciel BIOS.

source: Systems with UEFI firmware
fr: Systèmes dotés d'un micrologiciel UEFI

source: Only GPT is allowed on UEFI systems. In order to install on a formatted disk with a MBR, it must be reformated and relabeled. All data currently on the disk will be lost.
fr: Seul la GPT est autorisée sur les systèmes dotés d'un micrologiciel UEFI. Pour installer sur un disque formaté MBR, celui-ci doit être reformaté et étiqueté GPT. Toutes les données existant sur le disque et non sauvegardées sont perdues.

source: UEFI-based systems require an <firstterm>EFI System Partition</firstterm> at least 50 MB in size (recommended size is 200 MB), regardless of the partitioning scheme.
fr: Les systèmes dotés d'un micrologiciel UEFI ont besoin d'une partition <firstterm>EFI System</firstterm> (ESP) d'au moins 50 Mo (la taille recommandée est de 200 Mo) quel que soit le schéma de partitionnement.

source: If your system requires either a BIOS Boot partition or an EFI System Partition based on the requirements detailed above, this partition must be created as a standard physical partition. It can not reside on an LVM volume or a Btrfs subvolume.
fr: Si, en vous basant sur les recommandations ou exigences ci-dessus, votre système a besoin d'une partition BIOS Boot ou d'une partition EFI System, cette partition doit être créée en tant que partition physique standard. Elle ne peut résider sur un volume LVM ou un sous-volume Btrfs.

source: Also note that if your system does not require any of these partitions, they will not be shown in the <guilabel>File System</guilabel> menu in mount point options.
fr: Notez aussi que si votre système n'a pas besoin d'une telle partition, elle n'apparaît pas dans le menu déroulant <guilabel>Systèmes de fichiers</guilabel> dans les options du point de montage.

source: Many systems have more partitions than the minimum listed above. Choose partitions based on your particular needs. See <xref linkend="sect-installation-gui-manual-partitioning-advice" /> for additional information and advice.
fr: Beaucoup de systèmes ont plus de partitions que le minimum listé ci-dessus. Choisissez les partitions en considérant vos besoins spécifiques. Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-advice" /> pour de l'information complémentaire et des conseils.

source: Only assign storage capacity to those partitions you require immediately. You may allocate free space at any time, to meet needs as they occur.
fr: N'assignez une capacité de stockage qu'aux partitions dont vous avez besoin dans l'immédiat. Vous pouvez allouer de l'espace libre à tout moment pour suivre l'évolution de vos besoins.

source: If you are not sure how best to configure the partitions for your computer, accept the automatic default partition layout provided by the installation program as described in <xref linkend="sect-installation-gui-storage-partitioning" />.
fr: Si vous avez un doute sur la meilleure manière de configurer vos partitions, acceptez le schéma de partitionnement automatique par défaut de l'installateur tel que décrit à la <xref linkend="sect-installation-gui-storage-partitioning" />.
