Repository: jaaf/po_purifier
Catalog: testing_data/Disk_Partitions.po
Languages: fr

source: At this point in the process of preparing to install &PRODUCT;, you should give some consideration to the number and size of the partitions to be used by your new operating system. However, there is no one right answer to this question. It depends on your needs and requirements.
fr: À ce stade de la préparation à l'installation de &PRODUCT;, vous devez vous poser la question du nombre et de la taille des partitions pour votre nouveau système d'exploitation. Il n'existe cependant pas de réponse unique à cette question. Cela dépend de vos besoins et exigences.

source: Unless you have a reason for doing otherwise, you should <emphasis>at least</emphasis> create a <filename>/boot</filename> partition and a <filename>/</filename> (root) partition. Depending on your system's hardware specifications, additional partitions may be necessary, such as <filename>/boot/efi</filename> for 64-bit AMD and Intel systems with UEFI firmware, a <systemitem>biosboot</systemitem> partition for AMD and Intel systems with a GUID Partition Table (GPT) label on the system disk, or a <systemitem>PReP Boot</systemitem> partition on IBM Power Systems servers.
fr: Sauf si vous avez une raison de faire autrement, vous devez <emphasis>au minimum</emphasis> créer une partition <filename>/boot</filename> et une partition <filename>/</filename> (root). Selon les caractéristiques de votre matériel, des partitions additionnelles peuvent être nécessaires, comme une partition <filename>/boot/efi</filename> pour les systèmes AMD 64 bits et les systèmes Intel dotés d'un micrologiciel UEFI , une partition <systemitem>biosboot</systemitem> pour les systèmes AMD et Intel avec une table des partitions GUID (GPT), ou encore une partition <systemitem>PReP Boot</systemitem> sur les serveurs IBM Power.

source: See <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> for more information about the recommended partitioning scheme.
fr: Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> pour plus d'information sur le schéma de partitionnement recommandé.
