Repository: jaaf/po_purifier
Catalog: testing_data/Disk_Partitions.po
Languages: fr

source: The <firstterm>secondary <acronym>GPT</acronym> header</firstterm> is located on the last logical sector of the disk and it can be used to recover <acronym>GPT</acronym> information in case the primary header is corrupted. It contains the disk GUID, the location of the secondary partition table and the primary <acronym>GPT</acronym> header, CRC32 checksums of itself and the secondary partition table, and the number of possible partition entries.
fr: L'<firstterm>en-tête <acronym>GPT</acronym> secondaire </firstterm> est situé sur le dernier secteur logique du disque et peut être utilisé pour récupérer les informations <acronym>GPT</acronym> en cas de corruption de l'en-tête primaire. Il contient le GUID du disque, l'emplacement de la table secondaire des partitions, l'emplacement de l'en-tête <acronym>GPT</acronym> primaie, les sommes de contrôle CRC32 de lui-même et de la table secondaire des partition ainsi que le nombre d'entrées de partition de la table.

source: There must be a BIOS boot partition for the boot loader to be installed successfully onto a disk that contains a GPT (GUID Partition Table). This includes disks initialized by <application>Anaconda</application>. If the disk already contains a BIOS boot partition, it can be reused.
fr: Une partition de démarrage BIOS (BIOS boot partition) doit exister sur un disque GPT pour que le chargeur de démarrage puisse y être installé avec succès. Cela inclut les disques initialisés par <application>Anaconda</application>. Si le disque contient déjà une telle partition, elle peut être réutilisée.

source: Strategies for Disk Repartitioning
fr: Stratégies de re-partitionnement des disques

source: There are several different ways that a disk can be repartitioned. This section discusses the following possible approaches:
fr: Le re-partitionnement des disques peut se faire de différentes manières. Cette section aborde les approches possibles suivantes :

source: Unpartitioned free space is available
fr: de l'espace libre non partitionné est disponible ;

source: An unused partition is available
fr: une partition inutilisée est disponible ;

source: Free space in an actively used partition is available
fr: de l'espace libre dans une partition active est disponible.

source: Note that this section discusses the aforementioned concepts only theoretically and it does not include any procedures showing how to perform disk repartitioning step-by-step. Such detailed information are beyond the scope of this document.
fr: Notez bien que cette section n'aborde les cas envisagés ci-dessus que d'une manière théorique. En aucun cas elle ne présente dans le détail les étapes des procédures de re-partitionnement. Une information aussi détaillée est au-delà du champ de ce document.

source: Keep in mind that the following illustrations are simplified in the interest of clarity and do not reflect the exact partition layout that you encounter when actually installing &PRODUCT;.
fr: Gardez à l'esprit que les illustrations suivantes sont simplifiées et ne reflètent pas l'arrangement exact des partitions que vous rencontrerez en installant &PRODUCT;.

source: Using Unpartitioned Free Space
fr: Utilisation de l'espace libre non partitionné

source: In this situation, the partitions already defined do not span the entire hard disk, leaving unallocated space that is not part of any defined partition. <xref linkend="figu-partitions-unused-space" />, shows what this might look like.
fr: Dans une telle situation, les partitions existantes n'utilisent pas l'intégralité du disque et laissent un espace libre qu'aucune partition n'utilise. La <xref linkend="figu-partitions-unused-space" /> présente ce à quoi cela ressemble.

source: Disk Drive with Unpartitioned Free Space
fr: Disque dur avec un espace libre non partitionné

source: In the above example, <wordasword>1</wordasword> represents an undefined partition with unallocated space and <wordasword>2</wordasword> represents a defined partition with allocated space.
fr: Dans l'exemple ci-dessus, <wordasword>1</wordasword> représente une partition non définie avec un espace non alloué et <wordasword>2</wordasword> représente une partition définie avec de l'espace alloué.

source: An unused hard disk also falls into this category. The only difference is that <emphasis>all</emphasis> the space is not part of any defined partition.
fr: Un disque vierge tombe également dans cette catégorie. La seule différence est que <emphasis>tout</emphasis> l'espace est libre et n'appartient à aucune partition.

source: In any case, you can create the necessary partitions from the unused space. Unfortunately, this scenario, although very simple, is not very likely (unless you have just purchased a new disk just for &PRODUCT;). Most pre-installed operating systems are configured to take up all available space on a disk drive (see <xref linkend="sect-disk-partitions-active-partition" />).
fr: Dans tous les cas, vous pouvez créer les partitions nécessaires dans l'espace libre. Malheureusement, ce scénario, bien que très simple, n'est pas très probable (sauf si vous venez tout juste d'acheter un disque neuf réservé à &PRODUCT;). Tous les systèmes pré-installés sont configurés pour utiliser tout l'espace disponible sur le disque (voir la <xref linkend="sect-disk-partitions-active-partition" />).

source: Using Space from an Unused Partition
fr: Utilisation de l'espace d'une partition inutilisée

source: In this case, maybe you have one or more partitions that you do not use any longer. <xref linkend="figu-partitions-unused-partition" />, illustrates such a situation.
fr: Dans ce cas vous disposez d'une ou plusieurs partitions qui ne sont plus utilisées. La <xref linkend="figu-partitions-unused-partition" /> illustre cette situation.

source: Disk Drive with an Unused Partition
fr: Disque avec un partition non utilisée

source: In the above example, <wordasword>1</wordasword> represents an unused partition and <wordasword>2</wordasword> represents reallocating an unused partition for Linux.
fr: Das l'exemple ci-dessus, <wordasword>1</wordasword> représente une partition inutilisée et <wordasword>2</wordasword> représente la ré-allocation d'une partition inutilisée pour Linux.

source: In this situation, you can use the space allocated to the unused partition. You first must delete the partition and then create the appropriate Linux partition(s) in its place. You can delete the unused partition and manually create new partitions during the installation process.
fr: Dans cette situation, vous pouvez utiliser l'espace alloué à la partition inutilisée. Vous devez d'abord la supprimer et créer les partitions Linux appropriées à sa place. Vous pouvez la supprimer à la main et créer les nouvelles partitions pendant le processus d'installation.

source: Using Free Space from an Active Partition
fr: Utilisation de l'espace disponible d'une partition active

source: This is the most common situation. It is also, unfortunately, the hardest to handle. The main problem is that, even if you have enough free space, it is presently allocated to a partition that is already in use. If you purchased a computer with pre-installed software, the hard disk most likely has one massive partition holding the operating system and data.
fr: C'est la situation la plus courante. Elle est aussi, malheureusement, la plus difficile à gérer. Le principal problème est que, même si vous avez suffisamment d'espace libre, ce dernier est actuellement alloué à une partition déjà en cours d'utilisation. Si vous avez acheté un ordinateur avec des logiciels pré-installés, le disque dur a probablement une grande partition contenant le système d'exploitation et les données.

source: Aside from adding a new hard drive to your system, you have two choices:
fr: À part d'ajouter un nouveau disque dur sur le système, vous avez deux possibilités :

source: <emphasis>Destructive Repartitioning</emphasis>
fr: <emphasis>Re-partitionnement destructif</emphasis>

source: In this case, the single large partition is deleted and several smaller ones are created instead. Any data held in the original partition is destroyed. This means that making a complete backup is necessary. It is highly recommended to make two backups, use verification (if available in your backup software), and try to read data from the backup <emphasis>before</emphasis> deleting the partition.
fr: Dans ce cas, la grande partition unique est supprimée et plusieurs partitions plus petites sont créées à sa place. Toutes les données contenues dans la partition d'origine sont perdues. Ceci signifie qu'une copie de sauvegarde s'impose. Il est très recommandé d'effectuer cette copie de sauvegarde en double. Servez-vous des fonctionnalités de vérification (si elles existent dans votre logiciel de sauvegarde) et essayez de relire les données de la copie de sauvegarde <emphasis>avant</emphasis> d'effacer la partition.

source: If an operating system was installed on that partition, it must be reinstalled if you want to use that system as well. Be aware that some computers sold with pre-installed operating systems may not include the installation media to reinstall the original operating system. You should check whether this applies to your system is <emphasis>before</emphasis> you destroy your original partition and its operating system installation.
fr: Si un système d'exploitation occupait cette partition, il doit être réinstallé si vous désirez continuer à utiliser ce système. Soyez conscient que quelques ordinateurs vendus avec un système d'exploitation pré-installé ne sont pas fournis avec le média de réinstallation. Vous devez vous assurez que ce n'est pas le cas de votre système <emphasis>avant</emphasis> de détruire votre partition d'origine et son système d'exploitation.

source: After creating a smaller partition for your existing operating system, you can reinstall software, restore your data, and start the installation. <xref linkend="figu-partitions-destructive-repartitioning" /> shows this being done.
fr: Après avoir créé une partition plus petite pour votre système d'exploitation existant, vous pouvez le ré-installer, restaurer vos données et débuter l'installation de &PRODUCT;. La <xref linkend="figu-partitions-destructive-repartitioning" /> montre le déroulement de ce processus.

source: Disk Drive Being Destructively Repartitioned
fr: Disque dur en cours de partitionnement destructif

source: In the above example, <wordasword>1</wordasword> represents before and <wordasword>2</wordasword> represents after.
fr: Dans l'exemple précédent, <wordasword>1</wordasword> représente l'état du disque avant l'opération et <wordasword>2</wordasword> représente l'état du disque après l'opération.

source: Any data previously present in the original partition is lost.
fr: Sans leur copie de sauvegarde et leur restauration, toutes les données de la partition d'origine aurait été perdues.

source: <emphasis>Non-Destructive Repartitioning</emphasis>
fr: <emphasis>Re-partitionnement non destructif</emphasis>

source: With non-destructive repartitioning you execute a program that makes a big partition smaller without losing any of the files stored in that partition. This method is usually reliable, but can be very time-consuming on large drives.
fr: Dans ce cas, vous utilisez un programme capable de réduire la taille d'une grande partition sans perte de données. Cette méthode est généralement fiable mais peut prendre beaucoup de temps sur les grands disques.

source: While the process of non-destructive repartitioning is rather straightforward, there are three steps involved:
fr: Bien que le processus de re-partitionnement non destructif soit plutôt simple, il se déroule en trois étapes :

source: Compress and backup existing data
fr: Réfragmentation et sauvegarde des données existantes

source: Resize the existing partition
fr: Redimensionnement de la partition existante

source: Create new partition(s)
fr: Création de nouvelles partitions

source: Each step is described further in more detail.
fr: Chacune des étapes est décrite en détail plus bas.

source: Compress Existing Data
fr: Défragmentation des données

source: As the following figure shows, the first step is to compress the data in your existing partition. The reason for doing this is to rearrange the data such that it maximizes the available free space at the "end" of the partition.
fr: Comme le montre la figure suivante, la première étape est de compresser les données dans votre partition existante. Le but recherché est de réarranger les données pour libérer le maximum d'espace libre en fin de partition.

source: Disk Drive Being Compressed
fr: Disque dur en cours de défragmentation

source: This step is crucial. Without it, the location of the data could prevent the partition from being resized to the extent desired. Note also that, for one reason or another, some data cannot be moved. If this is the case (and it severely restricts the size of your new partition(s)), you may be forced to destructively repartition your disk.
fr: Cette étape est cruciale. Sans elle, l'emplacement des données peut empêcher le redimensionnement de la partition à la taille souhaitée. Notez également que, pour une raison ou pour une autre, certaines données ne peuvent être déplacées. Dans ce cas (et cela engendre une sérieuse contrainte sur la taille de votre(vos) nouvelle(s) partition(s), vous pouvez être amené(e) à envisager le re-partitionnement déstructif).

source: Resize the Existing Partition
fr: Redimensionnement de la partition existante

source: <xref linkend="figu-partitions-resize-existing" /> shows the actual resizing process. While the actual result of the resizing operation varies depending on the software used, in most cases the newly freed space is used to create an unformatted partition of the same type as the original partition.
fr: La <xref linkend="figu-partitions-resize-existing" /> présente le déroulement du processus de redimensionnement. Bien que le résultat réel de l'opération de redimensionnement varie selon le logiciel utilisé, dans la plupart des cas, l'espace libéré est utilisé pour créer une partition non formatée du même type que la partition d'origine.

source: Disk Drive with Partition Resized
fr: Disque dur avec partition redimensionnée

source: It is important to understand what the resizing software you use does with the newly freed space, so that you can take the appropriate steps. In the case illustrated here, it would be best to delete the new DOS partition and create the appropriate Linux partition(s).
fr: Il est important de comprendre ce que le logiciel de redimensionnement que vous utilisez fait de l'espace libéré. Vous pouvez ainsi suivre les étapes appropriées. Dans le cas illustré ici, il vaut mieux supprimer la nouvelle partition DOS et créer les partitions Linux requises à sa place.

source: As the previous step implied, it may or may not be necessary to create new partitions. However, unless your resizing software is Linux-aware, it is likely that you must delete the partition that was created during the resizing process. <xref linkend="figu-partitions-final-configuration" />, shows this being done.
fr: Comme l'impliquait les étapes suivies précédemment, la création de nouvelles partitions peut être nécessaire ou pas. Cependant, à moins que votre logiciel de re-partitionnement ne soit « compatible Linux », il est probable que vous deviez supprimer la partition créée lors du processus de redimensionnement. La <xref linkend="figu-partitions-final-configuration" /> présente le déroulement de ce processus.

source: Disk Drive with Final Partition Configuration
fr: Disque dur avec configuration finale des partitions

source: Partition Naming Schemes and Mount Points
fr: Schéma de nommage des partitions et points de montage

source: A common source of confusion for users unfamiliar with Linux is the matter of how partitions are used and accessed by the Linux operating system. In DOS/Windows, it is relatively simple: Each partition gets a "drive letter." You then use the correct drive letter to refer to files and directories on its corresponding partition. This is entirely different from how Linux deals with partitions and, for that matter, with disk storage in general. This section describes the main principles of partition naming scheme and the way how partitions are accessed in &PRODUCT;.
fr: Un point qui génère beaucoup de confusion chez les nouveaux venus à Linux est le manière dont ce système d'exploitation utilise les partitions et y accède. Sous DOS/Windows, la chose est relativement simple : chaque partition reçoit une lettre distinctive. Vous utilisez ensuite cette lettre pour faire référence aux fichiers et aux dossiers sur la partition correspondante. Cela est complétement différent de la façon dont Linux procède avec les partitions et, sur ce sujet, avec le stockage sur disque en général. Cette section décrit les principes généraux de nommage des partitions et d'accès à ces dernières dans &PRODUCT;.

source: Partition Naming Scheme
fr: Système de nommage des partitions

source: Linux uses a naming scheme that is file-based, with file names in the form of <filename>/dev/<replaceable>xxyN</replaceable></filename>.
fr: Linux utilise un schéma de nommage basé sur les fichiers, avec des noms de fichiers de la forme <filename>/dev/<replaceable>xxyN</replaceable></filename>.

source: Device and partition names consist of the following:
fr: Les noms de périphérique et de partition se décompose comme expliqué ci-après :

source: This is the name of the directory in which all device files reside. Because partitions reside on hard disks, and hard disks are devices, the files representing all possible partitions reside in <filename>/dev/</filename>.
fr: C'est le nom du dossier dans lequel résident tous les fichiers de périphérique. Parce que les partitions résident sur les disques et que les disques sont des périphériques, les fichiers représentant toutes les partitions possibles résident dans <filename>/dev/</filename> – « dev » étant l'abréviation de « device » soit « périphérique » en français.

source: The first two letters of the partition name indicate the type of device on which the partition resides, usually <filename>sd</filename>.
fr: Les deux premières lettres du nom de la partition font référence au type de périphérique sur lequel elle réside, ordinairement <filename>sd</filename>.

source: This letter indicates which device the partition is on. For example, <filename>/dev/sda</filename> for the first hard disk, <filename>/dev/sdb</filename> for the second, and so on.
fr: Cette lettre distingue le périphérique porteur de la partition des autres périphériques de même type. Par exemple, <filename>/dev/sda</filename> représente le premier disque dur, <filename>/dev/sdb</filename> représente le second et ainsi de suite.

source: The final number denotes the partition. The first four (primary or extended) partitions are numbered <filename>1</filename> through <filename>4</filename>. Logical partitions start at <filename>5</filename>. So, for example, <filename>/dev/sda3</filename> is the third primary or extended partition on the first hard disk, and <filename>/dev/sdb6</filename> is the second logical partition on the second hard disk.
fr: Le chiffre (nombre) terminal distingue la partition des autres partitions du même périphérique. Les quatre partitions (primaires ou étendues ) sont numérotées de <filename>1</filename> à <filename>4</filename>. Les partitions logiques sont numérotées à partir de <filename>5</filename>. Ainsi, par exemple, <filename>/dev/sda3</filename> est la troisième partition primaire ou étendue sur le disque <filename>/dev/sdb6</filename> est la deuxième partition logique sur le disque.

source: Even if your system can identify and refer to all types of disk partitions, it might not be able to <emphasis>read</emphasis> the file system and therefore access stored data on every partition type. However, in many cases, it is possible to successfully access data on a partition dedicated to another operating system.
fr: Même si votre système est capable d'identifier et de référencer tous les types de partitions, il se peut qu'il ne puisse <emphasis>lire</emphasis> le système de fichiers, et par conséquent accéder aux donnés, de chacun des types de partition. Cependant, dans de nombreux cas, il est possible d'accéder aux données d'une partition dédiée à un autre système d'exploitation.

source: Disk Partitions and Mount Points
fr: Partitions de disque et points de montage

source: Each partition is used to form part of the storage necessary to support a single set of files and directories. This is done by associating a partition with a directory through a process known as <firstterm>mounting</firstterm>. Mounting a partition makes its storage available starting at the specified directory (known as a <firstterm>mount point</firstterm>).
fr: Chacune des partitions est utilisée en tant que partie d'une arborescence unique de dossiers et de fichiers. Cela est rendu possible en rattachant la partition à un dossier de cette arborescence par une opération connue sous le nom de <firstterm>montage</firstterm>. Monter une partition rend les dossiers et fichiers qu'elle contient accessibles depuis le dossier auquel elle a été rattachée. Ce point de rattachement dans l'arborescence unique s'appelle : <firstterm>point de montage</firstterm>.

source: For example, if partition <filename>/dev/sda5</filename> is mounted on <filename>/usr/</filename>, that would mean that all files and directories under <filename>/usr/</filename> physically reside on <filename>/dev/sda5</filename>. So the file <filename>/usr/share/doc/FAQ/txt/Linux-FAQ</filename> would be stored on <filename>/dev/sda5</filename>, while the file <filename>/etc/gdm/custom.conf</filename> would not.
fr: Par exemple, si la partition <filename>/dev/sda5</filename> est montée sur <filename>/usr/</filename>, cela signifie que tous les dossiers et fichiers dans la branche <filename>/usr/</filename> de l'arborescence résident physiquement sur <filename>/dev/sda5</filename>. Ainsi, le fichier <filename>/usr/share/doc/FAQ/txt/Linux-FAQ</filename> est stocké sur <filename>/dev/sda5</filename>, alors que le fichier <filename>/etc/gdm/custom.conf</filename> ne l'est pas.

source: Continuing the example, it is also possible that one or more directories below <filename>/usr/</filename> would be mount points for other partitions. For instance, a partition (say, <filename>/dev/sda7</filename>) could be mounted on <filename>/usr/local/</filename>, meaning that <filename>/usr/local/man/whatis</filename> would then reside on <filename>/dev/sda7</filename> rather than <filename>/dev/sda5</filename>.
fr: Dans la continuité de cet exemple, il est aussi possible qu'un ou plusieurs dossiers de la branche <filename>/usr/</filename> soient des points de montage pour d'autres partitions. Par exemple, une partition (disons, <filename>/dev/sda7</filename>) pourrait être montée sur <filename>/usr/local/</filename>, ce qui voudrait dire que <filename>/usr/local/man/whatis</filename> résiderait non plus sur <filename>/dev/sda5</filename> mais sur <filename>/dev/sda7</filename>.

source: How Many Partitions?
fr: Nombre de partitions requis
