Repository: jaaf/po_purifier
Catalog: testing_data/Disk_Partitions.po
Languages: fr

source: An Introduction to Disk Partitions
fr: Introduction au partitionnement des disques

source: This appendix is not necessarily applicable to architectures other than AMD64 and Intel&nbsp;64. However, the general concepts mentioned here may apply.
fr: Cet appendice ne s'applique pas nécessairement aux architectures autres que AMD64 et Intel&nbsp;64. Néanmoins, les concepts généraux évoqués ici sont susceptibles de s'appliquer.

source: This section discusses basic disk concepts, disk repartitioning strategies, the partition naming scheme used by Linux systems, and related topics.
fr: Cette section traite des concepts de base sur les disques, leur partitionnement, le schéma de nommage des partitions utilisé par les systèmes Linux ainsi que des sujets en relation.

source: If you are comfortable with disk partitions, you can skip ahead to <xref linkend="sect-disk-partitions-making-room" /> for more information on the process of freeing up disk space to prepare for a &PRODUCT; installation.
fr: Si vous êtes à l'aise avec les partitions de disque, vous pouvez passer à la <xref linkend="sect-disk-partitions-making-room" /> pour plus d'information sur la manière de libérer de l'espace disque afin de préparer l'installation de &PRODUCT;.

source: Hard Disk Basic Concepts
fr: Concepts de base concernant les disques durs

source: Hard disks perform a very simple function - they store data and reliably retrieve it on command.
fr: La fonction des disques durs s'énonce simplement – ils stockent des données et permettent de les retrouver d'une manière fiable.

source: When discussing issues such as disk partitioning, it is important to have a understanding of the underlying hardware; however, since the theory is very complicated and expansive, only the basic concepts will be explained here. This appendix uses a set of simplified diagrams of a disk drive to help explain what is the process and theory behind partitions.
fr: Lorsque l'on discute des problèmes relatifs au partitionnement des disques, il importe d'avoir une bonne compréhension du matériel sous-jacent ; néanmoins, comme la théorie est très compliquée et longue, nous nous contenterons de n'évoquer ici que les concepts de base. Cette appendice utilise un jeu de diagrammes simplifiés du disque dur qui aide à faire comprendre ce que recouvre le concept de partition d'un point de vue pratique et théorique.

source: <xref linkend="figu-partitions-unused-drive" />, shows a brand-new, unused disk drive.
fr: La <xref linkend="figu-partitions-unused-drive" /> présente un disque tout neuf et non encore utilisé.

source: An Unused Disk Drive
fr: Un disque dur tout neuf

source: File Systems
fr: Systèmes de fichiers

source: To store data on a disk drive, it is necessary to <firstterm>format</firstterm> the disk drive first. Formatting (usually known as "making a <firstterm>file system</firstterm>") writes information to the drive, creating order out of the empty space in an unformatted drive.
fr: Pour pouvoir utiliser un disque et y placer des données, la première chose à faire est de le <firstterm>formater</firstterm>. Le formatage (habituellement connu comme la « création d'un <firstterm>système de fichiers</firstterm> ») écrit des informations sur le disque, créant ainsi un espace ordonné dans l'espace sans repère du disque non formaté.

source: Disk Drive with a File System
fr: Disque dur avec un système de fichiers

source: As <xref linkend="figu-partitions-formatted-drive" />, implies, the order imposed by a file system involves some trade-offs:
fr: Comme le montre la <xref linkend="figu-partitions-formatted-drive" />, l'ordre imposé par le système de fichiers implique un certain nombre de compromis :

source: A small percentage of the driver's available space is used to store file system-related data and can be considered as overhead.
fr: Un petit pourcentage de l'espace disponible du disque sert à stocker des données relatives au système de fichiers lui-même et peut être considéré comme un coût indirect.

source: A file system splits the remaining space into small, consistently-sized segments. For Linux, these segments are known as <firstterm>blocks</firstterm>. <footnote> <para> Blocks really <emphasis>are</emphasis> consistently sized, unlike our illustrations. Keep in mind, also, that an average disk drive contains thousands of blocks. The picture is simplified for the purposes of this discussion. </para> </footnote>
fr: Un système de fichiers divise l'espace restant en segments de taille petite mais constante. Dans Linux, ces segments sont appelés <firstterm>blocs</firstterm>. <footnote> <para> Les blocs <emphasis>sont</emphasis> d'une taille constante, contrairement à notre illustration. Gardez bien à l'esprit qu'un disque de taille moyenne contient des milliers de blocs. Cette illustration est simplifiée pour les besoins de l'explication. </para> </footnote>

source: Note that there is no single, universal file system. As <xref linkend="figu-partitions-different-file-system" />, shows, a disk drive may have one of many different file systems written on it. Different file systems tend to be incompatible; that is, an operating system that supports one file system (or a handful of related file system types) may not support another. However, &PRODUCT; supports a wide variety of file systems (including many commonly used by other operating systems such as Microsoft Windows), making data interchange between different file systems easy.
fr: Notez bien qu'il n'y a pas un système de fichiers unique et universel. Comme le montre la <xref linkend="figu-partitions-different-file-system" />, un disque dur peut contenir plusieurs systèmes de fichiers différents. Les différents systèmes de fichiers sont incompatibles ; ce qui veut dire qu'un système d'exploitation qui prend en charge un système de fichiers (ou un groupe de types de système de fichiers apparentés) peut ne pas en prendre en charge un autre. Néanmoins, &PRODUCT; prend en charge une grande variété de systèmes de fichiers (y compris beaucoup des systèmes de fichiers utilisés couramment par d'autres systèmes d'exploitation tels que Microsoft Windows) facilitant ainsi l'échange de données entre différents systèmes de fichiers.

source: Disk Drive with a Different File System
fr: Disque dur avec un système de fichiers différent

source: Writing a file system to disk is only the first step. The goal of this process is to actually <emphasis>store</emphasis> and <emphasis>retrieve</emphasis> data. The figure below shows a drive disk after some data have been written to it:
fr: Créer un système de fichiers sur un disque n'est qu'une première étape. Le but de ce processus est d'y <emphasis>stocker</emphasis> et d'y <emphasis>retrouver</emphasis> des données. La figure qui suit présente un disque après que quelques données y ont été écrites.

source: Disk Drive with Data Written to It
fr: Disque dur avec des données écrites dessus

source: As <xref linkend="figu-partitions-drive-with-data" />, shows, some of the previously-empty blocks are now holding data. However, by just looking at this picture, we cannot determine exactly how many files reside on this drive. There may only be one file or many, as all files use at least one block and some files use multiple blocks. Another important point to note is that the used blocks do not have to form a contiguous region; used and unused blocks may be interspersed. This is known as <firstterm>fragmentation</firstterm>. Fragmentation can play a part when attempting to resize an existing partition.
fr: Comme la <xref linkend="figu-partitions-drive-with-data" /> le montre, quelques un des blocs précédemment vides contiennent maintenant des données. Cependant, en nous contentant de regarder cette figure, nous ne pouvons pas dire exactement combien de fichiers résident sur ce disque. Il peut tout aussi bien y en avoir un comme plusieurs, sachant qu'un fichier utilise au moins un bloc mais peut en utiliser plusieurs. Un autre point important à noter est que les blocs utilisés n'ont pas besoin d'être contigus ; des blocs libres peuvent être intercalés entre des blocs utilisés. Ce phénomène est connu sous le nom de <firstterm>fragmentation</firstterm>. La fragmentation est à prendre en compte lors du redimensionnement d'une partition existante.

source: As with most computer-related technologies, disk drives changed over time after their introduction. In particular, they got bigger. Not larger in physical size, but bigger in their capacity to store information. And, this additional capacity drove a fundamental change in the way disk drives were used.
fr: Comme c'est le cas pour la plupart des techniques relatives aux ordinateurs, les lecteurs de disques ont changé depuis leurs débuts. En particulier, il sont devenus plus gros. Non pas dans leurs dimensions physiques, mais dans leur capacité de stockage d'informations. Cette capacité additionnelle a entraîné des changements fondamentaux dans la manière de les utiliser.

source: Partitions: Turning One Drive Into Many
fr: Partitions : découpage d'un disque en plusieurs

source: Disk drives can be divided into <firstterm>partitions</firstterm>. Each partition can be accessed as if it was a separate disk. This is done through the addition of a <firstterm>partition table</firstterm>.
fr: On peut diviser un disque en plusieurs <firstterm>partitions</firstterm>. On peut alors accéder à chacune des partitions comme si elle était un disque distinct. Cela est rendu possible par la création d'une <firstterm>table des partitions</firstterm>.

source: There are several reasons for allocating disk space into separate disk partitions, for example:
fr: Plusieurs raisons motivent l'allocation de l'espace disque sous forme de partitions séparées ; par exemple :

source: Logical separation of the operating system data from the user data
fr: le désir de séparer les données du système d'exploitation de celle de l'utilisateur ;

source: Ability to use different file systems
fr: avoir la possibilité d'utiliser des systèmes de fichiers différents ;

source: Ability to run multiple operating systems on one machine
fr: avoir la possibilité de faire cohabiter plusieurs systèmes d'exploitation sur une seule machine.

source: There are currently two partitioning layout standards for physical hard disks: Master Boot Record (<acronym>MBR</acronym>) and GUID Partition Table (<acronym>GPT</acronym>). <acronym>MBR</acronym> is an older method of disk partitioning used with BIOS-based computers. <acronym>GPT</acronym> is a newer partitioning layout that is a part of the Unified Extensible Firmware Interface (<acronym>UEFI</acronym>). This section and <xref linkend="sect-disk-partitions-extended" /> mainly describe the <firstterm>Master Boot Record</firstterm> (<acronym>MBR</acronym>) disk partitioning scheme. For information about the <firstterm>GUID Partition Table</firstterm> (<acronym>GPT</acronym>) partitioning layout, see <xref linkend="sect-disk-partitioning-guid-partition-table" />.
fr: Actuellement, il existe deux arrangements standard des partitions sur un disque dur : celui régit par l'Enregistrement maître de démarrage (Master Boot Record – <acronym>MBR</acronym>) et celui régit par la table des partitions GUID (GUID Partition Table – <acronym>GPT</acronym>). <acronym>MBR</acronym> est une méthode traditionnelle de partitionnement des disques sur les systèmes dotés d'un micrologiciel BIOS. <acronym>GPT</acronym> est un nouveau schéma de partitionnement qui fait partie de l'Interface logicielle extensible unifiée (Unified Extensible Firmaware Interface - <acronym>UEFI</acronym>). Cette section et la <xref linkend="sect-disk-partitions-extended" /> décrivent essentiellement le schéma de partitionnement <acronym>MBR</acronym>. Pour des informations sur le partitionnement <acronym>GPT</acronym> reportez-vous à la <xref linkend="sect-disk-partitioning-guid-partition-table" />.

source: While the diagrams in this chapter show the partition table as being separate from the actual disk drive, this is not entirely accurate. In reality, the partition table is stored at the very start of the disk, before any file system or user data. But for clarity, they are separate in our diagrams.
fr: Alors que les schémas de ce chapitre montrent la table de partitions comme étant séparée du disque réel, la chose n'est pas tout à fait exacte. En réalité, la table des partitions est stockée en tout début du disque, avant tout système de fichiers ou donnée utilisateur. Mais pour plus de clarté nous l'avons séparée dans nos schémas.

source: Disk Drive with Partition Table
fr: Disque dur avec table des partitions

source: As <xref linkend="figu-partitions-partition-table" /> shows, the partition table is divided into four sections or four <firstterm>primary</firstterm> partitions. A primary partition is a partition on a hard drive that can contain only one logical drive (or section). Each section can hold the information necessary to define a single partition, meaning that the partition table can define no more than four partitions.
fr: Comme le montre la <xref linkend="figu-partitions-partition-table" /> la table des partitions comprend quatre entrées qui décrivent chacune une partition sur le disque. Ces partitions sont qualifiées de <firstterm>primaires</firstterm> par opposition aux partitions <firstterm>logiques</firstterm> qui seront introduites plus loin dans cette section.

source: Each partition table entry contains several important characteristics of the partition:
fr: Chaque entrée de table des partitions contient plusieurs caractéristiques importantes concernant la partition :

source: The points on the disk where the partition starts and ends
fr: les points sur le disque où la partition commence et finit ;

source: Whether the partition is "active"
fr: le caractère « actif » ou non de la partition ;

source: The partition's type
fr: le type de la partition.

source: The starting and ending points define the partition's size and location on the disk. The "active" flag is used by some operating systems' boot loaders. In other words, the operating system in the partition that is marked "active" is booted.
fr: Les points de départ et de fin déterminent la taille de la partition et son emplacement sur le disque. Le drapeau « active » est utilisé par les chargeurs de démarrage de certains systèmes d'exploitation pour déterminer où se trouve le système d'exploitation à charger.

source: The type is a number that identifies the partition's anticipated usage. Some operating systems use the partition type to denote a specific file system type, to flag the partition as being associated with a particular operating system, to indicate that the partition contains a bootable operating system, or some combination of the three.
fr: Le type est un nombre que identifie l'usage attendu de la partition. Certains systèmes d'exploitation utilisent ce type pour caractériser un type spécifique de système de fichiers, pour marquer la partition comme étant associée à un type particulier de système de fichiers, pour indiquer que la partition contient un système d'exploitation amorçable ou pour une combinaison des trois..

source: See <xref linkend="figu-partitions-single-part" /> for an example of a disk drive with single partition.
fr: Voir la figure <xref linkend="figu-partitions-single-part" /> pour un exemple de disque avec une seule partition.

source: Disk Drive With Single Partition
fr: Disque dur avec une seule partition

source: The single partition in this example is labeled as <literal>DOS</literal>. This label shows the <emphasis>partition type</emphasis>, with <literal>DOS</literal> being one of the most common ones. The table below shows a list of some of the commonly used partition types and hexadecimal numbers used to represent them.
fr: La partition unique dans cette exemple est étiquetée <literal>DOS</literal>. Cette étiquette indique le <emphasis>type de partition</emphasis>, <literal>DOS</literal> étant l'un des plus communs. Le tableau ci-après présente une liste des types de partition les plus utilisés ainsi que leur représentation hexadécimale.

source: Partition Types
fr: Types de partition

source: Partition Type
fr: Type de partition

source: Value
fr: Valeur

source: Empty
fr: Vide

source: DOS 12-bit FAT
fr: DOS avec FAT sur 12 bits

source: XENIX root
fr: racine XENIX

source: Old MINIX
fr: Anciennes MINIX

source: DOS 16-bit &lt;=32M
fr: DOS avec FAT sur 16 bits &lt;=32 Mo

source: Linux swap
fr: Mémoire virtuelle Linux

source: Extended
fr: Étendue

source: Linux native
fr: Native Linux

source: DOS 16-bit &gt;=32
fr: DOS FAT sur 16 bits &gt;=32 Mo

source: Linux extended
fr: Linux étendue

source: AIX bootable
fr: AIX amorçable

source: OS/2 Boot Manager
fr: Gestionnaire de démarrage OS/2

source: BSDI swap
fr: Mémoire virtuelle BSDI

source: Win95 Extended (LBA)
fr: Win95 étendue (LBA)

source: DOS access
fr: accès DOS

source: PReP Boot
fr: Amorçage PReP

source: DOS secondary
fr: DOS secondaire

source: Partitions Within Partitions - An Overview of Extended Partitions
fr: Partitions dans une partition - Vue d'ensemble des partitions étendues

source: In case four partitions are insufficient for your needs, you can use <firstterm>extended partitions</firstterm> to create up additional partitions. You do this by setting the type of a partition to "Extended".
fr: Dans le cas où quatre partitions ne vous suffiraient pas, vous pouvez utiliser une <firstterm>partition étendue</firstterm> en vue de créer des partitions supplémentaire . Pour cela vous devez attribuer à la partition le type "Extended".

source: An extended partition is like a disk drive in its own right - it has its own partition table which points to one or more partitions (now called <firstterm>logical partitions</firstterm>, as opposed to the four <firstterm>primary partitions</firstterm>) contained entirely within the extended partition itself. <xref linkend="figu-partitions-extended" />, shows a disk drive with one primary partition and one extended partition containing two logical partitions (along with some unpartitioned free space).
fr: Une partition étendue peut contenir plusieurs partitions (maintenant appelées <firstterm>partitions logiques</firstterm> par opposition aux quatre <firstterm>partitions primaires</firstterm> vues précédemment). Chacune de ces partitions logique est précédée d'un secteur (appelé Extended Boot Record (<acronym>EBR</acronym>) utilisé à la manière d'un MBR, à la différence que deux entrées de partition seulement sont utilisées. l'une qui pointe sur la partition logique elle-même, l'autre qui pointe sur l'EBR de la partition logique suivante. Les partitions sont ainsi chaînées et leur nombre n'est plus limité que par la capacité du disque lui-même et par l'étendue adressable.

source: Disk Drive With Extended Partition
fr: Disque dur avec partition étendue

source: As this figure implies, there is a difference between primary and logical partitions - there can only be four primary partitions, but there is no fixed limit to the number of logical partitions that can exist. However, due to the way in which partitions are accessed in Linux, no more than 12 logical partitions should be defined on a single disk drive.
fr: Comme cette figure le sous-entend, il y a une différence entre les partitions primaires et les partitions logiques – il ne peut y avoir que quatre partitions primaires, mais il n'y a pas de limite au nombre de partitions logiques qui peuvent exister. Cependant, à cause de la manière avec laquelle on accède aux partitions sous Linux, on ne doit pas dépasser 12 partitions logiques sur un seul disque.

source: GUID Partition Table (GPT)
fr: Table des partitions GUID (GPT)

source: GUID Partition Table (<acronym>GPT</acronym>) is a newer partitioning scheme based on using Globally Unique Identifiers (<acronym>GUID</acronym>). <acronym>GPT</acronym> was developed to cope with limitations of the <acronym>MBR</acronym> partition table, especially with the limited maximum addressable storage space of a disk. Unlike <acronym>MBR</acronym>, which is unable to address storage space larger than 2.2 terabytes, <acronym>GPT</acronym> can be used with hard disks larger than this; the maximum addressable disk size is 2.2 zettabytes. In addition, <acronym>GPT</acronym> by default supports creating up to 128 primary partitions. This number could be extended by allocating more space to the partition table.
fr: La table des partitions GUID (<acronym>GPT</acronym>) est un nouveau principe de partitionnement qui utilise les identifiants unique globaux (<acronym>GUID</acronym>). La <acronym>GPT</acronym> a été développée pour s'affranchir des limitations de la table des partitions <acronym>MBR</acronym>, en particulier de sa capacité d'adressage limitée sur le disque. À la différence de la table des partitions <acronym>MBR</acronym> qui est incapable d'adresser un espace de stockage plus grand que 2,2 teraoctets, la <acronym>GPT</acronym> peut être utilisée avec des disque bien plus grands ; l'espace adressable atteint 2,2 zettaoctets. De plus, la <acronym>GPT</acronym> peut accueillir 128 entrées de partition. Ce nombre peut être étendu en allouant plus d'espace à la table des partitions.

source: <acronym>GPT</acronym> disks use logical block addressing (LBA) and the partition layout is as follows:
fr: Les disques <acronym>GPT</acronym> utilisent l'adressage par blocs logiques (LBA) et le partitionnement se fait comme indiqué ci-dessous :

source: To preserve backward compatibility with MBR disks, the first sector (<acronym>LBA</acronym> 0) of <acronym>GPT</acronym> is reserved for <acronym>MBR</acronym> data and it is called <quote>protective MBR</quote>.
fr: Pour conserver la rétro-compatibilité avec les disques MBR, le premier secteur (<acronym>LBA</acronym> 0) d'un disque <acronym>GPT</acronym> est réservé pour des données de type <acronym>MBR</acronym>. Ce premier secteur est appel : <quote>protective MBR</quote>.

source: The <firstterm>primary <acronym>GPT</acronym> header</firstterm> begins on the second logical block (<acronym>LBA</acronym> 1) of the device. The header contains the disk GUID, the location of the primary partition table, the location of the secondary GPT header, and CRC32 checksums of itself and the primary partition table. It also specifies the number of partition entries of the table.
fr: Le premier <firstterm>en-tête <acronym>GPT</acronym> primaire</firstterm> commence au second bloc logique (<acronym>LBA</acronym> 1) du disque. Cet en-tête contient le GUID du disque, l'emplacement de la table primaire des partitions, l'emplacement de l'en-tête GPT secondaire et des sommes de contrôle CRC32 de lui-même et de la table primaire des partitions. Il indique aussi le nombre d'entrées de partition de la table.

source: The <firstterm>primary <acronym>GPT</acronym> table</firstterm> includes, by default, 128 partition entries, each with an entry size 128 bytes, its partition type GUID and unique partition GUID.
fr: La <firstterm>table <acronym>GPT</acronym> primaire</firstterm> comprend 128 entrées de partition par défaut. Chaque entrée utilise 128 octets et contient le GUID du type de la partition et le GUID de la partition.

source: The <firstterm>secondary <acronym>GPT</acronym> table</firstterm> is identical to the primary <acronym>GPT</acronym> table. It is used mainly as a backup table for recovery in case the primary partition table is corrupted.
fr: La <firstterm>table <acronym>GPT</acronym> secondaire</firstterm> est identique à la table <acronym>GPT</acronym> primaire. Elle est utilisée en tant que copie de sauvegarde pour récupération des données en cas de corruption de la table primaire.
