Repository: jaaf/po_purifier
Catalog: testing_data/FilterSpoke_AddiSCSI.po
Languages: fr

source: Add iSCSI Target
fr: Ajout d'une cible iSCSI

source: To use iSCSI storage devices, the installer must be able to discover them as <firstterm>iSCSI targets</firstterm> and be able to create an iSCSI session to access them. Both of these steps may require a user name and password for <firstterm>Challenge Handshake Authentication Protocol</firstterm> (CHAP) authentication.
fr: Pour utiliser des périphériques de stockage iSCSI, l'installateur doit être capable de les découvrir en tant que <firstterm>cible iSCSI</firstterm> et être capable de créer une session iSCSI pour y accéder. Ces deux étapes peuvent nécessiter un nom d'utilisateur et un mot de passe pour l'authentification CHAP (<firstterm>Challenge Handshake Authentication Protocol</firstterm>).

source: You can also configure an iSCSI target to authenticate the iSCSI initiator on the system to which the target is attached (<firstterm>reverse CHAP</firstterm>), both for discovery and for the session. Used together, CHAP and reverse CHAP are called <firstterm>mutual CHAP</firstterm> or <firstterm>two-way CHAP</firstterm>. Mutual CHAP provides the greatest level of security for iSCSI connections, particularly if the user name and password are different for CHAP authentication and reverse CHAP authentication.
fr: Vous pouvez aussi configurer une cible iSCSI pour authentifier l'initiateur iSCSI sur le système auquel la cible est attachée (<firstterm>CHAP inversé</firstterm>), à la fois pour la découverte et pour la session. Utilisé conjointement, CHAP et CHAP inversé sont appelés <firstterm>CHAP mutuel</firstterm> ou <firstterm>CHAP double-sens</firstterm>( CHAP mutuel fournit le plus haut niveau de sécurité pour les connexion iSCSI, en particulier si le nom utilisateur et le mot de passe sont différents pour l'authentification CHAP et l'authentification CHAP inversé).

source: Follow the procedure below to add an iSCSI storage target to your system.
fr: Suivez la procédure qui suit pour ajouter une cible de stockage iSCSI à votre système.

source: Click the <guilabel>Add iSCSI Target</guilabel> button in the bottom right corner of the <xref linkend="sect-installation-gui-installation-destination" /> screen. A new dialog window titled <guilabel>Add iSCSI Storage Target</guilabel> will open.
fr: Cliquez sur le bouton <guilabel>Ajouter une cible de stockage iSCSI</guilabel> en bas à droite de l'écran objet de la <xref linkend="sect-installation-gui-installation-destination" />. Une nouvelle fenêtre de dialogue intitulée <guilabel>Ajouter une cible de stockage iSCSI</guilabel> s'ouvre.

source: Enter the IP address of the iSCSI target in the <guilabel>Target IP Address</guilabel> field.
fr: Entrez l'adresse IP de la cible iSCSI dans le champ <guilabel>Adresse IP cible</guilabel>.

source: Provide a name in the <guilabel>iSCSI Initiator Name</guilabel> field for the iSCSI initiator in <firstterm>iSCSI Qualified Name</firstterm> (IQN) format. A valid IQN entry contains:
fr: Entrez un nom dans le champ <guilabel>Nom d'initiateur iSCSI</guilabel> pour l'initiateur iSCSI dans le format <firstterm>Nom iSCSI qualifié</firstterm> (IQN). Une entrée IQN valide contient :

source: The string <literal>iqn.</literal> (including the period).
fr: La chaîne <literal>iqn.</literal> (y compris le point).

source: A date code specifying the year and month in which your organization's Internet domain or subdomain name was registered, represented as four digits for the year, a dash, and two digits for the month, followed by a period. For example, represent September 2010 as <literal>2010-09.</literal>
fr: Un code de date spécifiant l'année et le mois durant lesquels le nom de domaine ou de sous-domaine Internet de votre organisation a été enregistré dans le format suivant : quatre chiffres pour l'année, un tiret court, deux chiffres pour le mois et un point. Par exemple pour septembre 2010 : <literal>2010-09.</literal>.

source: Your organization's Internet domain or subdomain name, presented in <emphasis>reverse</emphasis> order (with the top-level domain first). For example, represent the subdomain storage.example.com as <literal>com.example.storage</literal>.
fr: Le nom de domaine ou de sous-domaine Internet de votre organisation dans l'ordre <emphasis>inverse</emphasis> (avec le domaine de haut niveau d'abord). Par exemple, dans le cas de storage.example.com : <literal>com.example.storage</literal>.

source: A colon (<literal>:</literal>) followed by a string which uniquely identifies this particular iSCSI initiator within your domain or subdomain. For example, <literal>:diskarrays-sn-a8675309</literal>
fr: Un caractère deux-points (<literal>:</literal>) suivi d'une chaîne qui identifie de manière unique cet initiateur iSCSCS particulier dans votre domaine ou sous-domaine. Par exemple, <literal>:diskarrays-sn-a8675309</literal>

source: A complete IQN will therefore look as follows:
fr: Un IQN complet ressemble à ceci :

source: An example using the correct format is also displayed below the input field for reference.
fr: Un exemple utilisant le format correct est aussi affiché sous le champ de saisie pour référence.

source: For more information about IQNs, see <citetitle>3.2.6. iSCSI Names in RFC 3720 - Internet Small Computer Systems Interface (iSCSI)</citetitle>, available from <ulink url="http://tools.ietf.org/html/rfc3720#section-3.2.6" /> and <citetitle>1. iSCSI Names and Addresses in RFC 3721 - Internet Small Computer Systems Interface (iSCSI) Naming and Discovery</citetitle>, available from <ulink url="http://tools.ietf.org/html/rfc3721#section-1" />.
fr: Pour plus d'informations sur les IQNs, reportez-vous à <citetitle>3.2.6. iSCSI Names in RFC 3720 - Internet Small Computer Systems Interface (iSCSI)</citetitle> (en anglais), disponible à <ulink url="http://tools.ietf.org/html/rfc3720#section-3.2.6" /> et <citetitle>1. iSCSI Names and Addresses in RFC 3721 - Internet Small Computer Systems Interface (iSCSI) Naming and Discovery</citetitle>(en anglais), disponible à <ulink url="http://tools.ietf.org/html/rfc3721#section-1" />.

source: Specify the type of authentication to use for iSCSI discovery using the <guilabel>Discovery Authentication Type</guilabel> drop-down menu. Depending on which type of authentication you selected, additional input fields (such as <guilabel>CHAP Username</guilabel> and <guilabel>CHAP Password</guilabel> may then become visible. Fill in your authentication credentials; these should be provided by your organization.
fr: Spécifiez le type d'authentification à utiliser pour la découverte iSCSI en utilisant le menu déroulant <guilabel>Type d'authentification de la découverte</guilabel>. Selon le type d'authentification que vous avez choisi, des champs de saisie additionnels (tels que <guilabel>Nom d'utilisateur CHAP</guilabel> et <guilabel>Mot de passe CHAP</guilabel> sont rendus visibles. Remplissez-les avec vos nom d'utilisateur et mot de passe ; ces derniers devraient vous avoir été fournis par votre organisation.

source: Click the <guilabel>Start Discovery</guilabel> button. The installer will now attempt to discover an iSCSI target based on the information you provided, and if the target requires CHAP or reverse CHAP authentication, it will attempt to use the credentials you provided. This process may take some time (generally less than 30 seconds), depending on your network.
fr: Cliquez sur le bouton <guilabel>Démarrer la découverte</guilabel>. L'installateur tente maintenant de découvrir une cible iSCSI en se basant sur les informations que vous avez fournies. Si la cible requiert une authentification CHAP, ou CHAP inversé, il essaye d'utiliser le nom d'utilisateur et le mot de passe que vous avez fournis. Ce processus peut prendre un certain temps (généralement moins de 30 secondes) qui dépend de votre réseau.

source: If the discovery was <emphasis>not</emphasis> successful, an error message will be displayed in the dialog window. This message will vary based on which part of the discovery failed. If the installer did not find the target you specified at all, you should check the IP address; if the problem is an authentication error, make sure you entered all CHAP and reverse CHAP credentials correctly and that you have access to the iSCSI target.
fr: Si la découverte a <emphasis>échoué</emphasis>, un message d'erreur est affiché dans le fenêtre de dialogue. Ce message varie selon la partie de la découverte qui a échoué. Si l'installateur n'a pas du tout trouvé la cible que vous avez spécifiée, vous devriez vérifier l'adresse IP ; si le problème vient d'une erreur d'authentification, assurez-vous d'avoir entré le nom d'utilisateur et le mot de passe CHAP, ou CHAP inversé, corrects et que vous avez accès à la cible iSCSI.

source: The <guilabel>No nodes discovered</guilabel> error message may also mean that all nodes on the address you specified are already configured. During discovery, <application>Anaconda</application> ignores nodes which have already been added.
fr: Le message d'erreur <guilabel>Aucun nœud découvert</guilabel> peut aussi signifier que tous les nœuds à l'adresse que vous avez spécifiée sont déjà configurés. Durant la découverte, <application>Anaconda</application> ignore les nœuds déjà ajoutés.

source: If the discovery was successful, you will see a list of all discovered nodes.
fr: Si la découverte a réussi, vous devez voir une liste de tous les nœuds découverts.

source: Select one or more nodes you want to log in to by marking or unmarking the check box next to each node discovered on the target. Below the list, select again the type of authentication you want to use; you can also select the <guilabel>Use the credentials from discovery</guilabel> option if the CHAP/reverse CHAP user name and password you used to discover the target are also valid for logging in to it.
fr: Sélectionnez un ou plusieurs nœuds auxquels vous voulez vous connecter en cochant, ou décochant, la case à cocher à côté de chacun des nœuds découverts sur la cible. Sous la liste, sélectionnez à nouveau le type d'authentification que vous voulez utiliser ; vous pouvez sélectionner l'option <guilabel>Utiliser les informations d'authentification récupérées</guilabel> si le nom d'utilisateur et le mot de passe que vous avez utilisés pour découvrir la cible sont également valables pour s'y connecter.

source: After selecting all nodes you want to use, click <guilabel>Log In</guilabel> to initiate an iSCSI session. <application>Anaconda</application> will attempt to log in to all selected nodes. If the login process is succesful, the <guilabel>Add iSCSI Storage Target</guilabel> dialog will close, and all nodes you have configured will now be shown in the list of network disks in <xref linkend="sect-installation-gui-installation-destination" />.
fr: Après avoir sélectionné tous les nœuds que vous voulez utiliser, cliquer sur le bouton <guilabel>Connexion</guilabel> pour initier une session iSCSI. <application>Anaconda</application> essaye de se connecter à tous les nœuds choisis. Si la connexion réussit, la fenêtre de dialogue <guilabel>Ajouter un cible de stockage iSCSI</guilabel> se ferme, et tous les nœuds que vous avez configurés apparaissent dans la liste des disques réseau dans l'écran objet de la <xref linkend="sect-installation-gui-installation-destination" />.

source: You can repeat this procedure to discover additional iSCSI targets, or to add more nodes from a previously configured target. However, note that once you click the <guilabel>Start Discovery</guilabel> button for the first time, you will not be able to change the <guilabel>iSCSI Initiator Name</guilabel>. If you made an error when configuring the initiator name, you must restart the installation.
fr: Vous pouvez répéter cette procédure pour découvrir des cibles iSCSI additionnelles, ou pour ajouter plus de nœuds à une cible configurée précédemment. Cependant, notez que, une fois que vous avez cliqué sur le bouton <guilabel>Démarrer la découverte</guilabel> pour la première fois, vous n'êtes plus en mesure de changer le <guilabel>nom d'initiateur iSCSI</guilabel>. Si vous avez fait une erreur en entrant le nom d'initiateur, vous devez redémarrer l'installation.
