Repository: jaaf/po_purifier
Catalog: testing_data/FilterSpoke.po
Languages: fr

source: Installation Destination - Specialized &amp; Network Disks
fr: Cible de l'installation – Disques spéciaux et réseau

source: This part of the <guilabel>Installation Destination</guilabel> screen allows you to configure non-local storage devices, namely iSCSI and FCoE storage. This section will mostly be useful to advanced users who have a need for networked disks. For instructions on setting up local hard drives, see <xref linkend="sect-installation-gui-storage-partitioning" />.
fr: Cette partie de l'écran <guilabel>Cible de l'installation</guilabel> vous permet de configurer des périphériques de stockage non locaux, nommément des stockages iSCSI et FCoE. Cette section vise surtout les utilisateurs avancés qui ont besoin de disques réseau. Pour des instructions sur la configuration de disques durs locaux, reportez-vous à la <xref linkend="sect-installation-gui-storage-partitioning" />.

source: This section only explains how to make existing network disks available inside the installer. It does not explain how to set up your network or a storage server, only how to connect to them.
fr: Cette section se contente d'expliquer comment rendre vous disques réseau disponibles pour l'installateur. Elle n'explique pas comment configurer votre réseau ou votre serveur de stockage mais seulement comment s'y connecter.

source: Installation Destination - Network Storage Filters
fr: Cible de l'installation – Filtres de stockage réseau

source: The screen contains a list of all currently available (discovered) network storage devices. When the screen is opened for the first time, the list will be empty in most cases because no network storage has been discovered - the installer makes no attempt at discovering this unless you configure network disks using a Kickstart file.
fr: Cet écran contient une liste de tous les périphériques de stockage réseau disponibles (découverts) à cet instant. Lorsque vous entrez dans cet écran pour la première fois, la liste est vide la plupart du temps parce que aucun stockage réseau n'a encore été découvert – l'installateur n'essaye pas d'en découvrir sauf si vous avez configuré des disques réseau dans un fichier Kickstart.

source: To add one or more storage devices to the screen so you can search them and use them in the installation, click <guilabel>Add iSCSI Target</guilabel> or <guilabel>Add FCoE SAN</guilabel> in the bottom right corner of the screen, and follow the instructions in <xref linkend="sect-installation-gui-installation-destination-add-iscsi" /> or <xref linkend="sect-installation-gui-installation-destination-add-fcoe" />, depending on which type of network storage you want to add.
fr: Pour ajouter un ou plusieurs périphériques de stockage dans cet écran de manière à pouvoir les rechercher et les utiliser pour l'installation, cliquez sur le bouton <guilabel>Ajouter la cible iSCSI</guilabel> ou <guilabel>Ajouter le SAN FCoE</guilabel> en bas à droite de l'écran et suivez les instruction de la <xref linkend="sect-installation-gui-installation-destination-add-iscsi" /> ou de la <xref linkend="sect-installation-gui-installation-destination-add-fcoe" /> selon le type de stockage réseau que vous désirez ajouter.

source: Network storage devices successfully discovered and configured by the installer will then be displayed in the main list, along with identifying information such as <guilabel>Name</guilabel>, <guilabel>WWID</guilabel>, <guilabel>Model</guilabel> and <guilabel>Target</guilabel>. To sort the list by a specific column (for example <guilabel>WWID</guilabel>), click the column's heading.
fr: Les périphériques de stockage réseau correctement découverts et configurés par l'installateur sont affichés dans la liste principale avec leurs informations d'identification telles que <guilabel>Nom</guilabel>, <guilabel>WWID</guilabel>, <guilabel>Modèle</guilabel> et <guilabel>Cible</guilabel>. Pour trier la liste selon une colonne particulière (par exemple <guilabel>WWID</guilabel>), cliquez sur le titre de la colonne.

source: On lower display resolutions, the list may be too wide to fit on the screen, and some of the columns or buttons may be hidden initially. Use the horizontal scroll bar at the bottom of the list to move your view and see all available table columns and controls.
fr: Pour les résolutions d'écran basses, la liste peut être trop large pour tenir à l'intérieur de l'écran, et quelques colonnes ou boutons peuvent être cachés au début. Utilisez la barre de défilement en bas de la liste pour déplacer votre vue et découvrir les colonnes et boutons restants.

source: There are three tabs on the top of the list, which display different information:
fr: Il y a trois onglets en haut de la liste qui montrent chacun des informations différentes :

source: Search
fr: Recherche

source: Displays all available devices, regardless of their type, and allows you to filter them either by their <firstterm>World Wide Identifier</firstterm> (WWID) or by the port, target, or logical unit number (LUN) at which they are accessed.
fr: Cet onglet affiche tous les périphériques disponibles, sans considération de type, et vous permet de les filtrer soit par leur <firstterm>identifiant globalement unique</firstterm> (WWID), soit par port, soit par cible ou numéro d'unité logique (LUN) par lequel ils sont accessibles.

source: Multipath Devices
fr: Périphériques multi-chemins

source: Storage devices accessible through more than one path, such as through multiple SCSI controllers or Fiber Channel ports on the same system.
fr: Cet onglet affiche les périphériques de stockage accessibles par plus d'un chemin, comme par exemple via plusieurs contrôleurs SCSI ou ports « Fiber Channel » sur le même système.

source: The installation program only detects multipath storage devices with serial numbers that are 16 or 32 characters long.
fr: L'installateur ne détecte que les périphériques de stockage multi-chemins dont la longueur du numéro de série est de 16 ou 32 caractères.

source: Other SAN Devices
fr: Autres périphériques SAN

source: Devices available on a Storage Area Network (SAN).
fr: Cet onglet affiche les périphériques disponibles sur les réseaux de stockage SAN.

source: Depending on the tab you are currently in, you can filter the discovered devices by using the <guilabel>Filter By</guilabel> field. Some of the filtering options are automatically populated based on discovered devices (for example, if you select <guilabel>Filter By:</guilabel> <guilabel>Vendor</guilabel>, another drop-down menu will appear showing all vendors of all discovered devices). Other filters require your input (for example when filtering by WWID), and present you with a text input field instead of a drop-down menu.
fr: Selon l'onglet dans lequel vous vous trouvez, vous pouvez filtrer les périphériques découverts en utilisant la liste déroulante <guilabel>Filtrer par</guilabel>. Certaines listes d'options sont remplies automatiquement en fonction des périphériques découverts (par exemple, si vous sélectionnez <guilabel>Filtrer par:</guilabel> <guilabel>Fournisseur</guilabel>, une autre liste déroulante contenant tous les fournisseurs des périphériques découverts s'affiche). D'autres filtrages requièrent votre saisie (par exemple le filtrage par WWID), et vous présente un champ de saisie vide plutôt qu'une liste déroulante pré-remplie.

source: In the list (regardless of how it is filtered), each device is presented on a separate row, with a check box to its left. Mark the check box to make the device available during the installation process; this will cause this device (node) to be shown in the <guilabel>Specialized &amp; Network Disks</guilabel> section in <xref linkend="sect-installation-gui-storage-partitioning" />. There, you can select the disk as an installation target and proceed with either manual or automatic partitioning.
fr: Dans la liste (indépendamment de la façon dont elle est filtrée), chaque périphérique est présenté sur une ligne distincte, avec une case à cocher à sa gauche. Cochez la case pour rendre le périphérique disponible pour l'installation. Cela fait apparaître le périphérique (nœud) dans la section <guilabel>Disques spéciaux et réseau</guilabel> de l'écran objet de la <xref linkend="sect-installation-gui-storage-partitioning" />. Dans cette section, vous pouvez sélectionner le disque en tant que cible de l'installation et entamer, soit un partitionnement manuel, soit un partitionnement automatique.

source: Devices that you select here are not automatically wiped by the installation process. Selecting a device on this screen does not, in itself, place data stored on the device at risk. Also note that any devices that you do not select here to form part of the installed system can be added to the system after installation by modifying the <filename>/etc/fstab</filename> file.
fr: Les périphériques que vous sélectionnez ici ne sont pas automatiquement effacés par le processus d'installation. Dans cet écran, la sélection d'un périphérique, en elle-même, ne menace pas les données stockées sur le disque. Notez aussi que n'importe quel périphérique que vous ne sélectionnez pas ici pour faire partie du système installé peut être ajouté au système après l'installation en modifiant le fichier <filename>/etc/fstab</filename>.

source: When you have selected the storage devices to make available during installation, click <guilabel>Done</guilabel> to return to <xref linkend="sect-installation-gui-storage-partitioning" />.
fr: Lorsque vous en avez terminé avec la sélection des périphériques de stockage à rendre disponibles pour l'installation, cliquez sur le bouton <guilabel>Fait</guilabel> pour retourner à l'écran de la <xref linkend="sect-installation-gui-storage-partitioning" />.
