Repository: jaaf/po_purifier
Catalog: testing_data/FilterSpoke_AddFCoE.po
Languages: fr

source: Add FCoE SAN
fr: Ajout de SANs FCoE

source: The following procedure explains how to add <firstterm>Fibre Channel over Ethernet</firstterm> (FCoE) storage devices and make them available during the installation:
fr: La procédure suivante décrit comment ajouter des périphériques de stockage <firstterm>Fibre Channel over Ethernet</firstterm> (FCoE) et les rendre disponibles pour l'installateur :

source: Add FCoE Target
fr: Ajout d'un SAN FCoE

source: Click the <guilabel>Add FCoE SAN</guilabel> button in the bottom right corner of <xref linkend="sect-installation-gui-installation-destination" />. A new dialog window will open.
fr: Cliquez sur le bouton <guilabel>Ajouter le SAN FCoE</guilabel>en bas à droite de l'écran objet de la <xref linkend="sect-installation-gui-installation-destination" />. Une nouvelle fenêtre de dialogue s'ouvre.

source: Select the network interface (<guilabel>NIC</guilabel>) which is connected to your FCoE switch from the drop-down menu. Note that this network interface must be configured and connected - see <xref linkend="sect-installation-gui-network-configuration" />.
fr: Dans le menu déroulant <guilabel>NIC</guilabel>, sélectionnez l'interface réseau qui est connectée à votre commutateur FCoE. Notez que cette interface réseau doit être configurée et connectée – voir la <xref linkend="sect-installation-gui-network-configuration" />.

source: Below the <guilabel>NIC</guilabel> drop-down menu are two choices:
fr: Sous le menu déroulant <guilabel>NIC</guilabel> il y a deux options :

source: <guilabel>Use DCB</guilabel>
fr: <guilabel>Utiliser DCB</guilabel>

source: <firstterm>Data Center Bridging</firstterm> (DCB) is a set of enhancements to the Ethernet protocols designed to increase the efficiency of Ethernet connections in storage networks and clusters. This option should only be enabled for network interfaces that require a host-based DCBX client. Configurations on interfaces that implement a hardware DCBX client should leave this check box empty.
fr: <firstterm>Data Center Bridging</firstterm> (DCB) est un jeu d'améliorations du protocole Ethernet conçu pour améliorer l'efficacité des connexions Ethernet dans les réseaux de stockage et les grappes de serveurs (clusters). Cette option ne doit être activée que pour les interfaces réseau qui requièrent un client basé sur un hôte DCBX. La configuration sur des interfaces qui mettent en œuvre un matériel DCBX doit laisser cette option désactivée.

source: <guilabel>Use auto vlan</guilabel>
fr: <guilabel>Utiliser auto vlan</guilabel>

source: This option indicates whether VLAN discovery should be performed. If this box is checked, then the <firstterm>FCoE Initiation Protocol</firstterm> (FIP) VLAN discovery protocol will run on the Ethernet interface once the link configuration has been validated. If they are not already configured, network interfaces for any discovered FCoE VLANs will be automatically created and FCoE instances will be created on the VLAN interfaces. This option is enabled by default.
fr: Cette option précise si la découverte VLAN doit être lancée. Si cette option est activée, alors le protocole de découverte VLAN <firstterm>FCoE Initiation Protocol</firstterm> (FIP) s'exécute sur l'interface Ethernet une fois que la configuration du lien a été validée. Si elles ne sont pas déjà configurées, les interfaces réseau pour n'importe quel VLAN FCoE découvert sont automatiquement créées et des instances FCoE sont créées sur ces interfaces VLAN. Cette option est activée par défaut.

source: After you select which interface and options to use, click <guilabel>Add FCoE Disk(s)</guilabel>. Discovered FCoE storage devices will be displayed under the <guilabel>Other SAN Devices</guilabel> tab in <xref linkend="sect-installation-gui-installation-destination" />.
fr: Après que vous avez sélectionné quelle interface et quelles options utiliser, cliquez sur le bouton <guilabel>Ajouter un ou des disques FCoE</guilabel>. Les périphériques de stockage FCoE découverts sont affichés sur l'onglet <guilabel>Autres périphériques SAN</guilabel> dans l'écran objet de la <xref linkend="sect-installation-gui-installation-destination" />.
