Repository: jaaf/po_purifier
Catalog: testing_data/Introduction.po
Languages: fr

source: This guide covers installation of Fedora, a Linux distribution built on free and open source software. This manual helps you install Fedora on desktops, laptops, and servers. The installation system is easy to use even if you lack previous knowledge of Linux or computer networks. If you select default options, Fedora provides a complete desktop operating system, including productivity applications, Internet utilities, and desktop tools.
fr: Ce guide porte sur l'installation de Fedora, une distribution Linux construite sur des logiciels libres et « open source ». Ce manuel vous aidera à installer Fedora sur des ordinateurs de bureau, des ordinateurs portables et des serveurs. Le système d'installation est facile à utiliser même si vous avez des lacunes à propos de Linux ou des réseaux d'ordinateurs. Si vous prenez les options par défaut, Fedora met à votre disposition un système d'exploitation complet avec des applications de production, utilitaires Internet et outils de bureautique.

source: This document details the full range of installation options, including those that apply only in limited or unusual circumstances. Understanding of all topics described in this document is not necessary to successfully perform the installation in most cases.
fr: Ce document détaille toutes les options d'installation, y compris celles qui ne s'appliquent que dans des circonstances particulières et limitées. La compréhension de tous les sujets abordés dans ce document n'est pas un nécessité pour réussir l'installation dans la plupart des cas.

source: Background
fr: Contexte

source: About Fedora
fr: À propos de Fedora

source: To find out more about &PRODUCT;, visit the <ulink url="http://fedoraproject.org/">&PRODUCT; Project Website</ulink>. Other documentation describing additional topics related to &PRODUCT; is available at <ulink url="http://docs.fedoraproject.org/">&PRODUCT; Documentation</ulink>. Also see the <ulink url="https://fedoraproject.org/wiki/Fedora_Project_Wiki">&PRODUCT; Project Wiki</ulink>.
fr: Pour en savoir plus sur &PRODUCT;, visitez le <ulink url="http://fedoraproject.org/"> Site Web du Projet &PRODUCT;</ulink>. Le site <ulink url="http://docs.fedoraproject.org/">Documentation de &PRODUCT; </ulink> propose une documentation complémentaire sur des sujets relatifs à &PRODUCT;. Visitez également le <ulink url="https://fedoraproject.org/wiki/Fedora_Project_Wiki">Wiki du Projet &PRODUCT; </ulink>.

source: Getting Additional Help
fr: Obtention d'une aide supplémentaire

source: If you encounter any problems which are not described in documentation, you might get help from members of the community - developers, users, and others. There are many ways to get help: the Ask Fedora website, mailing lists, forums, or IRC. For a summary of available resources, see the <ulink url="https://fedoraproject.org/wiki/Communicating_and_getting_help">Communicating and Getting Help</ulink> page on the &PRODUCT; wiki.
fr: Si vous rencontrez des problèmes dont la solution n'est pas fournie par la documentation, vous pouvez solliciter l'aide de la communauté – développeurs, utilisateurs et autres. Il y a plusieurs moyens d'obtenir cette aide : le site « Ask Fedora » (demandez à Fedora), les listes de diffusion, les forums ou les canaux IRC. Pour un résumé des ressources disponibles, visitez la page <ulink url="https://fedoraproject.org/wiki/Communicating_and_getting_help">Communicating and Getting Help</ulink> (Communiquer et obtenir de l'aide) sur le wiki de &PRODUCT;.

source: About This Document
fr: À propos de ce document

source: Goals
fr: Objectifs

source: This guide helps a reader:
fr: Ce guide aide un lecteur à :

source: Understand how to locate the &PRODUCT; distribution online
fr: trouver la distribution &PRODUCT; sur le Web ;

source: Create configuration data that allows a computer to boot &PRODUCT;
fr: configurer les données qui permettent à un ordinateur de démarrer &PRODUCT; ;

source: Understand and interact with the &PRODUCT; installation program
fr: savoir comment interagir avec le programme d'installation de &PRODUCT; ;

source: Complete basic post-installation configuration of a &PRODUCT; system
fr: configurer son système après l'installation de &PRODUCT;.

source: This guide does not cover <emphasis>use</emphasis> of &PRODUCT;. To learn how to use an installed &PRODUCT; system, see the other manuals available at <ulink url="http://docs.fedoraproject.org/">Fedora Documentation</ulink>.
fr: Ce guide n'aborde pas l'<emphasis>utilisation</emphasis> de &PRODUCT;. Pour apprendre à utiliser un système &PRODUCT; installé, reportez-vous aux autres manuels disponibles dans la <ulink url="http://docs.fedoraproject.org/">documentation de Fedora </ulink>.

source: Target Audience
fr: Public visé

source: This guide is intended for &PRODUCT; users of all levels of experience. However, it describes the installation process and its many options in far greater detail than most users are likely to require. You do not need to read and understand this entire document to install &PRODUCT; on a computer. This document is most likely to help experienced users perform advanced and unusual installations.
fr: Ce guide s'adresse aux utilisateurs de &PRODUCT; de tout niveau. Cependant, il décrit le processus d'installation et ses nombreuses options dans un niveau de détails qui dépasse les attentes de la plupart des utilisateurs. Vous n'avez pas besoin de lire et de comprendre l'intégralité de ce document pour installer &PRODUCT; sur votre ordinateur. Ce document est probablement plus susceptible d'aider les utilisateurs expérimentés à réussir des installations avancées et inhabituelles.
