Repository: jaaf/po_purifier
Catalog: testing_data/KeyboardSpoke.po
Languages: fr

source: Keyboard Layout
fr: Agencements de clavier

source: The <guilabel>Keyboard Layout</guilabel> screen allows you to set up one or more keyboard layouts for your system and a way to switch between them. One keyboard layout is configured automatically based on your selection in <xref linkend="sect-installation-gui-welcome" />, but you can change this layout and add additional ones before you begin the installation.
fr: L'écran <guilabel>Agencement de clavier</guilabel> vous permet de configurer un ou plusieurs agencements de clavier pour votre système et la manière de passer de l'un à l'autre. Un agencement de clavier est configuré automatiquement en se basant sur la sélection que vous faites sur l'écran d'accueil intitulé « Bienvenue sur Fedora 23 » et décrit à la <xref linkend="sect-installation-gui-welcome" />. Vous pouvez cependant changer cet agencement et en ajouter d'autres avant que l'installation ne commence.

source: Keyboard layouts are a separate setting from system languages, and these two settings can be mixed as you see fit.
fr: Les agencements de clavier sont définis séparément des langues du système et ces deux éléments peuvent être combinés de diverses manières selon vos besoins spécifiques.

source: All settings configured in this screen will be available on the installed system, and they will also become immediately available inside the installer. You can use the keyboard icon in the top right corner of any screen, or the keyboard switch you configured in this screen, to cycle between your configured layouts.
fr: Tous les réglages définis dans cet écran restent valables sur le système après installation et sont valables immédiatement dans l'installateur. Vous pouvez vous servir de l'icône du clavier dans le coin supérieur droit des différents écrans, ou du raccourci clavier que vous avez défini dans cet écran, pour passer d'un des arrangements retenus à l'autre.

source: The left half of the screen contains a window listing all currently configured layouts. The order in which the layouts are displayed is important - the same order will be used when switching between layouts, and the first listed layout will be the default on your system.
fr: La partie inférieure gauche de l'écran contient une liste de tous les agencements de clavier disponibles. L'ordre dans lequel ces agencements sont affichés est important. – c'est cet ordre qui sera utilisé lorsque vous chercherez à en sélectionner un par la suite. Le premier agencement sera l'agencement par défaut de votre système.

source: The text field on the right side of the screen can be used to test the currently selected layout.
fr: Le champ de texte à droite de l'écran peut être utilisé pour tester l'agencement sélectionné.

source: You can click a layout in the list to highlight it. At the bottom of the list, there is a set of buttons:
fr: Vous pouvez cliquer sur un nom d'agencement pour le sélectionner. En bas de la liste, il y a une série de boutons :

source: The <guilabel>+</guilabel> button adds a new layout. When you press this button, a new window opens with a list of all available layouts, grouped by language. You can find a layout by browsing the list, or you can use the search bar at the bottom of this window. When you find the layout you want to add, highlight it and press <guilabel>Add</guilabel>.
fr: Le bouton <guilabel>+</guilabel> sert à ajouter un nouvel agencement. Quand vous cliquez sur ce bouton, une nouvelle fenêtre contenant la liste des agencements disponibles s'affiche. Les agencements sont groupés par langue. Vous pouvez rechercher un agencement en faisant défiler la liste ou en utilisant la barre de recherche en bas de la fenêtre. Dès que vous avez trouvé votre agencement, sélectionnez le par un clic et cliquez sur le bouton <guilabel>+</guilabel>.

source: The <guilabel>-</guilabel> button removes the currently highlighted layout.
fr: Le bouton <guilabel>-</guilabel> sert à retirer l'agencement sélectionné dans votre liste d'agencements déjà retenus.

source: The up and down buttons can be used to move the highlighted layout up or down in the list.
fr: Les boutons portant les flèches vers le haut et vers le bas permettent de déplacer l'agencement sélectionné dans votre liste d'agencements déjà retenus, respectivement, vers le haut et vers le bas.

source: The keyboard button opens a new window which offers a visual representation of the highlighted layout.
fr: Le bouton portant l'icône d'un clavier sert à afficher le dessin de l'agencement de clavier sélectionné dans votre liste d'agencements déjà retenus.

source: If you use a layout that cannot accept Latin characters, such as <guilabel>Russian</guilabel>, you are advised to also add the <guilabel>English (United States)</guilabel> layout and configure a keyboard combination to switch between the two layouts. If you only select a layout without Latin characters, you may be unable to enter a valid <systemitem class="username">root</systemitem> password and user credentials later in the installation process. This may prevent you from completing the installation.
fr: Si vous utilisez un agencement qui n'utilise pas les caractères latins tel que <guilabel>Russian</guilabel>, on vous conseille d'ajouter également l'agencement <guilabel>English (United States)</guilabel> et de configurer un raccourci clavier pour passer d'un agencement à l'autre. Si vous sélectionnez seulement un clavier qui n'utilise pas les caractères latins, vous ne serez pas en mesure de saisir un mot de passe <systemitem class="username">root</systemitem> valide, pas plus que les identifiants utilisateur, par la suite durant l'installation. Cela peut vous empêcher de terminer l'installation.

source: You can also optionally configure a keyboard switch which can be used to cycle between available layouts. To do so, click the <guilabel>Options</guilabel> button on the right side of the screen. The <guilabel>Layout Switching Options</guilabel> dialog will open, allowing you to configure one or more keys or key combinations for switching. Select one or more key combinations using the check boxes next to them, and click <guilabel>OK</guilabel> to confirm your selection.
fr: Vous pouvez également, mais cela est facultatif, configurer un raccourci clavier pour passer d'un arrangement à l'autre. Pour le faire, cliquez sur le bouton <guilabel>Options</guilabel> sur la partie droite de l'écran. La fenêtre de dialogue <guilabel>Options de basculement du clavier</guilabel> s'affiche et vous permet de configurer un ou plusieurs raccourcis clavier pour ce basculement. Sélectionnez une ou plusieurs combinaisons de touches en utilisant les boîtes à cocher à coté d'elles et cliquez sur le bouton <guilabel>OK</guilabel> pour confirmer vos choix.

source: After you finish configuring keyboard layouts and switches, click <guilabel>Done</guilabel> in the top left corner to return to <xref linkend="sect-installation-gui-installation-summary" />.
fr: Après que vous en avez fini avec la configuration des agencements de clavier et des raccourcis de basculement, cliquez sur le bouton <guilabel>Fait</guilabel> en haut à gauche de l'écran pour revenir au résumé de l'installation décrit à la <xref linkend="sect-installation-gui-installation-summary" />.
