Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: You can specify packages by <firstterm>environment</firstterm>, <firstterm>group</firstterm>, or by their package names. Several environments and groups that contain related packages are defined. See the <filename>repodata/comps.xml</filename> file in your installation source for environment and group definitions.
fr: Vous pouvez spécifier les paquets par <firstterm>environment</firstterm>, <firstterm>groupe</firstterm> ou par leur nom. Plusieurs environnements et groupes qui contiennent des paquets qui leur sont relatifs sont définis. Voir le fichier <filename>repodata/comps.xml</filename> dans votre source d'installation pour la définition des environnements et des groupes.

source: The <filename>comps.xml</filename> file contains a structure describing available environments (marked by the <literal>&lt;environment&gt;</literal> tag) and groups (the <literal>&lt;group&gt;</literal> tag). Each entry has an ID, user visibility value, name, description, and package list. If the group is selected for installation, the packages marked <literal>mandatory</literal> in the package list are always installed, the packages marked <literal>default</literal> are installed if they are not specifically excluded, and the packages marked <literal>optional</literal> must be specifically included even when the group is selected.
fr: Le fichier <filename>comps.xml</filename> contient une structure qui décrit les environnements disponibles (marqués par la balise <literal>&lt;environment&gt;</literal>) et les groupes (marqués par la balise <literal>&lt;group&gt;</literal>). Chacune des entrées possède un identifiant (ID), une valeur de visibilité par l'utilisateur, un nom, une description et une liste de paquets. Si le groupe est sélectionné pour installation, les paquets marqués <literal>mandatory</literal> (obligatoires) dans la liste des paquets sont toujours installés. Les paquets marqués <literal>default</literal> (par défaut) sont installés s'ils ne sont pas explicitement exclus. Les paquets marqués <literal>optional</literal> (facultatifs) doivent être spécifiés explicitement lorsque le groupe est sélectionné.

source: You can specify a package group or environment using either its ID (the <literal>&lt;id&gt;</literal> tag) or name (the <literal>&lt;name&gt;</literal> tag).
fr: Vous pouvez spécifier un groupe de paquets ou un environnement en utilisant, soit son identifiant (ID) (balise <literal>&lt;id&gt;</literal>), soit son nom (balise <literal>&lt;name&gt;</literal> ).

source: To install a 32-bit package on a 64-bit system, you will need to append the package name with the 32-bit architecture for which the package was built - for example, <package>glibc.i686</package>. The <option>--multilib</option> option also must be specified in the Kickstart file; see the available options below.
fr: Pour installer un paquet 32 bits sur un système 64 bits, vous devez ajouter à la fin du nom du paquet le nom de l'architecture 32 bits pour laquelle il a été compilé – par exemple <package>glibc.i686</package>. L'option <option>--multilib</option> doit également être spécifiée dans le fichier Kickstart; voir les options disponibles ci-après :

source: <application>Initial Setup</application> does not run after a system is installed from a Kickstart file unless a desktop environment and the <application>X Window System</application> were included in the installation and graphical login was enabled. This means that by default, no users except for <systemitem class="username">root</systemitem> will be created. You can either create a user with the <option>user</option> option in the Kickstart file before installing additional systems from it (see <xref linkend="sect-kickstart-commands-user" /> for details) or log into the installed system with a virtual console as <systemitem class="username">root</systemitem> and add users with the <command>useradd</command> command.
fr: La <application>configuration initiale </application> n'est pas lancée après qu'un système est installé depuis un fichier Kickstart sauf si un environnement de bureau et le système <application>X Window </application> sont inclus dans l'installation et que l'écran de connexion graphique a été activé. Cela signifie que, par défaut, aucun utilisateur sauf <systemitem class="username">root</systemitem> n'est créé. Vous pouvez, soit créer un utilisateur avec l'option <option>user</option> dans le fichier Kickstart avant d'installer des systèmes additionnels avec lui (voir la <xref linkend="sect-kickstart-commands-user" /> pour les détails), soit vous connecter au système installé à partir d'une console virtuelle en tant que <systemitem class="username">root</systemitem> et ajouter des utilisateurs avec la commande <command>useradd</command>.

source: Specifying Environments, Groups and Packages
fr: Spécification des environnements, des groupes et des paquets

source: Specifying an Environment
fr: Spécification d'un environnement

source: In addition to groups, you specify an entire environment to be installed:
fr: En plus des groupes, vous pouvez spécifier un environnement tout entier à installer :

source: This command will install all packages which are part of the <guilabel>Infrastracture Server</guilabel> environment. All available environments are described in the <filename>comps.xml</filename> file.
fr: Cette commande installe tous les paquets qui font partie de l'environnement <guilabel>Infrastracture Server</guilabel>. Tous les environnements disponibles sont décrits dans le fichier <filename>comps.xml</filename>.

source: Specifying Groups
fr: Spécification de groupes

source: Specify groups, one entry to a line, starting with an <literal>@</literal> symbol, and then the full group name or group id as given in the <filename>comps.xml</filename> file. For example:
fr: Spécifiez les groupes, une entrée par ligne, en commençant par le caractère <literal>@</literal>, suivi du nom complet du groupe ou de l'identifiant du groupe tel que donné dans le fichier <filename>comps.xml</filename>. Par exemple :

source: The <literal>Core</literal> and <literal>Base</literal> groups are always selected - it is not necessary to specify them in the <command>%packages</command> section.
fr: Les groupes <literal>Core</literal> et <literal>Base</literal> sont toujours sélectionnés - il n'est pas nécessaire de les spécifier dans la section <command>%packages</command>.

source: The <filename>comps.xml</filename> file also defines groups called <literal>Conflicts (<replaceable>variant</replaceable>)</literal> for each variant of &PRODUCT;. This group contains all packages which are known to cause file conflicts, and is intended to be excluded.
fr: Le fichier <filename>comps.xml</filename> définit également un groupe appelé <literal>Conflicts (<replaceable>variante</replaceable>)</literal> pour chacune des variantes de &PRODUCT;. Ce groupe contient tous les paquets qui sont connus comme créant des conflits de fichiers et son exclusion est prévue.

source: Specifying Individual Packages
fr: Spécification de paquets individuels

source: Specify individual packages by name, one entry to a line. You can use the asterisk character (<literal>*</literal>) as a <firstterm>wildcard</firstterm> in package names. For example:
fr: Spécifiez les paquets individuels par leur nom, une entrée par ligne. Vous pouvez utiliser le caractère astérisque (<literal>*</literal>) en tant que <firstterm>wildcard</firstterm> (générique ou jocker) dans les noms de paquets. Par exemple :

source: The <literal>docbook*</literal> entry includes the packages <package>docbook-dtds</package>, <package>docbook-simple</package>, <package>docbook-slides</package> and others that match the pattern represented with the wildcard.
fr: L'entrée <literal>docbook*</literal> comprend les paquets <package>docbook-dtds</package>, <package>docbook-simple</package>, <package>docbook-slides</package> et tous ceux dont le nom correspond au modèle générique.

source: Excluding Environments, Groups, or Packages
fr: Exclusion d'environnements, de groupes ou de paquets

source: Use a leading dash (<literal>-</literal>) to specify packages or groups to exclude from the installation. For example:
fr: Utilisez le tiret court, aussi appelé trait-d'union (<literal>-</literal>), en préfixe pour spécifier les paquets ou les groupes à exclure de l'installation. Par exemple :

source: Installing all available packages using only <literal>*</literal> in a Kickstart file is not supported, even if you exclude the <literal>@Conflicts (<replaceable>variant</replaceable>)</literal> group.
fr: Installer tous les paquets disponibles en n'utilisant que le caractère générique <literal>*</literal> dans un fichier Kickstart n'est pas pris en charge, même si vous excluez le groupe <literal>@Conflicts (<replaceable>variante</replaceable>)</literal>.

source: You can change the default behavior of the <command>%packages</command> section by using several options. Some options work for the entire package selection, others are used with only specific groups.
fr: Vous pouvez changer le comportement par défaut de la section <command>%packages</command> en utilisant plusieurs options. Quelques options fonctionnent pour la sélection de paquets toute entière, d'autres ne sont utilisées que pour des groupes spécifiques.

source: Common Package Selection Options
fr: Options de sélection de paquets courants

source: The following options are available for the <command>%packages</command>. To use an option, append it to the start of the package selection section. For example:
fr: Les options suivantes sont disponibles pour la section <command>%packages</command>. Pour utiliser une option, ajoutez la au début de la section de sélection de paquets. Par exemple :

source: Do not install the <literal>@Core</literal> group.
fr: N'installe pas le groupe <literal>@Core</literal>.

source: Ignore any packages, groups and environments missing in the installation source, instead of halting the installation to ask if the installation should be aborted or continued.
fr: Ignore les paquets, les groupes et les environnements manquants dans la source d'installation, plutôt que d'arrêter l'installation pour demander si l'installation doit être poursuivie ou abandonnée.

source: Do not install any documentation contained within packages. In most cases, this will exclude any files normally installed in the <filename class="directory">/usr/share/doc*</filename> directory, but the specific files to be excluded depend on individual packages.
fr: N'installe aucune documentation contenue dans un paquet. Dans la plupart des cas, cela exclut tout fichier normalement installé dans le dossier <filename class="directory">/usr/share/doc*</filename>, mais les fichiers spécifiques à exclure dépendent des paquets individuels eux-mêmes.

source: Configure the installed system for multilib packages (that is, to allow installing 32-bit packages on a 64-bit system) and install packages specified in this section as such.
fr: Configure le système installé pour les paquets multilib (c'est à dire, pour autoriser les paquets 32 bits sur un système 64 bits) et installe les paquets spécifiés dans cette section comme tels.

source: Normally, on a 64-bit system, only packages for this architecture (marked as <literal>x86_64</literal>) and packages for all architectures (marked as <literal>noarch</literal>) would be installed. When you use this option, packages for 32-bit systems (marked as <literal>i686</literal>) will be automatically installed as well, if available.
fr: Normalement, sur un sytème 64 bits, seuls les paquets pour cette architecture (marqués <literal>x86_64</literal>) et les paquets valables pour toutes les architectures (marqués <literal>noarch</literal>) sont installés. Si vous utilisez cette option, les paquets destinés aux systèmes 32 bits (marqués <literal>i686</literal>) sont, eux aussi, automatiquement installés s'ils sont disponibles.

source: This only applies to packages explicitly specified in the <command>%packages</command> section. Packages which are only being installed as dependencies without being specified in the Kickstart file will only be installed in architecture versions in which they are needed, even if they are available for more architectures.
fr: Cela ne s'applique qu'aux paquets spécifiés explicitement dans la section <command>%packages</command>. Les paquets qui sont installés seulement en tant que dépendance sans être spécifiés dans le fichier Kickstart ne sont installés que dans les versions d'architecture dans lesquelles ils sont nécessaires, même s'ils sont disponibles pour plus d'architectures.

source: Options for Specific Package Groups
fr: Options spécifiques à un groupe de paquets

source: The options in this list only apply to a single package group. Instead of using them at the <command>%packages</command> command in the Kickstart file, append them to the group name. For example:
fr: Les options de cette liste ne s'appliquent qu'à un groupe de paquets unique. Au lieu de les utiliser dans la section <command>%packages</command> du fichier Kickstart, ajoutez les au nom du groupe. Par exemple :

source: Only install the group's mandatory packages, not the default selections.
fr: N'installe que les paquets obligatoires du groupe, pas la sélection par défaut.

source: Install packages marked as optional in the group definition in the <filename>comps.xml</filename> file, in addition to installing the default selections.
fr: Installe les paquets marqués « optional » (facultatifs) dans la définition du groupe dans le fichier <filename>comps.xml</filename>, en plus de ceux sélectionnés par défaut.

source: Note that some package groups, such as <literal>Scientific Support</literal>, do not have any mandatory or default packages specified - only optional packages. In this case the <option>--optional</option> option must always be used, otherwise no packages from this group will be installed.
fr: Notez que quelques groupes de paquets, comme <literal>Scientific Support</literal>, n'ont aucun paquet obligatoire ou par défaut spécifié – seulement des paquets facultatifs. Dans ce cas, l'option <option>--optional</option> doit toujours être utilisée autrement aucun paquet de ce groupe n'est installé.

source: %pre (optional) - Pre-installation Script
fr: %pre (facultative) - Script pré-installation

source: You can add commands to run on the system immediately after the Kickstart file has been parsed, but before the installation begins. This section must be placed towards the end of the Kickstart file, after the actual Kickstart commands, and must start with <command>%pre</command> and end with <command>%end</command>. If your Kickstart file also includes a <command>%post</command> section, the order in which the <command>%pre</command> and <command>%post</command> sections are included does not matter.
fr: Vous pouvez ajouter des commandes qui seront exécutées après l'analyse du fichier Kickstart, mais avant que l'installation ne débute. Cette section doit être placée vers la fin du fichier Kickstart, après les commandes Kickstart réelles, doit commencer avec <command>%pre</command> et doit se terminer par <command>%end</command>. Si votre fichier Kickstart inclut aussi une section <command>%post</command>, l'ordre dans lequel les sections <command>%pre</command> et <command>%post</command> sont incluses importe peu.

source: You can access the network in the <command>%pre</command> section. However, the <firstterm>name service</firstterm> has not been configured at this point, so only IP addresses work, not URLs.
fr: Vous pouvez accéder au réseau dans la section <command>%pre</command>. Cependant, le <firstterm>service de noms</firstterm> n'a pas encore été configuré à ce stade, c'est pourquoi seules les adresses IP fonctionnent, pas les URLs.

source: The pre-installation script section of Kickstart <emphasis>cannot</emphasis> manage multiple install trees or source media. This information must be included for each created Kickstart file, as the pre-installation script occurs during the second stage of the installation process.
fr: La section des scripts de pré-installation de Kickstart <emphasis>ne peut pas </emphasis> gérer des arbres d'installation ou des médias source multiples. Cette information doit être incluse pour chaque fichier Kickstart créé, car le script de pré-installation est exécuté durant la deuxième étape du processus d'installation.

source: Unlike the post-installation script, the pre-installation script is not run in the <systemitem>chroot</systemitem> environment.
fr: Contrairement au script de post-installation, le script de pré-installation n'est pas exécuté dans l'environnement <systemitem>chroot</systemitem>.

source: The following options can be used to change the behavior of pre-installation scripts. To use an option, append it to the <command>%pre</command> line at the beginning of the script. For example:
fr: Les options suivantes peuvent être utilisées pour changer le comportement des scripts de pré-installation. Pour utiliser une option, ajoutez-la à la ligne <command>%pre</command> au début du script. Par exemple :

source: Allows you to specify a different scripting language, such as Python. Any scripting language available on the system can be used; in most cases, these will be <systemitem>/usr/bin/sh</systemitem>, <systemitem>/usr/bin/bash</systemitem>, and <systemitem>/usr/bin/python</systemitem>.
fr: Vous permet de spécifier un langage de script tel que Python. N'importe quel langage de script disponible sur le système peut être utilisé ; dans la plupart des cas, il s'agit de <systemitem>/usr/bin/sh</systemitem>, <systemitem>/usr/bin/bash</systemitem> et <systemitem>/usr/bin/python</systemitem>.

source: Display an error and halt the installation if the script fails. The error message will direct you to where the cause of the failure is logged.
fr: Affiche une erreur et arrête l'installation si le script échoue. Ce message d'erreur vous dirige sur l'endroit dans le journal où la cause de l'échec est expliquée.

source: Logs the script's output into the specified log file. For example:
fr: Enregistre la sortie du script dans le journal spécifié. Par exemple :

source: For an example of a pre-installation script, see <xref linkend="sect-kickstart-example-pre-script" />.
fr: Pour un exemple de script de pré-installation, voir la <xref linkend="sect-kickstart-example-pre-script" />.

source: %post (optional) - Post-installation Script
fr: %post (optional) - Script de post-installation

source: You have the option of adding commands to run on the system once the installation is complete, but before the system is rebooted for the first time. This section must be placed towards the end of the Kickstart file, after the actual Kickstart commands, and must start with <command>%post</command> and end with <command>%end</command>. If your Kickstart file also includes a <command>%pre</command> section, the order of the <command>%pre</command> and <command>%post</command> sections does not matter.
fr: Vous avez la possibilité d'ajouter des commandes à exécuter sur le système une fois l'installation terminée avant que le système ne démarre pour la première fois. Cette section doit être placée vers la fin du fichier Kickstart, après les commandes Kickstart réelles, doit commencer par <command>%post</command> et doit se terminer par <command>%end</command>. Si votre fichier Kickstart inclut aussi une section <command>%pre</command>, l'ordre dans lequel les sections <command>%pre</command> et <command>%post</command> sont placées importe peu.

source: This section is useful for functions such as installing additional software or configuring an additional name server. The post-install script is run in a chroot environment, therefore, performing tasks such as copying scripts or RPM packages from the installation media do not work by default. You can change this behavior using the <option>--nochroot</option> option as described below.
fr: Cette section est utile pour des fonctions telles que l'installation d'un logiciel additionnel ou la configuration d'un serveur de noms additionnel. Le script post-installation est exécuté dans un environnement chroot, en conséquence, l'exécution de tâches telles que la copie de scripts ou de paquets RPM depuis le média d'installation ne fonctionne pas par défaut. Vous pouvez changer ce comportement en utilisant l'option <option>--nochroot</option> comme cela est expliqué ci-dessous.

source: If you configured the network with static IP information, including a name server, you can access the network and resolve IP addresses in the <command>%post</command> section. If you configured the network for <systemitem>DHCP</systemitem>, the <filename>/etc/resolv.conf</filename> file has not been completed when the installation executes the <command>%post</command> section. You can access the network, but you cannot resolve IP addresses. Thus, if you are using <systemitem>DHCP</systemitem>, you must specify IP addresses in the <command>%post</command> section.
fr: Si vous avez configuré le réseau avec des adresses IP statiques, y compris un serveur de nom, vous pouvez accéder au réseau et résoudre les adresses IP dans la section <command>%post</command>. Si vous avez configuré le réseau pour <systemitem>DHCP</systemitem>, le fichier <filename>/etc/resolv.conf</filename> n'a pas été terminé lorsque l'installation exécute la section <command>%post</command>. Vous pouvez accéder au réseau mais vous ne pouvez pas résoudre les adresses IP. Par conséquent, si vous utilisez <systemitem>DHCP</systemitem>, vous devez spécifier les adresses IP dans la section <command>%post</command>.

source: The following options can be used to change the behavior of post-installation scripts. To use an option, append it to the <command>%post</command> line at the beginning of the script. For example:
fr: Les options suivantes peuvent être utilisées pour changer le comportement des scripts post-installation. Pour utiliser une option, ajoutez-la dans la ligne <command>%post</command> au début du script. Par exemple :

source: Allows you to specify a different scripting language, such as Python. For example:
fr: Vous permet de spécifier un langage de script différent comme Python. Par exemple :

source: Any scripting language available on the system can be used; in most cases, these will be <systemitem>/usr/bin/sh</systemitem>, <systemitem>/usr/bin/bash</systemitem>, and <systemitem>/usr/bin/python</systemitem>.
fr: N'importe quel langage de script disponible sur le système peut être utilisé ; dans la plupart des cas, il s'agit de <systemitem>/usr/bin/sh</systemitem>, <systemitem>/usr/bin/bash</systemitem> et <systemitem>/usr/bin/python</systemitem>.

source: Allows you to specify commands that you would like to run outside of the chroot environment.
fr: Vous permet de définir des commandes à exécuter en dehors de l'environnement « chroot ».

source: The following example copies the file <filename>/etc/resolv.conf</filename> to the file system that was just installed.
fr: L'exemple suivant copie le fichier <filename>/etc/resolv.conf</filename> dans le système de fichiers qui vient d'être installé.

source: Logs the script's output into the specified log file. Note that the path of the log file must take into account whether or not you use the <option>--nochroot</option> option. For example, without <option>--nochroot</option>:
fr: Copie la sortie du script dans le journal spécifié. Notez que le chemin vers le journal doit prendre en compte le fait que vous utilisez ou pas l'option <option>--nochroot</option>. Par exemple, sans l'option <option>--nochroot</option> :

source: with <option>--nochroot</option>:
fr: avec <option>--nochroot</option>:
