Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: Kickstart Syntax Reference
fr: Référence sur la syntaxe de Kickstart

source: This appendix describes commands and options available in Kickstart installations. For general information about Kickstart, see <xref linkend="chap-kickstart-installations" />.
fr: Cet annexe décrit les commandes et options disponibles pour les installations Kickstart. Pour une information générale sur Kickstart, reportez-vous au <xref linkend="chap-kickstart-installations" />.

source: Device names are not guaranteed to be consistent across reboots, which can complicate usage in Kickstart scripts. When a Kickstart option calls for a device node name (such as <literal>sda</literal>), you can instead use any item from <filename>/dev/disk</filename>. For example, instead of:
fr: Il n'y a aucune garantie que les noms de périphériques restent cohérents au fil des redémarrages, ce qui peut compliquer leur utilisation dans les scripts Kickstart. Lorsqu'une option Kickstart requiert un nom de nœud (comme <literal>sda</literal>), vous pouvez utiliser n'importe quel objet de <filename>/dev/disk</filename> à la place. Par exemple, au lieu de :

source: You could use an entry similar to one of the following:
fr: vous pouvez utiliser une entrée qui ressemble à une des entrées qui suivent :

source: This provides a consistent way to refer to disks that is more meaningful than just <literal>sda</literal>. This is especially useful in large storage environments.
fr: Cela procure une manière plus cohérente de faire référence à un disque et qui est plus riche de sens que simplement <literal>sda</literal>. Cela s'avère particulièrement utile dans les environnements à grande capacité de stockage.

source: While the general principles of Kickstart installations tend to stay the same, the commands and options can change between major releases. You can use the <command>ksverdiff</command> command to display the differences between two versions of the Kickstart syntax. This is useful when updating an existing Kickstart file to be used with a new release. To display a list of changes in syntax between Fedora&nbsp;&PREVVER; and &PRODVER;, use the following command:
fr: Bien que les principes généraux des installations Kickstart tendent à rester les mêmes, les commandes et options peuvent varier avec les versions majeures. Vous pouvez utiliser la commande <command>ksverdiff</command> pour afficher les différences entre deux versions de la syntaxe de Kickstart. Cela est utile lors de la mise à jour d'un fichier Kickstart existant pour l'utiliser dans une nouvelle version. Pour afficher une liste des changements entre Fedora &PREVVER; et &PRODVER;, utilisez la commande suivante :

source: The <option>-f</option> option specifies the release to start the comparison with, and the <option>-t</option> option to specify the release to end with. For additional information, see the <systemitem>ksverdiff(1)</systemitem> man page. Also note that you can not use this to display changes in a release that is newer than your system - the version of <package>pykickstart</package> on Fedora&nbsp;&PREVVER; can not display changes in Fedora&nbsp;&PRODVER;.
fr: L'option <option>-f</option> indique la version à partir de laquelle la comparaison commence tandis que l'option <option>-t</option> indique à quelle version elle se termine. Pour plus d'informations, lisez la page de manuel <systemitem>ksverdiff(1)</systemitem>. Notez également que vous ne pouvez pas utiliser cette commande pour afficher les changements que procure une version postérieure à celle de votre système – la version de <package>pykickstart</package> de Fedora&nbsp;&PREVVER; ne peut afficher les changements apportés dans Fedora&nbsp;&PRODVER;.

source: Additionally, you can review the <citetitle>Fedora&nbsp;&PRODVER; Release Notes</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />, for a list of changes.
fr: De plus, vous pouvez parcourir les <citetitle>Notes de version Fedora&nbsp;&PRODVER;</citetitle>, disponibles à <ulink url="http://docs.fedoraproject.org/" />, pour connaître la liste des changements.

source: In the following sections, if an option is followed by an equals mark (<literal>=</literal>), a value must be specified after it. In the example commands, options in square brackets (<literal>[ ]</literal>) are optional arguments for the command.
fr: Dans les sections qui suivent, si une option est suivie du signe égal (<literal>=</literal>), une valeur doit être spécifiée à sa suite. Dans les exemples de commande, les options entre crochets (<literal>[ ]</literal>) sont facultatives.

source: Installation Methods and Sources
fr: Méthodes et sources d'installation

source: The following commands control the way Fedora will be installed.
fr: Les commandes suivantes contrôlent la manière dont Fedora est installé.

source: device (optional) - Install Extra Device Drivers
fr: device (facultative) - Installation de pilotes de périphériques supplémentaires

source: On most PCI systems, the installation program will automatically detect Ethernet and SCSI cards. However, on older systems and some PCI systems, Kickstart requires a hint to find the proper devices. The <command>device</command> command, which tells the installation program to install extra modules, uses the following format:
fr: Sur la plupart des systèmes, l'installateur détecte automatiquement les cartes Ethernet et SCSI. Néanmoins, sur les systèmes plus anciens et sur quelques systèmes PCI, Kickstart a besoin d'un indice pour trouver les périphériques appropriés. La commande <command>device</command>, qui demande à l'installateur d'installer des modules complémentaires, utilise le format suivant :

source: <command>device <replaceable>moduleName</replaceable> [--opts=]</command>
fr: <command>device <replaceable>nom_du_module</replaceable> [--opts=]</command>

source: Replace <replaceable>moduleName</replaceable> with the name of the kernel module which should be installed.
fr: Remplacez <replaceable>nom_du_module</replaceable> par le nom du module du noyau à installer.

source: Options to pass to the installed kernel module. For example:
fr: Les options à passer au module du noyau à installer. Par exemple :

source: driverdisk (optional) - Use a Driver Disk
fr: driverdisk (facultative) - Utilisation d'un disque de pilotes

source: Driver disks can be used during Kickstart installations to provide additional drivers not included by default. You must copy the driver disks's contents to the root directory of a partition on the system's hard drive. Then, you must use the <command>driverdisk</command> command to specify that the installation program should look for a driver disk and its location.
fr: Des disques de pilotes peuvent être utilisés lors d'une installation Kickstart pour fournir des pilotes complémentaires à ceux inclus de base. Vous devez copier le contenu du disque de pilotes dans le dossier racine d'une partition sur le disque dur du système. Ensuite, vous devez utiliser la commande <command>driverdisk</command> pour dire à l'installateur de chercher un disque de pilotes ainsi que son emplacement.

source: Search for the driver disk image on a local partition. Replace <replaceable>partition</replaceable> with the name of the partition containing the driver disk. Note that the partition must be specified as a full path. For example:
fr: Cherche le disque de pilotes sur une partition locale. Remplacez <replaceable>partition</replaceable> par le nom de la partition qui contient le disque de pilotes. Notez qu'il faut donner le chemin complet vers cette partition. Par exemple :

source: Search for the driver disk in a network location instead of a local partition. For example:
fr: Cherche le disque de pilotes dans un emplacement réseau. Par exemple :

source: <command>driverdisk --source=ftp://<replaceable>path/to/dd.img</replaceable></command>
fr: <command>driverdisk --source=ftp://<replaceable>chemin/de/dd.img</replaceable></command>

source: <command>driverdisk --source=http://<replaceable>path/to/dd.img</replaceable></command>
fr: <command>driverdisk --source=http://<replaceable>chemin/de/dd.img</replaceable></command>

source: <command>driverdisk --source=nfs:<replaceable>hostname</replaceable>:/<replaceable>path/to/dd.img</replaceable></command>
fr: <command>driverdisk --source=nfs:<replaceable>nom d'hôte</replaceable>:/<replaceable>chemin/de/dd.img</replaceable></command>

source: BIOS partition containing the driver disk (for example, <literal>82p2</literal>).
fr: La partition BIOS qui contient le disque de pilotes (par exemple, <literal>82p2</literal>).

source: install (required) - Configure Installation Method
fr: install (requise) - Configuration de la méthode d'installation

source: The default installation mode. You must specify the type of installation from <literal>cdrom</literal>, <literal>harddrive</literal>, <literal>nfs</literal>, <literal>liveimg</literal>, or <literal>url</literal>. The <command>install</command> command and the installation method command must be on separate lines. For example:
fr: Le mode d'installation par défaut. Vous devez spécifier un mode d'installation à partir d'un <literal>cdrom</literal>, d'un <literal>disque dur</literal>, d'un <literal>nfs</literal>, d'une <literal>image live</literal> ou d'une <literal>url</literal>. La commande <command>install</command> et la méthode d'installation doivent être sur deux lignes distinctes. Par exemple :

source: The installation method commands are:
fr: Les commandes de méthode d'installation sont :

source: Install from the first optical (DVD) drive on the system.
fr: Installe depuis le premier disque optique (DVD) du système.

source: Install from a tree or full installation ISO image on a local hard drive. The tree or ISO image must be on a file system which is mountable in the installation environment. Supported file systems are <systemitem>ext2</systemitem>, <systemitem>ext3</systemitem>, <systemitem>ext4</systemitem>, <systemitem>vfat</systemitem>, or <systemitem>xfs</systemitem>.
fr: Installe d'un arbre ou d'une image ISO d'installation complète sur un disque dur local. L'arbre ou l'image ISO doivent être sur un système de fichiers montable dans l'environnement de l'installateur. Les systèmes de fichiers pris en charge sont <systemitem>ext2</systemitem>, <systemitem>ext3</systemitem>, <systemitem>ext4</systemitem>, <systemitem>vfat</systemitem> ou <systemitem>xfs</systemitem>.

source: Partition to install from (such as <literal>sdb2</literal>).
fr: Partition à partir de laquelle installer (comme <literal>sdb2</literal>).

source: BIOS partition to install from (such as <literal>82p2</literal>).
fr: Partition BIOS à partir de laquelle installer (comme <literal>82p2</literal>).

source: Directory containing the installation tree or ISO image.
fr: Dossier contenant l'arbre d'installation ou l'image ISO.

source: Install from a disk image instead of packages. The image can be the <filename>squashfs.img</filename> file from a live ISO image, or any file system that the installation media can mount. Supported file systems are <systemitem>ext2</systemitem>, <systemitem>ext3</systemitem>, <systemitem>ext4</systemitem>, <systemitem>vfat</systemitem>, and <systemitem>xfs</systemitem>.
fr: Installe à partir d'un disque plutôt que des paquets. L'image peut être le fichier <filename>squashfs.img</filename> d'une image ISO live ou n'importe quel système de fichiers que le média d'installation est capable de monter. Les systèmes de fichiers pris en charge sont <systemitem>ext2</systemitem>, <systemitem>ext3</systemitem>, <systemitem>ext4</systemitem>, <systemitem>vfat</systemitem> et <systemitem>xfs</systemitem>.

source: This command also supports installation from tar archives of the root file system. In that case, the file name must end with <literal>.tar</literal>, <literal>.tbz</literal>, <literal>.tgz</literal>, <literal>.txz</literal>, <literal>.tar.bz2</literal>, <literal>tar.gz</literal>, or <literal>tar.xz</literal>.
fr: Cette commande prend aussi en charge l'installation à partir d'archives tar du système de fichiers root. Dans ce cas, le nom du fichier doit se terminer par <literal>.tar</literal>, <literal>.tbz</literal>, <literal>.tgz</literal>, <literal>.txz</literal>, <literal>.tar.bz2</literal>, <literal>tar.gz</literal> ou <literal>tar.xz</literal>.

source: The location to install from. Supported protocols are <systemitem class="protocol">HTTP</systemitem>, <systemitem class="protocol">HTTPS</systemitem>, <systemitem class="protocol">FTP</systemitem>, and <systemitem class="protocol">file</systemitem>.
fr: L'emplacement depuis lequel installer. Les protocoles pris en charge sont <systemitem class="protocol">HTTP</systemitem>, <systemitem class="protocol">HTTPS</systemitem>, <systemitem class="protocol">FTP</systemitem> et <systemitem class="protocol">file</systemitem>.

source: Specify an <systemitem class="protocol">HTTP</systemitem>, <systemitem class="protocol">HTTPS</systemitem> or <systemitem class="protocol">FTP</systemitem> proxy to use while performing the installation.
fr: Spécifie un proxy <systemitem class="protocol">HTTP</systemitem>, <systemitem class="protocol">HTTPS</systemitem> ou <systemitem class="protocol">FTP</systemitem> à utiliser pendant l'installation.

source: An optional argument with the <systemitem>SHA256</systemitem> checksum of the image file, used for integrity verification. If you are using a live image provided by Fedora Project, you can find a list of checksums at <ulink url="https://fedoraproject.org/en/verify" />.
fr: Un argument facultatif précisant la somme de contrôle (checksum) <systemitem>SHA256</systemitem> du fichier image, utilisé pour vérifier l'intégrité. Si vous utilisez une image live fournie par le projet Fedora, vous pouvez trouver une liste des sommes de contrôle à <ulink url="https://fedoraproject.org/en/verify" />.

source: Disable SSL verification when connecting to an <systemitem class="protocol">HTTPS</systemitem> server.
fr: Désactive la vérification SSL lors de la connexion à un serveur <systemitem class="protocol">HTTPS</systemitem>.

source: Install from an <systemitem class="protocol">NFS</systemitem> server specified. The NFS server must be exporting the full installation ISO image (such as the &PRODUCT; Server DVD) or its extracted contents.
fr: Installe depuis un serveur <systemitem class="protocol">NFS</systemitem> spécifié. Le serveur NFS doit exporter l'image complète d'installation (comme le DVD &PRODUCT; Server) ou son contenu extrait.

source: Host name of the server.
fr: Nom d'hôte du serveur.

source: Mount options to use for mounting the <systemitem class="protocol">NFS</systemitem> export.
fr: Options de montage à utiliser pour monter l'exportation du <systemitem class="protocol">NFS</systemitem>.

source: Install from a tree on a remote server via <systemitem class="protocol">HTTP</systemitem>, <systemitem class="protocol">HTTPS</systemitem>, or <systemitem class="protocol">FTP</systemitem>.
fr: Installe depuis un arbre sur un serveur distant via <systemitem class="protocol">HTTP</systemitem>, <systemitem class="protocol">HTTPS</systemitem> ou <systemitem class="protocol">FTP</systemitem>.

source: The location to install from. Supported protocols are <literal>http</literal>, <literal>https</literal>, <literal>ftp</literal>, and <literal>file</literal>.
fr: L'emplacement depuis lequel installer . Les protocoles pris en charge sont <literal>http</literal>, <literal>https</literal>, <literal>ftp</literal> et <literal>file</literal>.

source: The mirror URL to install from.
fr: L' URL du miroir à partir duquel installer.

source: Disable SSL verification when connecting to an <systemitem>HTTPS</systemitem> server.
fr: Désactive la vérification SSL lors de la connexion à un serveur <systemitem>HTTPS</systemitem>.

source: mediacheck (optional) - Verify Installation Media Integrity
fr: mediacheck (facultative) - Vérification de l'intégrité du média d'installation

source: This command will force the installation program to perform a media check before starting the installation, similarly to the <option>rd.live.check</option> boot option (see <xref linkend="sect-boot-options-mediacheck" />. This command requires that installations be attended, so it is disabled by default.
fr: Cette commande force l'installateur à vérifier le média avant de commencer l'installation ; similaire à l'option de démarrage <option>rd.live.check</option> (voir la <xref linkend="sect-boot-options-mediacheck" />). Cette commande requiert la présence de l'utilisateur lors de l'installation, c'est pourquoi elle est désactivée par défaut.

source: ostreesetup (optional) - Install from an OSTree
fr: ostreesetup (facultative) - Installation à partir d'un arbre OSTree

source: Used for OSTree installations. See <ulink url="https://wiki.gnome.org/action/show/Projects/OSTree" /> for more information about OSTree. Available options are:
fr: Utilisé pour des installation à partir d'un arbre OSTree. Reportez-vous à la page <ulink url="https://wiki.gnome.org/action/show/Projects/OSTree" /> pour une information complémentaire sur les arbres OSTree. Les options disponibles sont :

source: Management root for OS installation (required).
fr: Racine de gestion pour l'installation de l'OS (requise)

source: Management root for OS installation (optional).
fr: Racine de gestion pour l'installation de l'OS facultative)

source: Repository URL (required).
fr: URL du dépôt (requise).

source: Name of branch inside the repository (required).
fr: Nom de la branche à l'intérieur du dépôt (requise).

source: Disable GPG key verification (optional).
fr: Désactive la vérification par clé GPG (facultative).

source: repo (optional) - Configure Additional Repositories
fr: repo (facultative) - Configure des dépôts additionnels

source: Configures additional <application>DNF</application> repositories that may be used as sources for package installation. This command can be used multiple times in a single Kickstart file.
fr: Configure des dépôts <application>DNF</application> additionnels qui peuvent être utilisés comme source d'installation des paquets. Cette commande peut être utilisée plusieurs fois dans un même fichier Kickstart.

source: See the <citetitle>Fedora System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />, for information about the <application>DNF</application> package manager.
fr: Reportez-vous au <citetitle>Guide de l'administrateur système de Fedora</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" /> pour des informations sur le gestionnaire de paquets <application>DNF</application>.

source: Repositories used for installation must be stable. The installation may fail if a repository is modified before the installation concludes.
fr: Les dépôts utilisés pour l'installation doivent être stables. Les installation peuvent échouer si un dépôt est modifié avant que l'installation se termine.

source: The repository ID. This option is required. If a repository has a name which conflicts with another previously added repository, it will be ignored. Because the installation program uses a list of pre-configured repositories, this means that you cannot add repositories with the same names as the preconfigured ones.
fr: L'identifiant (ID) du dépôt. Cette option est requise. Si le nom d'un dépôt entre en conflit avec celui d'un dépôt préalablement ajouté, il est ignoré. Comme l'installateur utilise une liste de dépôts pré-configurés, vous ne pouvez pas ajouter de dépôt avec un nom identique à celui d'un de ces dépôts.

source: The repository URL. The variables that may be used in <application>DNF</application> repo configuration files are <emphasis>not</emphasis> supported. You may use one of either this option or <option>--mirrorlist</option>, not both.
fr: L'URL du dépôt. Les variables qui peuvent être utilisées dans le fichier de configuration d'un dépôt <application>DNF</application> ne sont <emphasis>pa </emphasis>s prises en charge. Vous pouvez utiliser soit cette option, soit l'option <option>--mirrorlist</option>, pas les deux.

source: The URL pointing at a list of mirrors for the repository. The variables that may normally be used in dnf repository configuration files are not supported here. You may use one of either this option or --baseurl, not both.
fr: L'URL qui pointe sur une liste de miroirs pour ce dépôt. Les variables qui peuvent normalement être utilisées dans le fichier de configuration d'un dépôt dnf ne sont pas prises en charge ici. Vous pouvez utiliser soit cette option, soit l'option --baseurl, pas les deux.

source: Make the repository configured in the Kickstart file available on the system after the installation as well. Creates a configuration file for the repository in <filename class="directory">/etc/yum.repos.d/</filename> on the installed system.
fr: Rend le dépôt configuré dans le fichier Kickstart disponible également sur le système installé. Crée un fichier de configuration pour le dépôt dans le dossier <filename class="directory">/etc/yum.repos.d/</filename> du système installé.

source: An integer value to assign a cost to this repository. If multiple repositories provide the same packages, this number will be used to prioritize which repository will be used before another. Repositories with a lower cost take priority over repositories with higher cost.
fr: Un entier pour attribuer un coût à ce dépôt. Si plusieurs dépôts fournissent les mêmes paquets, cette valeur est utilisée pour établir la priorité d'utilisation des dépôts. Les dépôts à moindre coût sont prioritaires.

source: A comma-separated list of package names that must <emphasis>not</emphasis> be pulled from this repository. This is useful if multiple repositories provide the same package and you want to make sure it comes from a particular repository. Both full package names (such as <literal>publican</literal>) and globs (such as <literal>gnome-*</literal>) are accepted.
fr: Une liste de noms de paquets séparés par une virgule qui ne doivent <emphasis>pas</emphasis> être tirés de ce dépôt. Cette liste est utile si plusieurs dépôts fournissent le même paquet et que vous voulez être certain qu'il vient d'un dépôt bien précis. Les noms complets de paquet (tels que <literal>publican</literal>) et les noms de groupes de paquets (tels que <literal>gnome-*</literal>) sont acceptés.

source: A comma-separated list of package names and globs that must be pulled from this repository. This is useful if multiple repositories provide the same package and you want to make sure it comes from this repository.
fr: Une liste de noms de paquet, ou de groupes de paquets, séparés par une virgule qui doivent être tirés des ce dépôt. Cette liste est utile si plusieurs dépôts fournissent le même paquet et que vous voulez être certain qu'il vient de ce dépôt en particulier.

source: Specify an <systemitem class="protocol">HTTP</systemitem>, <systemitem class="protocol">HTTPS</systemitem> or <systemitem class="protocol">FTP</systemitem> proxy server to use when accessing this repository. This setting does not affect any other repositories or installation sources.
fr: Spécifie un serveur mandataire (proxy) <systemitem class="protocol">HTTP</systemitem>, <systemitem class="protocol">HTTPS</systemitem> ou <systemitem class="protocol">FTP</systemitem> à utiliser lors de l'accès à ce dépôt. Ce réglage n'affecte pas les autres dépôts ou sources d'installation.
