Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: Add a randomly-generated passphrase to each encrypted partition. Store these passphrases in separate files in <filename>/root</filename>, encrypted using the X.509 certificate specified with <option>--escrowcert</option>. This option is only meaningful if <option>--escrowcert</option> is specified.
fr: Ajoute une phrase de passe générée aléatoirement à chacune des partitions chiffrées. Stocke ces phrases de passe dans des fichiers séparés dans le dossier <filename>/root</filename>, chiffrés en utilisant le certificat X.509 spécifié par l'<option>--escrowcert</option>. Cette option n'a de sens que si l'option <option>--escrowcert</option> est spécifiée.

source: raid (optional) - Create Software RAID
fr: raid (facultative) - Création d'un RAID logiciel

source: Assembles a software RAID device. This command is of the form:
fr: Assemble un périphérique en RAID logiciel. Cette commande est de la forme :

source: <command>raid <replaceable>mntpoint</replaceable> --level=<replaceable>level</replaceable> --device=<replaceable>mddevice</replaceable> <replaceable>partitions*</replaceable></command>
fr: <command>raid <replaceable>point_de_montage</replaceable> --level=<replaceable>niveau</replaceable> --device=<replaceable>périphérique_multiple</replaceable> <replaceable>partitions*</replaceable></command>

source: For a detailed example of <command>raid</command> in action, see <xref linkend="sect-kickstart-example-advanced-partitioning" />.
fr: Pour un exemple détaillé de <command>raid</command> en action, reportez-vous à la <xref linkend="sect-kickstart-example-advanced-partitioning" />.

source: Location where the RAID file system is mounted. If it is <filename>/</filename>, the RAID level must be 1 unless a boot partition (<filename>/boot</filename>) is present. If a boot partition is present, the <filename>/boot</filename> partition must be level 1 and the root (<filename>/</filename>) partition can be any of the available types. The <replaceable>partitions*</replaceable> (which denotes that multiple partitions can be listed) lists the RAID identifiers to add to the RAID array.
fr: L'emplacement où le système de fichiers RAID est monté. S'il s'agit de <filename>/</filename>, le niveau de RAID doit être 1 sauf si une partition de démarrage (<filename>/boot</filename>) existe. Si une partition de démarrage existe, la partition <filename>/boot</filename> doit avoir le niveau 1 et la partition racine (<filename>/</filename>) n'importe quel niveau. Le <replaceable>partitions*</replaceable> (qui dénote que plusieurs partitions peuvent être listées) liste les identifiants RAID à ajouter au regroupement RAID.

source: RAID level to use (<literal>0</literal>, <literal>1</literal>, <literal>4</literal>, <literal>5</literal>, <literal>6</literal>, or <literal>10</literal>). See <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> for information about various RAID types and their requirements.
fr: Niveau de RAID à utiliser (<literal>0</literal>, <literal>1</literal>, <literal>4</literal>, <literal>5</literal>, <literal>6</literal> ou <literal>10</literal>). Voir la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> pour des informations sur les différents types de RAID et leurs exigences.

source: Name of the RAID device to use. As of &PRODUCT;&nbsp;&PRODVER;, RAID devices are no longer referred to by names like <literal>md0</literal>. If you have an old (v0.90 metadata) array that you cannot assign a name to, you can specify the array by a filesystem label or UUID (for example, <option>--device=rhel7-root --label=rhel7-root</option>).
fr: Nom du périphérique RAID à utiliser. Depuis &PRODUCT;&nbsp;&PRODVER;, on ne fait plus référence aux périphériques RAID par des noms tels que <literal>md0</literal>. Si vous avez un ancien regroupement (v090 metadata) auquel vous ne pouvez plus attribuer un nom, vous pouvez spécifier le regroupement par une étiquette de système de fichiers ou par un UUID (par exemple, <option>--device=rhel7-root --label=rhel7-root</option>).

source: Specifies the number of spare drives allocated for the RAID array. Spare drives are used to rebuild the array in case of drive failure.
fr: Spécifie le nombre de périphériques de rechange pour le regroupement RAID. Les disques de rechange sont utilisés pour reconstruire le regroupement en cas de panne.

source: Specify the label to give to the filesystem to be made. If the given label is already in use by another filesystem, a new label will be created.
fr: Spécifiez l'étiquette à donner au système de fichiers à créer. Si l'étiquette donnée est déjà utilisée par un autre système de fichiers, une nouvelle étiquette est fabriquée.

source: Use an existing RAID device and do not format it.
fr: Utilise un périphérique RAID existant et ne le formate pas.

source: Use an existing RAID device and reformat it.
fr: Utilise un périphérique RAID existant et le re-formate.

source: Specifies that this array should be encrypted, using the passphrase provided in the <option>--passphrase</option> option. If you do not specify a passphrase, <application>Anaconda</application> uses the default, system-wide passphrase set with the <command>autopart --passphrase</command> command, or stops the installation and prompts you to provide a passphrase if no default is set.
fr: Spécifie que ce regroupement doit être chiffré en utilisant la phrase de passe fournie par l'option <option>--passphrase</option>. Si vous ne spécifiez pas de phrase de passe, <application>Anaconda</application> utilise la phrase de passe par défaut pour le système tout entier et définie par la commande <command>autopart --passphrase</command>, ou arrête l'installation et vous demande d'en fournir une si la phrase par défaut n'est pas définie.

source: The following example shows how to create a RAID level 1 partition for <filename>/</filename>, and a RAID level 5 for <filename>/home</filename>, assuming there are three SCSI disks on the system. It also creates three swap partitions, one on each drive.
fr: L'exemple qui suit montre comment créer une partition RAID de niveau 1 pour <filename>/</filename>, et une partition RAID de niveau 5 pour <filename>/home</filename>, en supposant qu'il y a des disques SCSI sur le système. Il crée également trois partitions d'échange, une sur chacun des périphériques.

source: Creating a RAID array in Kickstart
fr: Création d'un regroupement RAID dans Kickstart

source: reqpart (optional) - Create Required Partitions
fr: reqpart (facultative) - Création des partitions requises

source: Automatically create partitions required by your hardware platform. These include a <filename>/boot/efi</filename> for x86_64 and Aarch64 systems with UEFI firmware, <systemitem>biosboot</systemitem> for x86_64 systems with BIOS firmware and GPT (GUID Partition Table), and <systemitem>PRePBoot</systemitem> for IBM Power Systems.
fr: Crée automatiquement les partitions requises par votre plateforme matérielle. Cela inclut une partition <filename>/boot/efi</filename> pour les systèmes x86_64 et Aarch64 dotés d'un micrologiciel UEFI, une partition <systemitem>biosboot</systemitem>pour les systèmes x86_64 dotés d'un micrologiciel BIOS et d'une GPT (table des partitions GUID) et une partition <systemitem>PRePBoot</systemitem> pour les systèmes IBM Power.

source: This command can not be used together with <command>autopart</command>, because <command>autopart</command> does the same and creates other partitions or logical volumes such as <filename>/</filename> and <systemitem>swap</systemitem> on top. In contrast with <command>autopart</command>, this command only creates platform-specific partitions and leaves the rest of the drive empty, allowing you to create a custom layout.
fr: Cette commande ne peut pas être utilisée conjointement avec la commande <command>autopart</command>, parce que la commande <command>autopart</command> fait la même chose et crée d'autres partitions ou volumes logiques tels <filename>/</filename> et <systemitem>swap</systemitem>. Par contraste avec la commande <command>autopart</command>, cette commande ne crée que les partitions spécifiques à la plateforme et laisse le reste du disque vide, vous permettant ainsi de créer votre partitionnement personnalisé.

source: Create a separate <filename>/boot</filename> partition in addition to the platform-specific partition created by the base command.
fr: Crée une partition séparée <filename>/boot</filename> en plus de la partition spécifique à la plateforme créées par la commande de base.

source: volgroup (optional) - Create LVM Volume Group
fr: volgroup (facultative) - Création d'un groupe de volumes LVM

source: Creates a Logical Volume Management (LVM) volume group.
fr: Crée un groupe de volumes LVM

source: <command>volgroup <replaceable>name</replaceable> <replaceable>partition</replaceable> [<replaceable>options</replaceable>]</command>
fr: <command>volgroup <replaceable>nom</replaceable> <replaceable>partition</replaceable> [<replaceable>options</replaceable>]</command>

source: This limitation only applies to newly created logical volume and volume group names. If you are reusing existing ones using the <option>--noformat</option> or <option>--noformat</option> option, their names will not be changed.
fr: Cette limitation ne s'applique qu'aux noms des volumes logiques et groupes de volumes nouvellement créés. Si vous réutilisez des volumes ou groupes de volumes existants avec l'option <option>--noformat</option> ou <option>--noformat</option>, leur nom n'est pas modifié.

source: For a detailed partitioning example including <command>volgroup</command>, see <xref linkend="sect-kickstart-example-advanced-partitioning" />.
fr: Pour un exemple de partitionnement incluant <command>volgroup</command>, reportez-vous à la <xref linkend="sect-kickstart-example-advanced-partitioning" />.

source: Use an existing volume group and do not format it.
fr: Utilise un groupe de volumes existant et ne le formate pas.

source: Use an existing volume group and reformat it.
fr: Utilise un groupe de volumes existant et le re-formate.

source: Set the size of the physical extents. The default size for Kickstart installations is 4 MiB.
fr: Définit la taille des extensions physiques. La taille par défaut pour des installations Kickstart est de 4 Mio.

source: Specify an amount of space to leave unused in a volume group in megabytes. Applicable only to newly created volume groups.
fr: Spécifie une quantité d'espace à laisser libre dans groupe de volumes en mégaoctets. Ne s'applique qu'aux groupes de volumes nouvellement créés.

source: Specify a percentage of total volume group space to leave unused. Applicable only to newly created volume groups.
fr: Spécifie un pourcentage de l'espace total du groupe de volumes à laisser libre. Ne s'applique qu'aux groupes de volumes nouvellement créés.

source: zerombr (optional) - Reinitialize Partition Tables
fr: zerombr (facultative) - Réinitialisation des tables de partitions

source: If <command>zerombr</command> is specified, any invalid partition tables found on disks are initialized. This destroys all of the contents of disks with invalid partition tables. This command is required when performing an unattended installation on a system with previously initialized disks.
fr: Si <command>zerombr</command> est spécifiée, toute table des partitions trouvée invalide sur les disques est réinitialisée. Cela détruit le contenu complet des disques dont la table des partitions est invalide. Cette commande est requise lors d'une installation sans présence de l'utilisateur sur un système doté de disques préalablement initialisés.

source: On IBM System&nbsp;z, if <command>zerombr</command> is specified, any <firstterm>Direct Access Storage Device</firstterm> (DASD) visible to the installation program which is not already low-level formatted is automatically low-level formatted with <application>dasdfmt</application>. The command also prevents user choice during interactive installations.
fr: Sur IBM System&nbsp;z, si <command>zerombr</command> est spécifiée, tout <firstterm>périphérique de stockage à accès direct</firstterm> (DASD) visible à l'installateur qui n'est pas déjà formaté bas niveau est automatiquement formaté bas niveau par <application>dasdfmt</application>. La commande empêche également le choix de l'utilisateur lors des installations interactives.

source: If <command>zerombr</command> is not specified and there is at least one unformatted DASD visible to the installation program, a non-interactive Kickstart installation will exit unsuccessfully.
fr: Si <command>zerombr</command> n'est pas spécifiée et qu'il existe au moins un DASD non formaté visible à l'installateur, un installation Kickstart non-interactive échoue.

source: If <command>zerombr</command> is not specified and there is at least one unformatted DASD visible to the installation program, an interactive installation exits if the user does not agree to format all visible and unformatted DASDs. To circumvent this, only activate those DASDs that you will use during installation. You can always add more DASDs after installation is complete.
fr: Si <command>zerombr</command> n'est pas spécifiée qu'il existe au moins un DASD non formaté visible à l'installateur, une installation interactive, se termine si l'utilisateur n'accepte pas de formater tous les DASDs visibles et non formatés. Pour circonvenir cela, n'activez que les DASDs que vous allez utiliser lors de l'installation. Vous pouvez toujours ajouter des DASDs après que l'installation est terminée.

source: zfcp (optional) - Configure Fibre Channel Device
fr: zfcp (facultative) - Configuration d'un périphérique Fibre Channel

source: Define a Fibre channel device. This option only applies on IBM System&nbsp;z. All of the options described below must be specified.
fr: Définit un périphérique Fibre Channel (canal fibre). Cette option ne s'applique qu'aux systèmes IBM System z. Toutes les options décrites ci-dessous doivent être spécifiées.

source: <command>zfcp --devnum=<replaceable>devnum</replaceable> --wwpn=<replaceable>wwpn</replaceable> --fcplun=<replaceable>lun</replaceable></command>
fr: <command>zfcp --devnum=<replaceable>n°_périphérique</replaceable> --wwpn=<replaceable>wwpn</replaceable> --fcplun=<replaceable>lun</replaceable></command>

source: The device number (zFCP adaptor device bus ID).
fr: Le numéro de périphérique (bus ID du périphérique adaptateur zFCP).

source: The device's World Wide Port Name (WWPN). Takes the form of a 16-digit number, preceded by <literal>0x</literal>.
fr: Le nom de port globalement unique (Word Wide Port Name)(WWPN). Prend la forme d'un nombre à 16 chiffres précédé de <literal>0x</literal>.

source: The device's Logical Unit Number (LUN). Takes the form of a 16-digit number, preceded by <literal>0x</literal>.
fr: Le numéro d'unité logique du périphérique (Logical Unit Number) (LUN). Prend la forme d'un nombre à 16 chiffres précédé de <literal>0x</literal>.

source: For example:
fr: Par exemple:

source: Network Configuration
fr: Configuration réseau

source: Commands in this chapter are used for network configuration.
fr: Les commandes de ce chapitre sont utilisées pour la configuration du réseau.

source: firewall (optional) - Configure Firewall
fr: firewall (facultative) - Configuration du pare-feu

source: Specify the firewall configuration for the installed system.
fr: Spécifie la configuration du pare-feu pour le système installé.

source: <command>firewall --enabled | --disabled <replaceable>device</replaceable> [--trust= | --ssh | --smtp | --http | --ftp | --port= | --service=]</command>
fr: <command>firewall --enabled | --disabled <replaceable>périphérique</replaceable> [--trust= | --ssh | --smtp | --http | --ftp | --port= | --service=]</command>

source: <option>--enabled</option> or <option>--enable</option>
fr: <option>--enabled</option> ou <option>--enable</option>

source: Reject incoming connections that are not in response to outbound requests, such as DNS replies or DHCP requests. If access to services running on this machine is needed, you can choose to allow specific services through the firewall.
fr: Rejette les connexions entrantes qui ne sont pas en réponse aux requêtes sortantes, telles que réponses DNS ou requêtes DHCP. Si un accès aux services fournis par cette machine est nécessaire, vous pouvez choisir d'autoriser des services spécifiques à travers le pare-feu.

source: Disable the firewall.
fr: Désactive le pare-feu.

source: Listing a device here, such as <literal>em1</literal>, allows all traffic coming to and from that device to go through the firewall. To list more than one device, use this option again - for example:
fr: Inscrire un périphérique ici, tel que <literal>em1</literal>, permet à tous le trafic entrant et sortant de ce périphérique de passer par le pare-feu. Pour inscrire plus d'un périphérique, utilisez à nouveau l'option. Par exemple :

source: Do not use a comma-separated format such as <option>--trust em1, em2</option>.
fr: Ne les présentez pas en une liste de noms séparés par une virgule comme <option>--trust em1, em2</option>.

source: <replaceable>incoming</replaceable>
fr: <replaceable>entrant</replaceable>

source: Replace with one or more of the following to allow the specified services through the firewall:
fr: À remplacer par un ou plus des éléments suivants pour autoriser les services spécifiés à passer par le pare-feu :

source: You can specify that ports be allowed through the firewall using the port:protocol format. For example, to allow IMAP access through your firewall, specify <literal>imap:tcp</literal>. Numeric ports can also be specified explicitly; for example, to allow UDP packets on port 1234 through, specify <literal>1234:udp</literal>. To specify multiple ports, separate them by commas.
fr: Vous pouvez spécifier que des ports sont autorisés à travers le pare-feu en utilisant le format port:protocol. Par exemple, pour autoriser l'accès IMAP à travers le pare-feu, spécifiez <literal>imap:tcp</literal>. Les ports peuvent aussi être spécifiés explicitement par leur numéro ; par exemple, pour autoriser les paquets UDP sur le port 1234 à passer par le pare-feu, spécifiez <literal>1234:udp</literal>. Pour spécifier plusieurs ports, séparez les l'un de l'autre par une virgule.

source: This option provides a higher-level way to allow services through the firewall. Some services (like <systemitem>cups</systemitem>, <systemitem>avahi</systemitem>, etc.) require multiple ports to be open or other special configuration in order for the service to work. You can specify each individual port with the <option>--port</option> option, or specify <command>--service=</command> and open them all at once.
fr: Cette option fournit une manière de plus haut niveau d'autoriser les services à travers le pare-feu. Quelques services (comme <systemitem>cups</systemitem>, <systemitem>avahi</systemitem>, etc.) requièrent l'ouverture de plusieurs ports ou une configuration spéciale pour fonctionner. Vous pouvez spécifier chacun des ports individuellement avec l'option <option>--port</option> option, ou vous servir de l'option <command>--service=</command> et les ouvrir tous à la fois.

source: Valid options are anything recognized by the <application>firewall-offline-cmd</application> program in the <package>firewalld</package> package. If <systemitem>firewalld</systemitem> is running, <command>firewall-cmd --get-services</command> will provide a list of known service names.
fr: Les options valides sont tout ce qui est reconnu par le programme <application>firewall-offline-cmd</application> du paquet <package>firewalld</package>. Si <systemitem>firewalld</systemitem> est en cours d'exécution, la commande <command>firewall-cmd --get-services</command> dans un terminal fournit une liste des noms de service connus.

source: network (optional) - Configure Network Interfaces
fr: network (facultative) - Configuration des interfaces réseau

source: Configures network information for the target system and activates network devices in the installation environment. The device specified in the first <command>network</command> command is activated automatically. Activation of the device can be also explicitly required by the <option>--activate</option> option.
fr: Configure les informations réseau pour le système cible et active les périphériques réseau dans l'environnement d'installation. Le périphérique spécifié dans la première commande <command>network</command> est activé automatiquement. L'activation du périphérique peut également être demandée explicitement avec l'option <option>--activate</option>.

source: If you use the <option>--activate</option> option on a device that has already been activated (for example, an interface you configured with boot options so that the system could retrieve the Kickstart file) the device is reactivated to use the details specified in the Kickstart file.
fr: Si vous utilisez l'option <option>--activate</option> sur un périphérique déjà activé (par exemple, une interface que vous avez configurée à l'aide des options de démarrage de manière à ce que le système puisse retrouver le fichier Kickstart), ce périphérique est réactivé avec les détails donnés dans le fichier Kickstart.

source: Use the <option>--nodefroute</option> option to prevent the device from using the default route.
fr: Utilisez l'<option>--nodefroute</option> pour empêcher un périphérique d'utiliser la route par défaut.

source: One of <literal>dhcp</literal>, <literal>bootp</literal>, <literal>ibft</literal>, or <literal>static</literal>. The default option is <literal>dhcp</literal>; the <literal>dhcp</literal> and <literal>bootp</literal> options are treated the same.
fr: L'un de cette liste : <literal>dhcp</literal>, <literal>bootp</literal>, <literal>ibft</literal>, ou <literal>static</literal>. L'option par défaut est <literal>dhcp</literal>; les options <literal>dhcp</literal> et <literal>bootp</literal> sont traitées de la même manière.

source: The DHCP method uses a DHCP server system to obtain its networking configuration. The BOOTP method is similar, requiring a BOOTP server to supply the networking configuration. To direct a system to use DHCP:
fr: La méthode DHCP utilise un serveur DHCP pour obtenir la configuration réseau du système. La méthode BOOTP est similaire : elle demande un serveur BOOTP pour obtenir la configuration réseau. Pour obliger une machine à utiliser la méthode DHCP, utilisez la ligne suivante :

source: To direct a machine to use BOOTP to obtain its networking configuration, use the following line in the Kickstart file:
fr: Pour obliger une machine à utiliser la méthode BOOTP pour obtenir sa configuration réseau, utilisez la ligne suivante :

source: To direct a machine to use the configuration specified in iBFT, use:
fr: Pour obliger une machine à utiliser la configuration définie dans iBFT, utilisez :

source: The <literal>static</literal> method requires that you specify the IP address, netmask, gateway, and nameserver in the Kickstart file. This information is static and is used during and after the installation.
fr: La méthode <literal>static</literal> requiert que vous spécifiiez l'adresse IP, le masque de réseau, la passerelle et le nom de serveur dans le fichier Kickstart. Cette information est statique et est utilisée durant et après l'installation.
