Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: Use this option when creating a <systemitem>swap</systemitem> logical volume to determine the size of this volume automatically, based on your system's hardware. For details about the recommended scheme, see <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Utilisez cette option lors de la création d'un volume logique d'échange (<systemitem>swap</systemitem>) pour que la taille de ce volume soit déterminée automatiquement en prenant en compte votre matériel. Pour des détails sur le schéma recommandé, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.

source: This option can only be used for partitions which result in a file system such as the <filename>/boot</filename> partition and <systemitem>swap</systemitem> space. It can not be used to create partitionsm, LVM physical or logical volumes or RAID members.
fr: Cette option ne peut être utilisée que pour des partitions telles que <filename>/boot</filename> et <systemitem>swap</systemitem>. Elle ne peut pas être utilisée pour créer un partitionnement, des volumes LVM physiques ou logiques ou des membres RAID.

source: Resize an existing logical volume. If you use this option, you must also specify <option>--useexisting</option> and <option>--size</option>.
fr: Redimensionne un volume logique existant. Si vous utilisez cette option, vous devez aussi spécifier les options <option>--useexisting</option> et <option>--size</option>.

source: Specifies that this logical volume should be encrypted, using the passphrase provided in the <option>--passphrase=</option> option. If you do not specify a passphrase, the installation program will use the default, system-wide passphrase set with the <command>autopart --passphrase</command> command, or stop the installation and prompt you to provide a passphrase if no default is set.
fr: Spécifie que ce volume logique doit être chiffré, en utilisant la phrase de passe fournie par l'option <option>--passphrase=</option>. Si vous ne spécifiez pas de phrase de passe, l'installateur utilise la phrase de passe par défaut valable pour tout le système et définie dans la commande <command>autopart --passphrase</command> ou, si aucune valeur par défaut n'est définie, s'arrête et vous demande de la fournir.

source: Specifies the passphrase to use when encrypting this logical volume. You must use this option together with the <option>--encrypted</option> option. This option has no effect by itself.
fr: Spécifie la phrase de passe à utiliser pour le chiffrement de ce volume logique. Vous devez utiliser cette option en même temps que l'option <option>--encrypted</option> car elle n'a pas d'effet par elle-même.

source: Store data encryption keys of all encrypted volumes as files in <filename>/root</filename>, encrypted using the X.509 certificate from the URL specified with <replaceable>URL_of_X.509_certificate</replaceable>. The keys are stored as a separate file for each encrypted volume. This option is only meaningful if <option>--encrypted</option> is specified.
fr: Stocke les clés de chiffrement de tous les volumes chiffrés en tant que fichiers dans le dossier <filename>/root</filename> chiffrés à l'aide du certificat X.509 obtenu à l'URL spécifiée par l'option <replaceable>URL_du_certificat_X.509</replaceable>. Les clés sont stockées sous forme d'un fichier distinct par volume chiffré. Cette option n'a de sens que si l'option <option>--encrypted</option> est spécifiée.

source: Add a randomly-generated passphrase to each encrypted volume. Store these passphrases in separate files in <filename>/root</filename>, encrypted using the X.509 certificate specified with <option>--escrowcert</option>. This option is only meaningful if <option>--escrowcert</option> is specified.
fr: Ajoute une phrase de passe générée aléatoirement pour chacun des volumes chiffrés. Stocke ces phrases de passe dans des fichiers distincts dans le dossier <filename>/root</filename> chiffrés à l'aide du certificat X.509 spécifié par l'option <option>--escrowcert</option>. Cette option n'a de sens que si l'option <option>--escrowcert</option> est spécifiée.

source: Creates a thin pool logical volume. (Use a mount point of <literal>none</literal>)
fr: Crée un volume à allocation fine (utilisez le point de montage <literal>none</literal>)

source: Metadata area size (in MiB) for a new thin pool device.
fr: Taille de la zone des méta-données (en Mio) pour un nouveau périphérique à allocation fine.

source: Chunk size (in KiB) for a new thin pool device.
fr: Taille du bloc (en Kio) pour un nouveau périphérique à allocation fine.

source: Create a thin logical volume. (Requires use of <option>--poolname</option>)
fr: Crée un volume logique à allocation fine. (Nécessite l'utilisation de l'<option>--poolname</option>)

source: Specify the name of the thin pool in which to create a thin logical volume. Requires the <option>--thin</option> option.
fr: Spécifie le nom du pool d'allocation fine dans lequel créer le volume logique. Nécessite l'option <option>--thin</option> .

source: Specify the configuration profile name to use with thin logical volumes. If used, the name will also be included in the metadata for the given logical volume. By default, the available profiles are <literal>default</literal> and <literal>thin-performance</literal> and are defined in the <filename class="directory">/etc/lvm/profile</filename> directory. See the <systemitem>lvm(8)</systemitem> man page for additional information.
fr: Spécifie le nom de profil de la configuration à utiliser avec les volumes à allocation fine. Si utilisé, le nom est également inclus dans les méta-données du volume logique. Par défaut, les profils disponibles sont <literal>default</literal> et <literal>thin-performance</literal> et sont définis dans le dossier <filename class="directory">/etc/lvm/profile</filename>. Reportez-vous à la page de manuel <systemitem>lvm(8)</systemitem> pour une information complémentaire.

source: A comma-separated list of (fast) physical volumes which should be used for LVM cache.
fr: Une liste de volumes physiques (rapides) séparés l'un de l'autre par une virgule qui doivent être utilisés pour le cache LVM.

source: Requested size of cache attached to the logical volume, in MiB. (Requires the <option>--cachepvs=</option> option.)
fr: Taille requise pour le cache attaché au volume logique, en Mio. (Nécessite l'option <option>--cachepvs=</option>.)

source: Mode to be used for LVM cache (either <literal>writeback</literal> or <literal>writethrough</literal>).
fr: Mode à utiliser pour le cache LVM (soit <literal>writeback</literal>, soit<literal>writethrough</literal>).

source: The <option>--cachepvs=</option>, <option>--cachesize=</option>, and <option>--cachemode=</option> options listed above are used to configure LVM caching. For more information, see the <systemitem>lvmcache(7)</systemitem> man page.
fr: Les options <option>--cachepvs=</option>, <option>--cachesize=</option> et <option>--cachemode=</option> listées ci-dessus sont utilisées pour la mise en cache LVM. Pour une plus ample information, lisez la page de manuel <systemitem>lvmcache(7)</systemitem>.

source: Create one or more partitions first using <xref linkend="sect-kickstart-commands-part" />, create the logical volume group (<xref linkend="sect-kickstart-commands-volgroup" />), and then create logical volumes. For example:
fr: Crée une ou plusieurs partitions en utilisant d'abord <xref linkend="sect-kickstart-commands-part" />, crée un groupe de volumes logiques (<xref linkend="sect-kickstart-commands-volgroup" />) puis crée des volumes logiques. Par exemple :

source: part (required) - Create Physical Partition
fr: part (requise) - Création d'une partition physique

source: Creates a partition on the system.
fr: Crée une partition sur le système.

source: For a detailed example of <command>part</command> in action, see <xref linkend="sect-kickstart-example-advanced-partitioning" />.
fr: Pour un exemple détaillé de la commande <command>part</command> en action, reportez-vous à l'<xref linkend="sect-kickstart-example-advanced-partitioning" />.

source: <command>part|partition <replaceable>mntpoint</replaceable> --name=<replaceable>name</replaceable> --device=<replaceable>device</replaceable> --rule=<replaceable>rule</replaceable> [<replaceable>options</replaceable>]</command>
fr: <command>part|partition <replaceable>point_de_montage</replaceable> --name=<replaceable>nom</replaceable> --device=<replaceable>périphérique</replaceable> --rule=<replaceable>règle</replaceable> [<replaceable>options</replaceable>]</command>

source: All partitions created are formatted as part of the installation process unless <option>--noformat</option> and <option>--onpart=</option> are used.
fr: Toutes les partitions créées sont formatées lors de l'installation sauf si l'option <option>--noformat</option> et l'option <option>--onpart=</option> sont utilisées.

source: If partitioning fails for any reason, diagnostic messages appear on virtual console 3.
fr: Si le partitionnement échoue pour une raison quelconque, les messages de diagnostic s'affichent sur la console virtuelle n° 3.

source: Where the partition is mounted. The value must be of one of the following:
fr: L'endroit où la partition est montée. Les valeurs possibles sont :

source: The size assigned will be effective but not precisely calibrated for your system.
fr: La taille assignée sera déterminée, mais pas forcément calibrée pour votre système.

source: The partition is used for software RAID (see <command>raid</command>).
fr: La partition est utilisée pour le RAID logiciel (voir <command>raid</command>).

source: The partition is used for LVM (see <xref linkend="sect-kickstart-commands-part" />).
fr: La partition est utilisée pour LVM (voir <xref linkend="sect-kickstart-commands-part" />).

source: The partition will be used for a BIOS Boot partition. A 1 MB BIOS boot partition is necessary on BIOS-based systems using a <firstterm>GUID Partition Table</firstterm> (GPT); the boot loader will be installed into it. It is not necessary on UEFI systems. Also see <xref linkend="sect-kickstart-commands-part" />.
fr: La partition est utilisée en tant que partition BIOS Boot. Une partition BIOS Boot d'au moins 1 Mo est nécessaire sur les systèmes dotés d'un micrologiciel BIOS qui utilisent la <firstterm>table des partitions GUID</firstterm> (GPT); le chargeur de démarrage est installé dans cette partition. Elle n'est pas nécessaire sur les systèmes dotés d'un micrologiciel UEFI. Voir aussi <xref linkend="sect-kickstart-commands-part" />.

source: An EFI System Partition. An EFI partition at least 50 MB in size is necessary on UEFI-based systems; the recommended size is 200 MB. It is not necessary on BIOS systems. Also see <xref linkend="sect-kickstart-commands-part" />.
fr: Une partition EFI System. Une partition EFI system d'au moins 50 Mo est nécessaire sur les systèmes dotés d'un micrologiciel UEFI. La taille recommandée est de 200 Mo. Elle n'est pas nécessaire sur les systèmes dotés d'un micrologiciel BIOS. Voir aussi <xref linkend="sect-kickstart-commands-part" />.

source: The minimum partition size in megabytes. Specify an integer value here such as <literal>500</literal> (do not include the unit).
fr: La taille minimum de la partition en mégaoctets. Spécifiez une valeur entière telle que <literal>500</literal> (ne donnez pas l'unité).

source: If the <option>--size</option> value is too small, the installation will fail. Set the <option>--size</option> value as the minimum amount of space you require. For size recommendations, see <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Si la valeur <option>--size</option> est trop petite l'installation échoue. Définissez la valeur <option>--size</option> comme étant la quantité d'espace minimum qu'il vous faut. Pour des recommandations sur la taille, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.

source: The maximum partition size in megabytes when the partition is set to grow. Specify an integer value here such as <literal>500</literal> (do not include the unit).
fr: La taille maximum de la partition en mégaoctets quand la partition est appelée à s'agrandir avec l'option grow. Spécifiez une valeur entière telle que <literal>500</literal> (ne donnez pas l'unité).

source: Resize an existing partition. When using this option, specify the new size (in megabytes) using the <option>--size=</option> option and the target partition using the <option>--onpart=</option> option.
fr: Redimensionne une partition existante. En utilisant cette option, spécifiez la nouvelle taille (en mégaoctets) avec l'option <option>--size=</option> et la partition cible avec l'option <option>--onpart=</option>

source: Tells the partition to grow to fill available space (if any), or up to the maximum size setting.
fr: Demande à la partition de s'agrandir pour remplir tout l'espace disponible (s'il en reste) ou de s'agrandir jusqu'à la taille maximum définie.

source: If you use <option>--grow=</option> without setting <option>--maxsize=</option> on a swap partition, <application>Anaconda</application> will limit the maximum size of the swap partition. For systems that have less than 2&nbsp;GB of physical memory, the imposed limit is twice the amount of physical memory. For systems with more than 2&nbsp;GB, the imposed limit is the size of physical memory plus 2&nbsp;GB.
fr: Si vous utilisez l'option <option>--grow=</option> sans la valeur <option>--maxsize=</option> sur une partition d'échange (swap), <application>Anaconda</application> limite la taille maximum de la partition d'échange. Pour des systèmes qui disposent de moins de 2 Go de mémoire physique, la limite imposée est de deux fois la quantité de mémoire physique. Pour des systèmes qui disposent de plus de 2 Go de mémoire physique, la limite imposée est égale à la taille de la mémoire physique augmentée de 2 Go.

source: Specifies that the partition should not be formatted, for use with the <option>--onpart</option> command.
fr: Spécifie que la partition ne doit pas être formatée, pour utilisation avec la commande <option>--onpart</option>.

source: Specifies the device on which to place the partition. For example:
fr: Spécifie le périphérique sur lequel placer la partition. Par exemple :

source: The above puts <filename>/home</filename> on <filename>/dev/hda1</filename>.
fr: La commande ci-dessus place la partition <filename>/home</filename> sur le disque <filename>/dev/hda1</filename>.

source: These options can also add a partition to a logical volume. For example:
fr: Ces options peuvent également ajouter une partition à un volume logique. Par exemple :

source: The device must already exist on the system; the <option>--onpart</option> option will not create it.
fr: Le périphérique doit déjà exister sur le système ; l'option <option>--onpart</option> ne le crée pas.

source: <option>--ondisk=</option> or <option>--ondrive=</option>
fr: <option>--ondisk=</option> ou<option>--ondrive=</option>

source: Forces the partition to be created on a particular disk. For example, <option>--ondisk=sdb</option> puts the partition on the second SCSI disk on the system.
fr: Force la création de la partition sur un disque bien particulier. Par exemple, <option>--ondisk=sdb</option> place la partition sur le second disque SCSI du système.

source: To specify a multipath device that does not use <firstterm>logical volume management</firstterm> (LVM), use the format <literal>disk/by-id/dm-uuid-mpath-<replaceable>WWID</replaceable></literal>, where <replaceable>WWID</replaceable> is the <firstterm>world-wide identifier</firstterm> for the device. For example, to specify a disk with WWID <literal>2416CD96995134CA5D787F00A5AA11017</literal>, use:
fr: Pour définir un périphérique multichemin ne devant pas utiliser la <firstterm>gestion de volumes logiques</firstterm> (LVM), utilisez le format <literal>disk/by-id/dm-uuid-mpath-<replaceable>WWID</replaceable></literal>, où <replaceable>WWID</replaceable> est l'<firstterm>identifiant globalement unique</firstterm> du périphérique. Par exemple, pour désigner un disque avec un WWID de <literal>2416CD96995134CA5D787F00A5AA11017</literal>, utilisez :

source: Multipath devices that use LVM are not assembled until after <application>Anaconda</application> has parsed the Kickstart file. Therefore, you cannot specify these devices in the format <literal>dm-uuid-mpath</literal>. Instead, to specify a multipath device that uses LVM, use the format <literal>disk/by-id/scsi-<replaceable>WWID</replaceable></literal>, where <replaceable>WWID</replaceable> is the <firstterm>world-wide identifier</firstterm> for the device. For example, to specify a disk with WWID <literal>58095BEC5510947BE8C0360F604351918</literal>, use:
fr: Les périphériques multichemins qui utilisent LVM ne sont pas assemblés tant qu'<application>Anaconda</application> n'a pas analysé le fichier Kickstart. Par conséquent, vous ne pouvez pas spécifier ces périphériques dans le format <literal>dm-uuid-mpath</literal>. Au lieu de cela, pour spécifier un périphérique multichemin qui utilise LVM, utilisez le format <literal>disk/by-id/scsi-<replaceable>WWID</replaceable></literal>, où <replaceable>WWID</replaceable> est l'<firstterm>identifiant globalement unique</firstterm> du périphérique. Pour spécifier un disque dont le WWID est <literal>58095BEC5510947BE8C0360F604351918</literal>, utilisez :

source: Forces the partition to be allocated as a <emphasis>primary</emphasis> partition. If the partition cannot be allocated as primary (usually due to too many primary partitions being already allocated), the partitioning process will fail. This option only makes sense when the disk uses a Master Boot Record (MBR); for GUID Partition Table (GPT)-labeled disks this option has no meaning. For information about primary (and extended) partitions, see <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Force à allouer la partition en tant que partition <emphasis>primaire</emphasis>. Si la partition ne peut pas être allouée en tant que primaire (ordinairement dû au fait qu'il y a déjà suffisamment de partitions primaires allouées), le partitionnement échoue. Cette option n'a de sens que si le disque utilise un partitionnement MBR ; pour les partitionnements étiquetés GPT, cette option n'a pas de sens. Pour des informations sur les partitions primaires et étendues, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.

source: Specifies a <firstterm>usage type</firstterm> to be passed to the program that makes a filesystem on this partition. A usage type defines a variety of tuning parameters to be used when making a filesystem. For this option to work, the filesystem must support the concept of usage types and there must be a configuration file that lists valid types. For <literal>ext2</literal>, <literal>ext3</literal>, <literal>ext4</literal>, this configuration file is <filename>/etc/mke2fs.conf</filename>.
fr: Spécifie le paramètre <firstterm>usage type</firstterm>(type d'usage) à passer au programme qui crée le système de fichiers sur cette partition. Un type d'usage définit un ensemble de paramètres de peaufinage pour la création du système de fichiers. Pour cette option, le système de fichiers doit prendre en charge le concept de type d'usage et il doit y avoir un fichier de configuration qui liste les types valides. Pour <literal>ext2</literal>, <literal>ext3</literal>, <literal>ext4</literal>, ce fichier de configuration est <filename>/etc/mke2fs.conf</filename>.

source: Sets the file system type for the partition. Valid values are <literal>xfs</literal>, <literal>ext2</literal>, <literal>ext3</literal>, <literal>ext4</literal>, <literal>swap</literal>, <literal>vfat</literal>, <literal>efi</literal> and <literal>biosboot</literal>. For information about supported file systems, see <xref linkend="sect-installation-gui-manual-partitioning-filesystems" />.
fr: Définit le type du système de fichier pour la partition. Les types valides sont <literal>xfs</literal>, <literal>ext2</literal>, <literal>ext3</literal>, <literal>ext4</literal>, <literal>swap</literal>, <literal>vfat</literal>, <literal>efi</literal> et <literal>biosboot</literal>. Pour de l'information sur les systèmes de fichiers pris en charge, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" />.

source: Specifies additional parameters to be passed to the program that makes a filesystem on this partition. No processing is done on the list of arguments, so they must be supplied in a format that can be passed directly to the mkfs program. This means multiple options should be comma-separated or surrounded by double quotes, depending on the filesystem.
fr: Spécifie des paramètres additionnels à passer au programme qui crée le système de fichiers sur cette partition. Aucun traitement n'est effectué, ce qui signifie qu'ils doivent être fournis dans un format directement compréhensible par le programme mkfs. Les options multiples doivent être séparées l'une de l'autre par une virgule ou incluses dans des guillemets anglais doubles selon le système.

source: Assign a label to an individual partition.
fr: Assigne une étiquette à une partition individuelle.

source: Determine the size of the partition automatically. For details about the recommended scheme, see <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Détermine la taille d'une partition automatiquement. Pour des détails sur le schéma recommandé, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.

source: Forces the partition to be created on a particular disk as discovered by the BIOS.
fr: Force la création de la partition sur un disque bien particulier tel que découvert par le BIOS.

source: Specifies that this partition should be encrypted, using the passphrase provided in the <option>--passphrase</option> option. If you do not specify a passphrase, <application>Anaconda</application> uses the default, system-wide passphrase set with the <command>autopart --passphrase</command> command, or stops the installation and prompts you to provide a passphrase if no default is set.
fr: Spécifie que la partition doit être chiffrée en utilisant la phrase de passe fournie par l'option <option>--passphrase</option>. Si vous ne spécifiez pas de phrase de passe, <application>Anaconda</application> utilise la phrase de passe par défaut définie par la commande <command>autopart --passphrase</command> ou arrête l'installation et vous demande d'en fournir une si celle par défaut n'est pas définie.

source: Specifies the passphrase to use when encrypting this partition. You must use this option together with the <option>--encrypted</option> option; by itself it has no effect.
fr: Spécifie la phrase de passe à utiliser lors du chiffrement de cette partition. Vous devez utiliser cette option conjointement avec l'option <option>--encrypted</option> ; en elle-même elle n'a pas d'effet.
