Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: If this option is present, the password argument is assumed to be in plain text. This option is mutually exclusive with <option>--iscrypted</option>
fr: Si cette option n'est pas présente, l'argument « password » (mot de passe) est supposé être en texte simple. Cette option est mutuellement exclusive de l'option <option>--iscrypted</option>.

source: text (optional) - Perform Installation in Text Mode
fr: text (facultative) - Exécution d'une installation en mode texte

source: Perform the Kickstart installation in text mode. Kickstart installations are performed in graphical mode by default.
fr: Effectue l'installation Kickstart en mode texte. Les installations Kickstart sont effectuées en mode graphique par défaut.

source: unsupported_hardware (optional) - Suppress Unsupported Hardware Alerts
fr: unsupported_hardware (facultative) - Supprime les alertes pour matériel non pris en charge

source: Suppress the <guilabel>Unsupported Hardware Detected</guilabel> alert. If this command is not included and unsupported hardware is detected, the installation will stall at this alert.
fr: Supprime les alertes <guilabel>Matériel non pris en charge détecté</guilabel>. Si cette commande n'est pas incluse et qu'un matériel non pris en charge est détecté, l'installation reste bloquée sur cette alerte.

source: vnc (optional) - Configure VNC Access
fr: vnc (facultative) - Configuration de l'accès VNC

source: Allows the graphical installation to be viewed remotely via VNC. This method is usually preferred over text mode, as there are some size and language limitations in text installations. With no additional options, this command will start a VNC server on the installation system with no password and will display the details required to connect to it.
fr: Autorise l'installation graphique à être visible à distance via VNC. Cette méthode est ordinairement préférée à la méthode textuelle, car il existe quelques limitation de taille et de langue dans les installations en mode texte. Sans autre option, cette commande démarre un serveur VNC sur le système d'installation, sans mot de passe, et affiche les détails requis pour s'y connecter.

source: <command>vnc [--host=<replaceable>hostname</replaceable>] [--port=<replaceable>port</replaceable>] [--password=<replaceable>password</replaceable>]</command>
fr: <command>vnc [--host=<replaceable>nom_d_hôte</replaceable>] [--port=<replaceable>port</replaceable>] [--password=<replaceable>mot_de_passe</replaceable>]</command>

source: For more information about VNC installations, including instructions on how to connect to the installation system, see <xref linkend="chap-vnc-installations" />.
fr: Pour plus d'information sur les installations VNC, y compris des instructions sur la manière de se connecter au système d'installation, reportez-vous au <xref linkend="chap-vnc-installations" />.

source: Connect to a VNC viewer listening on the given hostname.
fr: Connectez-vous à une visionneuse VNC à l'écoute sur l'hôte spécifié.

source: Provide a port that the remote VNC viewer process is listening on. If not provided, the VNC default (<literal>5900</literal>) will be used.
fr: Fournissez un numéro de port sur lequel la visionneuse VNC distante est à l'écoute. Si ce numéro de port n'est pas fourni, le VNC utilise le numéro de port par défaut (<literal>5900</literal>).

source: Set a password which must be provided to connect to the VNC session. This is optional, but recommended.
fr: Définissez le mot de passe qui servira à se connecter à la session VNC. Cela est optionnel mais recommandé.

source: After the Installation
fr: Après l'installation

source: This section contains commands which control the system's behavior immediately after the installation finishes.
fr: Cette section contient les commandes qui contrôle le comportement du système immédiatement après la fin de l'installation.

source: %addon com_redhat_kdump (optional) - Configure kdump
fr: %addon com_redhat_kdump (facultative ) - Configuration de kdump

source: This command configures the <application>kdump</application> kernel crash dumping mechanism.
fr: Cette commande configure le mécanisme <application>kdump</application> de recopie d'une partie de la mémoire RAM sur disque lors d'un plantage du noyau (kernel crash dumping mechanism).

source: The syntax for this command is unusual because it is an add-on rather than a built-in Kickstart command. For more information about add-ons, see <xref linkend="sect-kickstart-commands-addon" />.
fr: La syntaxe de cette commande est inhabituelle car il s'agit d'un module additionnel plutôt que d'une commande Kickstart intégrée. Pour plus d'information sur les modules additionnels, reportez-vous à la see <xref linkend="sect-kickstart-commands-addon" />.

source: <application>Kdump</application> is a kernel crash dumping mechanism that allows you to save the contents of the system's memory for later analysis. It relies on <application>kexec</application>, which can be used to start a Linux kernel from the context of another kernel without rebooting the system and preserve the contents of the first kernel memory that would otherwise be lost.
fr: <application>Kdump</application> est un mécanisme de recopie partielle de la mémoire RAM lors d'un plantage du noyau pour analyse ultérieure. Il s'appuie sur le programme <application>kexec</application> qui peut être utilisé pour démarrer un noyau Linux depuis le contexte d'un autre noyau sans nécessiter le redémarrage de la machine et qui préserve le contenu de la mémoire du premier noyau qui autrement serait perdue.

source: In case of a system crash, <application>kexec</application> starts a second kernel (a <firstterm>capture kernel</firstterm>). This capture kernel resides in a reserved part of the system memory that is inaccessible to the main kernel. <application>Kdump</application> then captures the contents of the crashed kernel's memory (a <firstterm>crash dump</firstterm>) and saves it to a specified location. This location can not be configured using Kickstart; it must be specified after the installation by editing the <filename>/etc/kdump.conf</filename> configuration file.
fr: Dans le cas d'un plantage du système, <application>kexec</application> démarre un deuxième noyau (un <firstterm>instantané du noyau</firstterm>). Cet instantané du noyau réside dans une partie réservée de la mémoire du système qui est inaccessible au noyau principal. <application>Kdump</application> capture le contenu de la mémoire du noyau planté (un <firstterm>crash dump</firstterm>) et le sauvegarde dans un emplacement spécifié. Cet emplacement ne peut pas être configuré avec Kickstart ; il doit être spécifié après l'installation en éditant le fichier de configuration <filename>/etc/kdump.conf</filename>.

source: Available options are:
fr: Les options disponibles sont :

source: Enable <application>Kdump</application> on the installed system.
fr: Active <application>Kdump</application> sur le système installé.

source: Do not enable <application>Kdump</application> on the installed system.
fr: N'active pas <application>Kdump</application> sur le système installé.

source: The amount of memory you want to reserve for <application>Kdump</application> in megabytes. For example:
fr: La quantité de mémoire que vous voulez réserver à <application>Kdump</application> en mégaoctets. Par exemple :

source: You can also specify <literal>auto</literal> instead of a numeric value. In that case the installer will determine the amount of RAM to reserve for kdump automatically, based on your system architecture and the total amount of memory on the system.
fr: Vous pouvez également spécifier <literal>auto</literal> au lieu d'une valeur numérique. Dans ce cas, l'installateur détermine la quantité de RAM à réserver à kdump automatiquement, en se basant sur l'architecture de votre système et sur sa quantité totale de mémoire.

source: If you enable <application>Kdump</application> and do not specify the <option>--reserve-mb=</option> option, the <literal>auto</literal> value will be used.
fr: Si vous activez <application>Kdump</application> et que vous ne spécifiez pas l'option <option>--reserve-mb=</option>, la valeur <literal>auto</literal> est utilisée.

source: Enable firmware-assisted dumping on systems which allow it (notably IBM Power&nbsp;Systems servers).
fr: Active le mécanisme de recopie partielle de la mémoire assisté par le micrologiciel sur les systèmes qui l'autorisent (notablement les serveurs IBM Power&nbsp;Systems ).

source: firstboot (optional) - Enable or Disable Initial Setup
fr: firstboot (facultative) - Activation ou désactivation de la configuration initiale

source: Determine whether the <application>Initial Setup</application> application starts the first time the system is booted. If enabled, the <package>initial-setup</package> package must be installed. If not specified, this option is disabled by default. For more information about <application>Initial Setup</application>, see <xref linkend="sect-initial-setup" />.
fr: Détermine si la <application>configuration initiale</application> est lancée la première fois que le système installé démarre. Si cette option est activée, le paquet <package>initial-setup</package> doit être installé. Si elle n'est pas spécifiée, cette option est désactivée par défaut. Pour des informations complémentaires sur la <application>configuration initiale</application>, reportez-vous à la <xref linkend="sect-initial-setup" />.

source: <option>--enable</option> or <option>--enabled</option>
fr: <option>--enable</option> ou <option>--enabled</option>

source: <application>Initial Setup</application> will be started the first time the installed system boots.
fr: La <application>configuration initiale</application> est lancée la première fois que le système installé démarre.

source: <option>--disable</option> or <option>--disabled</option>
fr: <option>--disable</option> ou <option>--disabled</option>

source: <application>Initial Setup</application> will be disabled.
fr: La <application>configuration initiale </application> est désactivée.

source: <application>Initial Setup</application> will start after the reboot in reconfiguration mode. This mode enables the language, mouse, keyboard, root password, security level, time zone and networking configuration options in addition to the default ones.
fr: La <application>configuration initiale </application> est lancée au redémarrage dans le mode reconfiguration. Ce mode active la langue, la souris, le clavier, le mot de passe, le niveau de sécurité, le fuseau horaire et les options de configuration du réseau en plus de celles par défaut.

source: halt (optional) - Halt System After Installation
fr: halt (facultative) - Arrêt du système après l'installation

source: Halt the system after the installation has successfully completed. This is similar to a manual installation, where after the installation finishes, the installer displays a message and waits for the user to press a key before rebooting. During a Kickstart installation, if no completion method is specified, this option is used as the default.
fr: Arrête le système après que l'installation a réussi. Ceci est similaire à une installation manuelle, dans laquelle, après que l'installation se termine, l'installateur affiche un message et attend que l'utilisateur presse une touche avant de redémarrer. Lors d'une installation Kickstart, si aucune méthode d'achèvement n'est spécifiée, cette option est appliquée par défaut.

source: For other completion methods, see the <command>poweroff</command>, <command>reboot</command>, and <command>shutdown</command> commands.
fr: Pour d'autres méthodes d'achèvement, voir les commandes Kickstart <command>poweroff</command>, <command>reboot</command> et <command>shutdown</command>.

source: poweroff (optional) - Power Off After Installation
fr: poweroff (facultative) - Mise hors énergie après l'installation

source: Shut down and power off the system after the installation has successfully completed.
fr: Met le système à l'arrêt et hors énergie après que l'installation a réussi.

source: The <command>poweroff</command> command is highly dependent on the system hardware in use. Specifically, certain hardware components such as the BIOS, APM (advanced power management), and ACPI (advanced configuration and power interface) must be able to interact with the system kernel. Consult your hardware documentation for more information on you system's APM/ACPI abilities.
fr: La commande <command>poweroff</command> (mise hors énergie) dépend beaucoup du matériel du système utilisé. En particulier, certains composants matériels comme le BIOS, l'APM (advanced power management)(gestion avancée de l'énergie) et l'ACPI (advanced configuration and power interface) (configuration avancée et interface énergie) doivent être capable d'interagir avec le noyau du système. Consultez la documentation de votre matériel pour plus d'information sur les capacités APM/ACPI de votre système.

source: For other completion methods, see the <command>halt</command>, <command>reboot</command>, and <command>shutdown</command> Kickstart commands.
fr: Pour d'autres méthodes d'achèvement, voir les commandes Kickstart <command>halt</command>, <command>reboot</command> et <command>shutdown</command>.

source: reboot (optional) - Reboot After Installation
fr: reboot (facultative) - Redémarrage après installation

source: Reboot after the installation is successfully completed. If you are installing &PRODUCT; on IBM System&nbsp;z in command line mode (using <xref linkend="sect-kickstart-commands-cmdline" />), this command is necessary for a fully automated installation.
fr: Redémarre après que l'installation a réussi. Si vous installez &PRODUCT; en ligne de commande sur IBM System&nbsp;z (en utilisant la méthode décrite à la <xref linkend="sect-kickstart-commands-cmdline" />), cette commande est nécessaire pour une installation entièrement automatique.

source: For other completion methods, see the <command>halt</command>, <command>poweroff</command>, and <command>shutdown</command> Kickstart options.
fr: Pour d'autres méthodes d'achèvement, voir les commandes Kickstart <command>halt</command>, <command>poweroff</command> et <command>shutdown</command>.

source: Use of the <command>reboot</command> command <emphasis>may</emphasis> result in an endless installation loop, depending on the installation media and method.
fr: L'utilisation de la commande <command>reboot</command> <emphasis>peut</emphasis> aboutir à une boucle d'installation sans fin, selon le média d'installation et la méthode.

source: Attempt to eject the installation media (if installing from a DVD) before rebooting.
fr: Tente d'éjecter le média d'installation (si vous installez à partir d'un DVD) avant de redémarrer.

source: Use this option to reboot into the new system using the <systemitem>kexec</systemitem> kernel switching mechanism instead of a full reboot, bypassing the BIOS/Firmware and boot loader.
fr: Utilisez cette option pou redémarrer dans le nouveau système en utilisant le mécanisme de commutation de noyau <systemitem>kexec</systemitem> qui contourne le micrologiciel et le chargeur de démarrage, au lieu d'un redémarrage complet

source: shutdown (optional) - Shut Down After Installation
fr: shutdown (facultative) - Arrêt après l'installation

source: Shut down the system after the installation has successfully completed.
fr: Arrêt le système après que l'installation a réussi.

source: For other completion methods, see the <command>halt</command>, <command>poweroff</command>, and <command>reboot</command> Kickstart options.
fr: Pour d'autres méthodes d'achèvement, voir les commandes Kickstart <command>halt</command>, <command>poweroff</command> et <command>reboot</command>.

source: %addon (optional) - Include an Anaconda Add-on
fr: %addon (facultative) - Inclusion d'un module additionnel d'Anaconda

source: You can expand the basic <application>Anaconda</application> and Kickstart functionality by using custom add-ons specified using the <command>%addon</command> section.
fr: Vous pouvez étendre les fonctionnalités d'<application>Anaconda</application> et de Kickstart en utilisant des modules additionnels spécifiés en utilisant la section<command>%addon</command>.

source: To use an add-on in your Kickstart file, add the <command>%addon <replaceable>addon_name</replaceable> <replaceable>options</replaceable></command> command. The section must be closed with an <command>%end</command> statement. For example, to use the <application>Kdump</application> add-on, which is included by default on some installations, use the following block:
fr: Pour utiliser un module additionnel dans votre fichier Kickstart, ajoutez la commande <command>%addon <replaceable>nom_du_module_additionnel</replaceable> <replaceable>options</replaceable></command>. La section doit se terminer par une instruction <command>%end</command>. Par exemple, pour utiliser le module additionnel <application>Kdump</application> qui est inclus par défaut dans certaines installations, utilisez le bloc suivant :

source: The <command>%addon</command> section does not have any options of its own; all options depend on the add-on being used.
fr: La section <command>%addon</command> ne possède pas d'option en propre ; toutes les options dépendent du module additionnel utilisé.

source: For more information about <application>Anaconda</application> add-ons, see the <ulink url="https://vpodzime.fedorapeople.org/anaconda-addon-development-guide/">Fedora Anaconda Addon Development Guide</ulink>.
fr: Pour plus d'information sur les modules additionnels d'<application>Anaconda</application>, lisez le <ulink url="https://vpodzime.fedorapeople.org/anaconda-addon-development-guide/">Fedora Anaconda Addon Development Guide (Guide de développement de modules additionnels pour Fedora Anaconda)</ulink>.

source: %anaconda (optional) - Additional Anaconda Configuration
fr: %anaconda (facultative) - Configuration additionnelle d'Anaconda

source: This section, introduced in &PRODUCT; 22, is used to specify additional configuration options for the installer. Commands inside this section only control the behavior during installation, not on the installed system. The only command currently available inside this section is <xref linkend="sect-kickstart-commands-pwpolicy" />. The <command>%anaconda</command> section must end with <literal>%end</literal>.
fr: Cette section, introduite dans &PRODUCT; 22, est utilisée pour spécifier des options additionnelles de configuration pour l'installateur. Les commandes de cette section ne contrôlent que le comportement durant l'installation, pas sur le système installé. La seule commande actuellement disponible dans cette section est décrite à la <xref linkend="sect-kickstart-commands-pwpolicy" />. La section <command>%anaconda</command> doit se terminer par <literal>%end</literal>.

source: In interactive installations (using the graphical or text interface), the <filename>/usr/share/anaconda/interactive-defaults.ks</filename> file contains the default <command>%anaconda</command> section. To change the defaults, you must create a <filename>product.img</filename> file with a Kickstart file replacing the default one, and pass this file to <application>Anaconda</application> using a boot option.
fr: Dans les installations interactives (utilisant l'interface graphique ou textuelle), le fichier <filename>/usr/share/anaconda/interactive-defaults.ks</filename> contient la section par défaut <command>%anaconda</command>. Pour changer les valeurs par défaut, vous devez créer un fichier <filename>product.img</filename> et un fichier Kickstart pour remplacer celui par défaut, et passer ce fichier à <application>Anaconda</application> en utilisant une option de démarrage.

source: When using a Kickstart file, you can override the default <command>%anaconda</command> section by using the section again in your custom Kickstart.
fr: Lorsque vous utilisez un fichier Kickstart, vous pouvez surcharger la section <command>%anaconda</command> par défaut en utilisant cette section à nouveau dans votre fichier Kickstart personnalisé.

source: %include (optional) - Include Contents of Another File
fr: %include (facultative) - Inclusion du contenu d'un autre fichier

source: Use the <command>%include <replaceable>/path/to/file</replaceable></command> command to include the contents of another file in the Kickstart file as though the contents were at the location of the <command>%include</command> command in the Kickstart file.
fr: Utilisez la commande <command>%include <replaceable>/chemin/du/fichier</replaceable></command> pour inclure le contenu d'un autre fichier dans le fichier Kickstart comme si ce contenu se trouvait à l'emplacement de la commande <command>%include</command> dans le fichier Kickstart.

source: %ksappend (optional) - Append Contents of Another File
fr: %ksappend (facultative) - Ajout du contenu d'un autre fichier

source: The <command>%ksappend <replaceable>url</replaceable></command> directive is very similar to <xref linkend="sect-kickstart-commands-include" /> in that it is used to include the contents of additional files as though they were at the location of the <command>%ksappend</command> command. The difference is in when the two directives are processed.
fr: La commande <command>%ksappend <replaceable>url</replaceable></command> est très similaire à la commande décrite à la <xref linkend="sect-kickstart-commands-include" /> en ce qu'elle est utilisée pour inclure les contenus de fichiers additionnels comme s'ils se trouvaient à l'emplacement de la commande <command>%ksappend</command>. La différence est dans la manière dont ces deux commandes sont traitées.

source: <command>%ksappend</command> is processed in an initial pass, before any other part of the Kickstart file. Then, this expanded Kickstart file is passed to the rest of <application>Anaconda</application> where all <command>%pre</command> scripts are handled, and then finally the rest of the Kickstart file is processed in order, which includes <command>%include</command> directives.
fr: La commande <command>%ksappend</command> est traitée dans une passe intiale, avant tout autre partie du fichier Kickstart. Ensuite, ce fichier Kickstart étendu est passé à l'installateur <application>Anaconda</application>, lequel exécute les scripts <command>%pre</command>, puis, finalement, exécute dans l'ordre le reste du fichier Kickstart, ce qui inclut les commandes <command>%include</command>.

source: Therefore, <command>%ksappend</command> provides a way to include a file containing <command>%pre</command> scripts, while <command>%include</command> does not.
fr: Par conséquent, la commande <command>%ksappend</command> permet d'inclure un fichier contenant des scripts <command>%pre</command> alors que la commande <command>%include</command> ne le permet pas.

source: %packages (required) - Package Selection
fr: %packages (requise) - Sélection des paquets

source: Use the <command>%packages</command> command to begin a Kickstart section which describes the software packages to be installed. This section must end with an <command>%end</command> statement.
fr: Utilisez la déclaration <command>%packages</command> pour commencer une section Kickstart qui décrit quels paquets installer. Cette section doit se terminer par une déclaration <command>%end</command>.
