Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: Name of the password entry. Supported values are <literal>root</literal>, <literal>user</literal> and <literal>luks</literal> for <systemitem>root</systemitem> password, user passwords and LUKS password, respectively.
fr: Nom de l'entrée mot de passe. Les valeurs acceptées sont <literal>root</literal>, <literal>user</literal> et <literal>luks</literal> pour le mot de passe <systemitem>root</systemitem>, les mots de passe utilisateurs et les mots de passe LUKS, respectivement.

source: Sets the minimum allowed password length. The default minimum length is <literal>8</literal>.
fr: Définit la longueur minimum autorisée pour les mots de passe. La longueur minimum par défaut est <literal>8</literal>.

source: Sets the minimum allowed password quality as defined by the <systemitem>libpwquality</systemitem> library. The default value is <literal>50</literal>.
fr: Définit la qualité minimum autorisée pour les mots de passe telle que définie par la bibliothèque <systemitem>libpwquality</systemitem>. La valeur par défaut est <literal>50</literal>.

source: Strict password enforcement. Passwords not meeting the quality requirements specified in <option>--minquality=</option> will not be allowed. Enabled by default.
fr: Application stricte des exigences sur les mots de passe. Les mots de passe qui n'ont pas le niveau de qualité requis tel que spécifié par l'option <option>--minquality=</option> ne sont pas acceptés. Activé par défaut.

source: Passwords <emphasis>not</emphasis> meeting the minimum quality requirements specified in <option>--minquality=</option> will be allowed after <guilabel>Done</guilabel> is clicked twice.
fr: Les mots de passe qui n'ont <emphasis>pas</emphasis> le niveau de qualité requis spécifié par l'option <option>--minquality=</option> sont acceptés après que l'utilisateur a reçu un message d'avertissement et que le bouton <guilabel>Fait</guilabel> a été cliqué deux fois.

source: Allow empty passwords. Enabled by default.
fr: Autorise les mots de passe vides. Activé par défaut.

source: Do not allow empty passwords.
fr: N'autorise pas les mots de passe vides.

source: Allow changing the password in the user interface, even if the Kickstart file already specifies a password.
fr: Autorise le changement de mot de passe dans l'interface utilisateur, même si le fichier Kickstart spécifie déjà un mot de passe.

source: Do not allow changing passwords which are already set in the Kickstart file. Enabled by default.
fr: N'autorise pas le changement des mots de passe déjà définis dans le fichier Kickstart. Activé par défaut.

source: An example use of the <command>pwpolicy</command> command is below:
fr: Un exemple d'utilisation de la commande <command>pwpolicy</command> est fourni ci-après :

source: realm (optional) - Join an Active Directory or IPA Domain
fr: realm (facultative) - Rejoindre une Active Directory ou un domaine IPA

source: Join an Active Directory or IPA domain. For more information about this command, see the <command>join</command> section of the <systemitem>realm(8)</systemitem> man page.
fr: Rejoint une Active Directory ou un domaine IPA. Pour plus d'informations sur cette commande, reportez-vous à la section <command>join</command> de la page de manuel <systemitem>realm(8)</systemitem>.

source: <command>realm join <replaceable>domain</replaceable> [<replaceable>options</replaceable>]</command>
fr: <command>realm join <replaceable>domaine</replaceable> [<replaceable>options</replaceable>]</command>

source: Provide the <firstterm>distinguished name</firstterm> of an organizational unit in order to create the computer account. The exact format of the distinguished name depends on the client software and membership software. The root DSE portion of the distinguished name can usually be left out.
fr: Fournit le nom distinctif (<firstterm>distinguished name</firstterm>) d'une unité d'organisation afin de créer un compte pour l'ordinateur. Le format exact du nom distinctif dépend du logiciel client et du logiciel d'adhésion. La portion rootDSE du nom distinctif peut généralement être omise.

source: Join automatically without a password.
fr: Rejoint automatiquement sans utiliser de mot de passe.

source: Join using a one-time password. This is not possible with all types of realm.
fr: Rejoint en utilisant un mot de passe valable une fois. Cela n'est pas possible avec tous les types de royaume.

source: Only join realms which can run this client software. Valid values include <literal>sssd</literal> and <literal>winbind</literal>. Not all realms support all values. By default, the client software is chosen automatically.
fr: Ne rejoint que les royaumes capables d'exécuter ce logiciel client. Les valeurs valides incluent <literal>sssd</literal> et <literal>winbind</literal>. Toutes les valeurs ne sont pas prises en charge par tous les royaumes. Par défaut, le logiciel client est choisi automatiquement.

source: Only join realms which can run this server software. Possible values include <literal>active-directory</literal> or <literal>freeipa</literal>.
fr: Ne rejoint que les royaumes capables d'exécuter le logiciel serveur. Les valeurs possibles incluent <literal>active-directory</literal> ou <literal>freeipa</literal>.

source: Use this software when joining the realm. Valid values include <literal>samba</literal> and <literal>adcli</literal>. Not all realms support all values. By default, the membership software is chosen automatically.
fr: Utilise ce logiciel lors de l'adhésion au royaume. Les valeurs valides incluent <literal>samba</literal> et <literal>adcli</literal>. Toutes les valeurs ne sont pas prises en charge par tous les royaumes. Par défaut, le logiciel d'adhésion est choisi automatiquement.

source: rootpw (required) - Set Root Password
fr: rootpw (requise) - Définition du mot de passe Root

source: Sets the system's root password to the <replaceable>password</replaceable> argument.
fr: Définit le mot de passe root du système à l'argument <replaceable>mot_de_passe</replaceable>.

source: <command>rootpw [--iscrypted|--plaintext] [--lock] <replaceable>password</replaceable></command>
fr: <command>rootpw [--iscrypted|--plaintext] [--lock] <replaceable>mot_de_passe</replaceable></command>

source: If this option is present, the password argument is assumed to already be encrypted. This option is mutually exclusive with <option>--plaintext</option>. To create an encrypted password, you can use Python:
fr: Si cette option est présente, l'argument password est supposé être déjà chiffré. Cette option est mutuellement exclusive de l'option <option>--plaintext</option>. Pour créer un mot de passe chiffré, vous pouvez utiliser Python :

source: This will generate a SHA512 crypt of your password using your provided salt.
fr: Cela génère une chiffrement SHA512 de votre mot de passe en utilisant le sel que vous avez fourni.

source: If this option is present, the password argument is assumed to be in plain text. This option is mutually exclusive with <option>--iscrypted</option>.
fr: Si cette option est présente, l'argument password est supposé être en texte simple. Cette option est mutuellement exclusive de l'option <option>--iscrypted</option>.

source: If this option is present, the root account is locked by default. This means that the root user will not be able to log in from the console.
fr: Si cette option est présente, le compte root est verrouillé par défaut. Cela signifie que l'utilisateur root ne pourra pas se connecter depuis la console.

source: selinux (optional) - Configure SELinux
fr: selinux (facultative) - Configuration de SELinux

source: Sets the state of SELinux on the installed system. The default policy is <systemitem>enforcing</systemitem>. For more information regarding SELinux in &PRODUCT;, see the <citetitle>&PRODUCT; SELinux User's and Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Définit l'état de SELinux sur le système installé. La politique par défaut est <systemitem>enforcing</systemitem> (forçage de l'application). Pour plus d'information concernant SELinux dans &PRODUCT;, reportez-vous au <citetitle>Guide de l'utilisateur et de l'administrateur SELinux de &PRODUCT;</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: Enables SELinux with the default targeted policy being <systemitem>enforcing</systemitem>.
fr: Active SELinux avec la politique cible par défaut <systemitem>enforcing</systemitem>(forçage de l'application).

source: Enables SELinux with the default targeted policy being <systemitem>permissive</systemitem>. This policy outputs warnings based on the SELinux policy, but does not actually enforce the policy.
fr: Active SELinux avec la politique cible par défaut <systemitem>permissive</systemitem>. Cette politique émet des avertissements basés sur la politique SELinux sans pour autant en forcer l'application.

source: Disables SELinux completely.
fr: Désactive complètement SELinux.

source: sshkey (optional) - Add an Authorized SSH Key
fr: sshkey (facultative) - Ajout d'une clé SSH autorisée

source: Use this command to add a specified <systemitem>SSH</systemitem> key to an user's <filename>authorized_keys</filename> file. The specified user must either be <systemitem>root</systemitem>, or it must be created in the Kickstart file - either automatically by an installed package, or using <xref linkend="sect-kickstart-commands-user" />.
fr: Utilisez cette commande pour ajouter une clé <systemitem>SSH</systemitem> spécifiée au fichiers des <filename>authorized_keys</filename> (clés autorisées) d'un utilisateur. L'utilisateur spécifié peut être, soit <systemitem>root</systemitem>, soit un utilisateur créé dans le fichier Kickstart – soit automatiquement par un paquet installé, soit en utilisant la commande décrite à la <xref linkend="sect-kickstart-commands-user" />.

source: <command>sshkey --username=<replaceable>user</replaceable> "<replaceable>ssh_key</replaceable>"</command>
fr: <command>sshkey --username=<replaceable>utilisateur</replaceable> "<replaceable>empreinte_clé_ssh</replaceable>"</command>

source: The <replaceable>ssh_key</replaceable> must be a full <systemitem>SSH</systemitem> key fingerprint, and it must be enclosed in quotes (<literal>""</literal>) because the key may contain spaces.
fr: La valeur <replaceable>empreinte_clé_ssh</replaceable> doit être une empreinte de clé <systemitem>SSH</systemitem> complète et doit être entourée de guillemets anglais doubles (<literal>""</literal>) car elle peut contenir des espaces.

source: The name of the user account to which you want to install the <systemitem>SSH</systemitem> key.
fr: Le nom du compte utilisateur sur lequel vous voulez installer la clé <systemitem>SSH</systemitem>.

source: user (optional) - Create User Account
fr: user (facultative) - Création d'un compte utilisateur

source: Creates a new user on the system.
fr: Crée un utilisateur sur le système.

source: <command>user --name=<replaceable>username</replaceable> [<replaceable>options</replaceable>]</command>
fr: <command>user --name=<replaceable>nom_d_utilisateur</replaceable> [<replaceable>options</replaceable>]</command>

source: Provides the name of the user. This option is required.
fr: Fournit le nom de l'utilisateur. Cette option est requise.

source: Provides the GECOS information for the user. This is a string of various system-specific fields separated by a comma. It is frequently used to specify the user's full name, office number, etc. See the <systemitem>passwd(5)</systemitem> man page for more details.
fr: Fournit les informations GECOS sur l'utilisateur. Il s'agit d'une chaîne de divers champs spécifiques au système séparés par un virgule. Elle est fréquemment utilisée pour spécifier le nom complet de l'utilisateur, son numéro professionnel, etc. Consultez la page de manuel <systemitem>passwd(5)</systemitem> pour plus de détails.

source: In addition to the default group, a comma separated list of group names the user should belong to. The groups must exist before the user account is created. See <xref linkend="sect-kickstart-commands-group" />.
fr: En plus du groupe par défaut, une liste de noms de groupe, séparés l'un de l'autre par une virgule, auxquels l'utilisateur doit appartenir. Les groupes doivent exister avant la création du compte utilisateur. Voir la <xref linkend="sect-kickstart-commands-group" />.

source: The home directory for the user. If not provided, this defaults to <filename>/home/<replaceable>username</replaceable></filename>.
fr: Le dossier home de l'utilisateur. S'il n'est pas fourni, le dossier par défaut est <filename>/home/<replaceable>nom_d_utilisateur</replaceable></filename>.

source: If this option is present, this account is locked by default. This means that the user will not be able to log in from the console.
fr: Si cette option est présente, ce compte est verrouillé par défaut. Cela signifie que l'utilisateur ne sera pas capable de se connecter à partir de la console.

source: The new user's password. If no password is provided, the account will be locked.
fr: Le mot de passe du nouvel utilisateur. Si aucun mot de passe n'est fourni, le compte est verrouillé.

source: The user's login shell. If not provided, the system default will be used.
fr: Le shell de connexion de l'utilisateur. S'il n'est pas fourni, le shell par défaut du système est utilisé.

source: The <firstterm>UID</firstterm> (User ID). If not provided, this defaults to the next available non-system UID.
fr: Lidentifiant utilisateur (<firstterm>UID</firstterm> – User ID). S'il n'est pas fourni, la valeur prise par défaut est la prochaine valeur disponible qui ne correspond pas à un identifiant système.

source: The <firstterm>GID</firstterm> (Group ID) to be used for the user's default group. If not provided, this defaults to the next available non-system group ID.
fr: L'identifiant de groupe (<firstterm>GID</firstterm> – Group ID) à utiliser pour le groupe d'appartenance par défaut de l'utilisateur. S'il n'est pas fourni, la valeur prise par défaut est la prochaine valeur disponible qui ne correspond pas à un identifiant système.

source: Installation Environment
fr: Environnement d'installation

source: The following commands control how the system will behave during the installation.
fr: Les commandes suivantes contrôlent le comportement du système durant l'installation.

source: autostep (optional) - Go Through Every Screen
fr: autostep (facultative) - Traversée de tous les écrans

source: Normally, Kickstart installations skip unnecessary screens. This option makes the installation program step through every screen, displaying each briefly. This option should not be used when deploying a system because it may disrupt package installation.
fr: Normalement, les installations Kickstart passent les écrans non nécessaires. Cette option oblige l'installateur a les traverser tous, en les affichant brièvement. Cette option ne doit pas être utilisée lors du déploiement d'un système parce que cela peut interrompre l'installation des paquets.

source: Take a screenshot at every step during installation. These screenshots are stored in <filename class="directory">/tmp/anaconda-screenshots</filename> during the installation, and after the installation finishes you can find them in <filename class="directory">/root/anaconda-screenshots</filename>.
fr: Effectue une capture d'écran à chaque étape de l'installation. Ces captures sont stockées dans le dossier <filename class="directory">/tmp/anaconda-screenshots</filename> pendant l'installation. Dès que l'installation est terminée, vous pouvez les retrouver dans le dossier <filename class="directory">/root/anaconda-screenshots</filename>.

source: Each screen is only captured right before the installer switches to the next one. This is important, because if you do not use all required Kickstart options and the installation therefore does not begin automatically, you can go to the screens which were not automatically configured, perform any configuration you want. Then, when you press <guilabel>Done</guilabel> to continue, the screen will be captured including the configuration you just provided.
fr: Chaque écran est capturé au moment précis où l'installateur passe au suivant. Ceci est important car si vous n'utilisez par toutes les options Kickstart requises et que, en conséquence, l'installation ne commence pas automatiquement, vous pouvez parcourir les écrans qui n'ont pas été configurés automatiquement et y saisir la configuration que vous voulez. Ensuite, vous cliquez sur le bouton <guilabel>Fait</guilabel> pour continuer, l'écran est capturé avec la configuration que vous avez saisie.

source: cmdline (optional) - Perform Installation in Command Line Mode
fr: cmdline (facultative) - Exécution de l'installation en mode ligne de commande

source: Perform the installation in a completely non-interactive command line mode. Any prompts for interaction halts the install. This mode is useful on IBM System&nbsp;z systems with the x3270 terminal.
fr: Effectue l'installation dans un mode ligne de commande complètement non-interactif. Toute invite pour interaction stoppe l'installateur. Ce mode est utile sur les systèmes IBM System&nbsp;z avec le terminal x3270.

source: For a fully automatic installation, you must either specify one of the available modes (<command>graphical</command>, <command>text</command>, or <command>cmdline</command>) in the Kickstart file, or you must use the <option>console=</option> boot option as described in <xref linkend="sect-boot-options-display" />. Otherwise the system will halt and ask you to choose a mode.
fr: Pour une installation totalement automatique, vous devez spécifier, soit l'un des modes disponibles (<command>graphical</command>, <command>text</command>, ou <command>cmdline</command>) dans le fichier Kickstart, soit utiliser l'option de démarrage <option>console=</option> décrite à la <xref linkend="sect-boot-options-display" />. Autrement, les système s'arrête et vous demande de choisir un mode.

source: graphical (optional) - Perform Installation in Graphical Mode
fr: graphical (facultative) - Exécution de l'installation en mode graphique

source: Perform the installation in graphical mode. This is the default. This command takes no options.
fr: Effectue l'installation en mode graphique. C'est le mode par défaut. Cette commande ne prend pas d'option.

source: logging (optional) - Configure Error Logging During Installation
fr: logging (facultative) - Configuration de la journalisation des erreurs pendant l'installation

source: Controls the error logging of <application>Anaconda</application> during installation. It has no effect on the installed system.
fr: Contrôle la journalisation des erreurs d'<application>Anaconda</application> durant l'installation. Elle reste sans effet sur le système installé.

source: Send logging information to the given remote host, which must be running a <systemitem class="service">syslogd</systemitem> process configured to accept remote logging.
fr: Envoie les informations de connexion à l'hôte distant spécifié qui doit exécuter un démon <systemitem class="service">syslogd</systemitem> configuré pour accepter la journalisation distante.

source: If the remote syslogd process uses a port other than the default, it may be specified with this option.
fr: Si le syslogd distant utilise un port autre que le port par défaut, il peut être spécifié avec cette option.

source: Specify the minimum level of messages that appear on virtual console 3 (<systemitem>tty3</systemitem>). This only affects messages printed to the console; log files will contain messages of all levels. Possible values are <literal>debug</literal>, <literal>info</literal>, <literal>warning</literal>, <literal>error</literal>, or <literal>critical</literal>.
fr: Spécifiez le niveau minimum des messages que sont envoyés sur la console virtuelle n° 3 (<systemitem>tty3</systemitem>). Cela n'affecte que les messages envoyés à la console ; les fichiers de journalisation contiendront des messages de tout niveau. Les valeurs possibles sont <literal>debug</literal>, <literal>info</literal>, <literal>warning</literal>, <literal>error</literal> ou <literal>critical</literal>.

source: rescue (optional) - Rescue Mode
fr: rescue (facultative) - Mode de sauvetage

source: Automatically enters the installation program's rescue mode. This gives you a chance to repair the system in case of any problems.
fr: Entre automatiquement dans le mode sauvetage de l'installateur. Cela vous donne une chance de réparer le système en cas de problème.

source: Controls how the installed system is mounted in the rescue environment. By default, the installation program will find your system and mount it in read-write mode, telling you where it has performed this mount. You may optionally choose to not mount anything (the <option>--nomount</option> option) or mount in read-only mode (the <option>--romount</option> option). Only one of these two options may be used.
fr: Contrôle la manière dont le système installé est monté dans l'environnement de sauvetage. Par défaut, l'installateur trouve votre système, le monte en mode lecture/écriture et vous dit où il l'a monté. Vous pouvez en option choisir de ne rien monter ( l'option <option>--nomount</option> option) ou de monter en mode read/only (lecture-seule) (l'option <option>--romount</option>). Une seule de ces deux options peut être utilisée.

source: sshpw (optional) - Restrict ssh Access During Installation
fr: sshpw (facultative) - Restriction de l'accès ssh pendant l'installation

source: During the installation, you can interact with the installation program and monitor its progress over an <systemitem>SSH</systemitem> connection. Use the <command>sshpw</command> command to create temporary accounts through which to log on. Each instance of the command creates a separate account that exists only in the installation environment. These accounts are not transferred to the installed system.
fr: Pendant l'installation, vous pouvez interagir avec l'installateur et surveiller son avancement à travers une connexion <systemitem>SSH</systemitem>. Utilisez la commande <command>sshpw</command> pour créer un compte temporaire pour vous connecter. Chaque instance de la commande crée un compte séparé qui n'existe que durant l'installation. Ces comptes ne sont pas transférés sur le système installé.

source: <command>sshpw --username=<replaceable>name</replaceable> <replaceable>password</replaceable> [--iscrypted|--plaintext] [--lock]</command>
fr: <command>sshpw --username=<replaceable>nom</replaceable> <replaceable>mot_de_passe</replaceable> [--iscrypted|--plaintext] [--lock]</command>

source: By default, the <systemitem>ssh</systemitem> server is not started during the installation. To make <systemitem>ssh</systemitem> available during the installation, boot the system with the kernel boot option <option>inst.sshd</option>. See <xref linkend="sect-boot-options-display" /> for details.
fr: Par défaut le serveur <systemitem>ssh</systemitem> n'est pas démarré pendant l'installation. Pour rendre <systemitem>ssh</systemitem> disponible pendant l'installation, démarrez le système avec l'option de démarrage du noyau <option>inst.sshd</option>. Reportez-vous à la <xref linkend="sect-boot-options-display" /> pour les détails.

source: If you want to disable root <systemitem class="protocol">ssh</systemitem> access to your hardware during installation, use the following:
fr: Si vous voulez désactiver l'accès <systemitem class="protocol">ssh</systemitem> à votre matériel pour root durant l'installation, utilisez ce qui suit :
