Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: For an example of a post-installation script, see <xref linkend="sect-kickstart-example-post-script" />.
fr: Pour un exemple de script post-installation, voir la <xref linkend="sect-kickstart-example-post-script" />.

source: Example Kickstart Configurations
fr: Exemples de configurations Kickstart

source: Advanced Partitioning Example
fr: Exemple de partitionnement avancé

source: The following is an integrated example showing the <command>clearpart</command>, <command>zerombr</command>, <command>part</command>, <command>raid</command>, <command>volgroup</command>, and <command>logvol</command> Kickstart options in action:
fr: Ce qui suit est un exemple intégré montrant des options Kickstart <command>clearpart</command>, <command>zerombr</command>, <command>part</command>, <command>raid</command>, <command>volgroup</command> et <command>logvol</command> en action :

source: This advanced example implements LVM over RAID, as well as the ability to resize various directories for future growth.
fr: Cet exemple avancé met en œuvre LVM sur un RAID, de même que la possibilité de redimensionner les divers répertoires en prévision de futur grossissement.

source: First, the <command>clearpart</command> command is used on drives <systemitem>hda</systemitem> and <systemitem>hdc</systemitem> to wipe them. The <command>zerombr</command> command initializes unused partition tables.
fr: Tout d'abord, la commande <command>clearpart</command> est exécutée sur les disques <systemitem>hda</systemitem> et <systemitem>hdc</systemitem> pour les nettoyer. La commande <command>zerombr</command> initialise les tables de partitions inutilisées.

source: Then, the two drives are partitioned to prepare them for RAID configuration. Each drive is divided into five partitions, and each drive is partitioned into an identical layout.
fr: Ensuit, les deux disques sont partitionnés pour les préparer à accueillir une configuration RAID. Chaque disque est divisé en cinq partitions et partitionné selon le même schéma de partitionnement.

source: The next part uses these pairs of physical partitions to create a software RAID device with RAID1 level (mirroring). The first four RAID devices are used for <filename>/</filename> (root), <filename>/safe</filename>, <systemitem>swap</systemitem> and <filename>/usr</filename>. The fifth, largest pair of partitions is named <literal>pv.01</literal> and will be used in the following part as a physical volume for LVM.
fr: La partie suivante utilise ces paires de partitions physiques pour créer un périphérique RAID logiciel de niveau 1 (mirroring). Les quatre premiers périphériques RAID sont utilisés pour <filename>/</filename> (root), <filename>/safe</filename>, <systemitem>swap</systemitem> et <filename>/usr</filename>. La cinquième paire, la plus volumineuse, est nommée <literal>pv.01</literal> et est utilisée dans la partie suivante en tant que volume physique pour LVM.

source: Finally, the last set of commands first creates a volume group named <literal>sysvg</literal> on the <literal>pv.01</literal> physical volume. Then, three logical volumes (<literal>/var</literal>, <literal>/var/freespace</literal> and <literal>/usr/local</literal>) are created and added to the <literal>sysvg</literal> volume group. The <literal>/var</literal> and <literal>/var/freespace</literal> volumes have a set size of 8 GB, and the <literal>/usr/local</literal> volume uses the <option>--grow</option> option to fill all remaining available space.
fr: Pour finir, le dernier ensemble de commandes crée un groupe de volumes nommé <literal>sysvg</literal> sur le volume physique <literal>pv.01</literal>. Ensuite, trois volumes logiques (<literal>/var</literal>, <literal>/var/freespace</literal> et <literal>/usr/local</literal>) sont créés et ajoutés au groupe de volumes <literal>sysvg</literal>. Les volumes <literal>/var</literal> et <literal>/var/freespace</literal> ont une taille fixée à 8 Mo, et le volume <literal>/usr/local</literal> utilise l'option <option>--grow</option> pour remplir tout l'espace disponible restant.

source: The above example uses identifiers <systemitem>hda</systemitem> and <systemitem>hdc</systemitem> to identify disk drives. You should use unique identifiers, such as a disk labels or an UUIDs, to identify disk drives. See the note in introduction to this appendix.
fr: L'exemple ci-dessus utilise les identifiants <systemitem>hda</systemitem> et <systemitem>hdc</systemitem> pour identifier les disques. Vous devez plutôt utiliser des identifiants uniques tels que les étiquettes de disque ou les UUID pour identifier les disques. Voir la note dans l'introduction de cet appendice.

source: Example Pre-installation Script
fr: Exemple de script de pre-installation

source: The following is an example <command>%pre</command> section:
fr: Ce qui suit est un exemple de section <command>%pre</command> :

source: Sample %pre Script
fr: Exemple de script %pre

source: This script determines the number of hard drives in the system and writes a text file with a different partitioning scheme depending on whether it has one or two drives. Instead of having a set of partitioning commands in the Kickstart file, include the following line:
fr: Ce script détermine le nombre de disques durs sur le système et écrit un fichier de texte avec un schéma de partitionnement différent qui dépend de l'existence d'un ou de deux disques. Au lieu d'avoir un ensemble de commande de partitionnement dans le fichier Kickstart, incluez la ligne suivante :

source: The partitioning commands selected in the script will be used.
fr: Les commandes de partitionnement sélectionnées dans le script seront utilisées.

source: Example Post-installation Script
fr: Exemple de script post-installation

source: The following is an example <command>%post</command> section:
fr: Ce qui suit est un exemple de section <command>%post</command> :

source: Sample %post Script
fr: Exemple de script %post

source: The above example mounts an NFS share and executes a script named <filename>runme</filename> located at <filename>/usr/new-machines/</filename> on the share. Note that NFS file locking is <emphasis>not</emphasis> supported while in Kickstart mode, therefore the <option>-o nolock</option> option is required.
fr: L'exemple ci-dessus monte un partage NFS et exécute un script nommé <filename>runme</filename> situé dans le dossier <filename>/usr/new-machines/</filename> sur le partage. Notez que le verrouillage de fichiers NFS n'est <emphasis>pas</emphasis> pris en charge en mode Kickstart. Par conséquent l'option <option>-o nolock</option> est requise.
