Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: Modifies the default set of services that will run under the default <application>systemd</application> target. The list of disabled services is processed before the list of enabled services - therefore, if a service appears on both lists, it will be enabled.
fr: Modifie le jeu de services par défaut qui fonctionneront sous la cible <application>systemd</application> par défaut. La liste des services désactivés est traitée avant la liste des services activés – par conséquent, si un service apparaît dans les deux listes il est activé.

source: <command>services [--disabled=<replaceable>list</replaceable>] [--enabled=<replaceable>list</replaceable>]</command>
fr: <command>services [--disabled=<replaceable>liste</replaceable>] [--enabled=<replaceable>liste</replaceable>]</command>

source: Do not include spaces in the list of services. If you do, Kickstart will enable or disable only the services up to the first space. For example:
fr: N'incluez pas d'espaces dans la liste des services. Si vous le faites, Kickstart n'active, ou ne désactive, que les services placés avant la première espace. Par exemple :

source: The above will disable only the <systemitem>auditd</systemitem> service. To disable all four services, the entry should include no spaces:
fr: La ligne précédent ne désactive que le service <systemitem>auditd</systemitem>. Pour que les trois autres soient désactivés, l'entrée ne doit pas comprendre d'espace.

source: Disable the services given in the comma separated list.
fr: Désactive les services indiqués dans la liste dont les éléments sont séparés par une virgule.

source: Enable the services given in the comma separated list.
fr: Active les services indiqués dans la liste dont les éléments sont séparés par une virgule.

source: skipx (optional) - Do Not Configure X Window System
fr: skipx (facultative) - Non configuration du système X Window

source: If present, <application>X</application> will not be configured on the installed system.
fr: Si cette option est présente, l'application <application>X</application> ne sera pas configurée sur le système installé.

source: If you install a display manager among your package selection options, this package will create an <application>X</application> configuration, and the installed system will default to <systemitem>graphical.target</systemitem>. The effect of the <command>skipx</command> option will be overridden.
fr: Si vous installez un gestionnaire d'affichage parmi les options de sélection de paquets, ce paquet provoque la création d'une configuration de <application>X</application> et le système installé utilise <systemitem>graphical.target</systemitem> par défaut. L'effet de l'option <command>skipx</command> est outrepassé.

source: timezone (optional) - Configure Time Zone
fr: timezone (facultative) - Configuration du fuseau horaire

source: Sets the system time zone to <replaceable>timezone</replaceable>. To view a list of available time zones, use the <command>timedatectl list-timezones</command> command.
fr: Définit le fuseau horaire à <replaceable>fuseau_horaire</replaceable>. Pour voir une liste des tous les fuseaux horaires disponibles, utilisez la commande <command>timedatectl list-timezones</command>.

source: <command>timezone <replaceable>timezone</replaceable> [<replaceable>options</replaceable>]</command>
fr: <command>timezone <replaceable>fuseau_horaire</replaceable> [<replaceable>options</replaceable>]</command>

source: If present, the system assumes the hardware clock is set to UTC (Greenwich Mean) time.
fr: Si cette option est présente, le système suppose que l'horloge matérielle est réglée au temps UTC (Temps moyen du méridien de Greewich).

source: Disable the NTP service automatic starting.
fr: Désactive le démarrage automatique du service NTP.

source: Specify a list of NTP servers to be used as a comma-separated list without spaces.
fr: Spécifie une liste de serveurs NTP à utiliser ; la liste est formée de noms séparés l'un de l'autre par une virgule et sans aucune espace.

source: xconfig (optional) - Configure X Window System
fr: xconfig (facultative) - Configuration du système X Window

source: Configures the <application>X Window System</application>. If you install the <application>X Window System</application> with a Kickstart file that does not include the <command>xconfig</command> command, you must provide the <application>X</application> configuration manually during installation.
fr: Configure l'application <application>X Window System</application>. Si vous installez l'application <application>X Window System</application> avec un fichier Kickstart qui ne comprend pas la commande <command>xconfig</command>, vous devez fournir la configuation de <application>X</application> à la main durant l'installation.

source: Do not use this command in a Kickstart file that does not install the <application>X Window System</application>.
fr: N'utilisez pas cette commande dans un fichier Kickstart qui n'installe pas l'application <application>X Window System</application>.

source: Specify either <literal>GNOME</literal> or <literal>KDE</literal> to set the default desktop (assumes that <application>GNOME Desktop Environment</application> and/or <application>KDE Desktop Environment</application> has been installed in the <command>%packages</command> section).
fr: Spécifiez <literal>GNOME</literal> ou <literal>KDE</literal> pour définir l'environnement de bureau par défaut (cela suppose que <application>GNOME Desktop Environment</application> et/ou <application>KDE Desktop Environment</application> a(ont) été installé(s) dans la section <command>%packages</command>).

source: Use a graphical login on the installed system.
fr: Utilise un écran de connexion graphique sur le système installé.

source: Users, Groups and Authentication
fr: Utilisateurs, groupes et authentification

source: The commands below are used to control user accounts, groups, and related areas.
fr: Les commandes qui suivent sont utilisées pour gérer les comptes utilisateurs, les groupes et les sujets connexes.

source: auth or authconfig (optional) - Configure Authentication
fr: auth or authconfig (facultative) - Configuration de l'authentification

source: Sets up the authentication options for the system using the <command>authconfig</command> command, which can also be run on a command line after the installation finishes. See the <systemitem>authconfig(8)</systemitem> manual page and the <command>authconfig --help</command> command for more details. Passwords are shadowed by default.
fr: Définit les options d'authentification pour le système en utilisant la commande <command>authconfig</command>, qui peut aussi être exécutée en ligne de commande sur le système installé. Consultez la page de manuel <systemitem>authconfig(8)</systemitem> et la sortie de la commande <command>authconfig --help</command> pour plus de détails. Les mots de passe sont masqués par défaut.

source: Turns on NIS support. By default, <option>--enablenis</option> uses whatever domain it finds on the network. A domain should almost always be set by hand with the <option>--nisdomain=</option> option.
fr: Active la prise en charge du service d'information réseau (NIS) . Par défaut, <option>--enablenis</option> utilise n'importe quel domaine trouvé sur le réseau. Un domaine doit toujours être défini à la main avec l'option <option>--nisdomain=</option> option.

source: NIS domain name to use for NIS services.
fr: Nom de domaine NIS à utiliser pour les services NIS.

source: Server to use for NIS services (broadcasts by default).
fr: Serveur à utiliser pour les services NIS (diffusion par défaut).

source: <option>--useshadow</option>or <option>--enableshadow</option>
fr: <option>--useshadow</option>ou <option>--enableshadow</option>

source: Use shadow passwords. Active by default.
fr: Utilise des mots de passe cachés. Actif par défaut.

source: Turns on LDAP support in <filename>/etc/nsswitch.conf</filename>, allowing your system to retrieve information about users (for example, their UIDs, home directories, and shells) from an LDAP directory. To use this option, you must install the <package>nss-pam-ldapd</package> package. You must also specify a server and a base <firstterm>DN</firstterm> (distinguished name) with <option>--ldapserver=</option> and <option>--ldapbasedn=</option>.
fr: Active la prise en charge de LDAP (Local Automatic Data Processing) (Traitement automatique local des données) dans <filename>/etc/nsswitch.conf</filename> permettant à votre système de retrouver des informations sur les utilisateurs (par exemple, leur UID, leur dossier home et leurs shells) depuis un répertoire LDAP. Pour utiliser cette option, vous devez installer le paquet <package>nss-pam-ldapd</package> package. Vous devez également spécifier un serveur et une base <firstterm>DN</firstterm> (distinguished name)(nom distinctif) avec les options <option>--ldapserver=</option> et <option>--ldapbasedn=</option>.

source: Use LDAP as an authentication method. This enables the <systemitem>pam_ldap</systemitem> module for authentication and changing passwords, using an LDAP directory. To use this option, you must have the <package>nss-pam-ldapd</package> package installed. You must also specify a server and a base DN with <option>--ldapserver=</option> and <option>--ldapbasedn=</option>. If your environment does not use <firstterm>TLS</firstterm> (Transport Layer Security), use the <option>--disableldaptls</option> switch to ensure that the resulting configuration file works.
fr: Utilise LDAP comme méthode d'authentification. Ceci active le module <systemitem>pam_ldap</systemitem> pour authentification et changement des mots de passe en utilisant un répertoire LDAP. Pour utiliser cette option, vous devez avoir installé le paquet <package>nss-pam-ldapd</package>. Vous devez aussi spécifier un serveur et une base DN avec les options <option>--ldapserver=</option> et <option>--ldapbasedn=</option>. Si votre environnement n'utilise pas <firstterm>TLS</firstterm> (Transport Layer Security)(Sécurité de la couche transport), utilisez le commutateur <option>--disableldaptls</option> pour être sûr que la configuration résultante fonctionne.

source: If you specified either <option>--enableldap</option> or <option>--enableldapauth</option>, use this option to specify the name of the LDAP server to use. This option is set in the <filename>/etc/ldap.conf</filename> file.
fr: Si vous avez spécifié l'option <option>--enableldap</option> ou l'option <option>--enableldapauth</option>, utilisez cette option pour spécifier le nom du serveur LDAP à utiliser. Cette option est définie dans le fichier <filename>/etc/ldap.conf</filename>.

source: If you specified either <option>--enableldap</option> or <option>--enableldapauth</option>, use this option to specify the DN in your LDAP directory tree under which user information is stored. This option is set in the <filename>/etc/ldap.conf</filename> file.
fr: Si vous avez spécifié l'option <option>--enableldap</option> ou l'option <option>--enableldapauth</option>, utilisez cette option pour spécifier le DN dans votre arbre de dossiers LDAP sous lequel les informations utilisateur sont stockées. Cette option est définie dans le fichier <filename>/etc/ldap.conf</filename>.

source: Use TLS (Transport Layer Security) lookups. This option allows LDAP to send encrypted usernames and passwords to an LDAP server before authentication.
fr: Utilise des recherches TLS (Transport Layer Security)(Sécurité de la couche transport). Cette option autorise LDAP à envoyer des noms d'utilisateur et des mots de passe chiffrés à un serveur LDAP avant authentification.

source: Do not use TLS (Transport Layer Security) lookups in an environment that uses LDAP for authentication.
fr: N'utilise pas les recherches TLS (Transport Layer Security)(Sécurité de la couche transport) dans un environnemnt qui utilise LDAP pour l'authentification.

source: Use Kerberos 5 for authenticating users. Kerberos itself does not know about home directories, UIDs, or shells. If you enable Kerberos, you must make users' accounts known to this workstation by enabling LDAP, NIS, or Hesiod or by using the <command>useradd</command> command. If you use this option, you must have the <package>pam_krb5</package> package installed.
fr: Utilise Kerberos 5 pour authentifier les utilisateurs. Kerberos lui-même ne connaît rien sur les dossiers home, les UIDs ou les shells. Si vous activez Kerberos, vous devez faire connaître les comptes utilisateurs à cette station de travail en activant LDAP, NIS ou Hisiod ou un utilisant la commande <command>useradd</command>. Si vous utilisez cette option, vous devez avoir le paquet <package>pam_krb5</package> installé.

source: The Kerberos 5 realm to which your workstation belongs.
fr: Le royaume Kerberos auquel votre station de travail appartient.

source: The KDC (or KDCs) that serve requests for the realm. If you have multiple KDCs in your realm, use a comma-separated list without spaces.
fr: Le KDC (Key Distribution Center) (Centre de distribution de clés) ou les KDCs qui servent les requêtes pou le royaume. Si vous avez plusieurs KDCs dans votre royaume, utilisez une liste dont les éléments sont séparés par une virgule sans aucune espace.

source: The KDC in your realm that is also running kadmind. This server handles password changing and other administrative requests. This server must be run on the master KDC if you have more than one KDC.
fr: Le KDC de votre royaume qui exécute également kadmind. Ce serveur sert les requêtes de changement de mot de passe ainsi que d'autres requêtes administratives. Ce serveur doit être exécuté sur votre KDC maître si vous avez plus d'un KDC.

source: Enables Hesiod support for looking up user home directories, UIDs, and shells. More information on setting up and using Hesiod on your network is in <filename>/usr/share/doc/glibc-2.x.x/README.hesiod</filename>, which is included in the <package>glibc</package> package. Hesiod is an extension of DNS that uses DNS records to store information about users, groups, and various other items.
fr: Active la prise en charge d'Hesiod pour les recherches des dossiers home des utilisateur, des UIDs et des shells. Plus d'information sur la configuration et l'utilisation de Hesiod sur votre réseau est disponible dans le fichier <filename>/usr/share/doc/glibc-2.x.x/README.hesiod</filename> qui est inclus dans le paquet <package>glibc</package>. Hesiod est une extension de DNS qui utilise les enregistrements DNS pour stocker des informations sur les utilisateurs, les groupes et des tas d'autres items.

source: The <systemitem>Hesiod</systemitem> LHS (left-hand side) and RHS (right-hand side) values, set in <filename>/etc/hesiod.conf</filename>. The <systemitem>Hesiod</systemitem> library uses these values to search DNS for a name, similar to the way that <systemitem>LDAP</systemitem> uses a base DN.
fr: Les valeurs <systemitem>Hesiod</systemitem> LHS (left-hand side) (coté gauche) et RHS (right-hand side) (coté droit) définies dans le fichier <filename>/etc/hesiod.conf</filename>. La bibliothèque <systemitem>Hesiod</systemitem> utilise ces valeurs pour interroger un DNS sur un nom, à la façon dont <systemitem>LDAP</systemitem> utilise une base DN.

source: To look up user information for the username <systemitem>jim</systemitem>, the Hesiod library looks up <literal>jim.passwd<replaceable>LHS</replaceable><replaceable>RHS</replaceable></literal>, which should resolve to a TXT record that contains a string identical to an entry for that user in the <filename>passwd</filename> file: <computeroutput>jim:*:501:501:Jungle Jim:/home/jim:/bin/bash</computeroutput>. To look up groups, the Hesiod library looks up <literal>jim.group<replaceable>LHS</replaceable><replaceable>RHS</replaceable></literal> instead.
fr: Pour rechercher le nom d'utilisateur <systemitem>jim</systemitem> dans les informations utilisateur, la bibliothèque Hesiod recherche <literal>jim.passwd<replaceable>LHS</replaceable><replaceable>RHS</replaceable></literal>, qui devrait se résoudre en un enregistrement TXT qui contient une chaîne identique à une entrée pour cet utilisateur dans le fichier <filename>passwd</filename> : <computeroutput>jim:*:501:501:Jungle Jim:/home/jim:/bin/bash</computeroutput>. Pour rechercher des groupes, la bibliothèque Hesiod recherche <literal>jim.group<replaceable>LHS</replaceable><replaceable>RHS</replaceable></literal> à la place.

source: To look up users and groups by number, make <literal>501.uid</literal> a CNAME for <literal>jim.passwd</literal>, and <literal>501.gid</literal> a CNAME for <literal>jim.group</literal>. Note that the library does not place a period (<literal>.</literal>) in front of the LHS and RHS values when performing a search. Therefore, if the LHS and RHS values need to have a period placed in front of them, you must include the period in the values you set for <option>--hesiodlhs=</option> and <option>--hesiodrhs=</option>.
fr: Pour rechercher les utilisateurs et les groupes par numéro, faites de <literal>501.uid</literal> un CNAME (nom canonique) pour <literal>jim.passwd</literal> et de <literal>501.gid</literal> un CNAME pour <literal>jim.group</literal>. Notez que la bibliothègue ne met pas de point (<literal>.</literal>) devant les valeurs LHS et RHS lorsqu'elle effectue une recherche. Par conséquent, si les valeurs LHS et RHS ont besoin d'avoir un point devant elles, vous devez inclure le point dans les valeurs que définissez avec les options <option>--hesiodlhs=</option> et <option>--hesiodrhs=</option>.

source: Enables authentication of users against an SMB server (typically a Samba or Windows server). SMB authentication support does not know about home directories, UIDs, or shells. If you enable SMB, you must make users' accounts known to the workstation by enabling LDAP, NIS, or Hesiod or by using the <command>useradd</command> command.
fr: Active l'authentification des utilisateurs auprès d'un serveur SMB (typiquement un serveur Samba ou un serveur Windows). La prise en charge de l'authentification par SMB ne sait rien des dossiers home des utilisateurs, des UIDs ou des shells. Si vous activez SMB, vous devez faire connaître les comptes utilisateurs à la station de travail en activant LDAP, NIS ou Hesiod ou en utilisant la commande <command>useradd</command>.

source: The name of the servers to use for SMB authentication. To specify more than one server, separate the names with commas (<literal>,</literal>).
fr: Le nom des serveurs à utiliser pour l'authentification SMB. Pour spécifier plusieurs serveurs, séparez les noms l'un de l'autre par une virgule (<literal>,</literal>).

source: The name of the workgroup for the SMB servers.
fr: Le nom du groupe de travail pour les serveurs SMB.

source: Enables the <systemitem>nscd</systemitem> service. The <systemitem>nscd</systemitem> service caches information about users, groups, and various other types of information. Caching is especially helpful if you choose to distribute information about users and groups over your network using <systemitem>NIS</systemitem>, <systemitem>LDAP</systemitem>, or <systemitem>Hesiod</systemitem>.
fr: Active le service <systemitem>nscd</systemitem>. Le service <systemitem>nscd</systemitem> met en cache les informations sur les utilisateurs, les groupes et des tas d'autres choses. La mise en cache est particulièrement utile si vous choisissez de distribuer les informations sur les utilisateurs et les groupes à travers votre réseau en utilisant <systemitem>NIS</systemitem>, <systemitem>LDAP</systemitem> ou <systemitem>Hesiod</systemitem>.

source: Specify <option>sha256</option> to set up the SHA-256 hashing algorithm or <option>sha512</option> to set up the SHA-512 hashing algorithm.
fr: Spécifiez <option>sha256</option> pour utiliser l'algorithme de hachage HA-256 ou <option>sha512</option> pour utiliser l'algorithme de hachage SHA-512.

source: group (optional) - Create User Group
fr: group (facultative) - Création d'un groupe d'utilisateurs

source: Creates a new user group on the system. If a group with the given name or GID already exists, this command will fail. In addition, the <command>user</command> command can be used to create a new group for the newly created user.
fr: Crée un nouveau groupe d'utilisateurs sur le système. Si un groupe de même nom ou de même GID existe déjà, cette commande échoue. De plus, la commande <command>user</command> peut être utilisée pour créer un nouveau groupe pour l'utilisateur créé.

source: <command>group --name=<replaceable>name</replaceable> [--gid=<replaceable>gid</replaceable>]</command>
fr: <command>group --name=<replaceable>nom</replaceable> [--gid=<replaceable>gid</replaceable>]</command>

source: Provides the name of the group.
fr: Fournit le nom du groupe.

source: The group ID (GID). If not provided, defaults to the next available non-system GID.
fr: L'identifiant du groupe (GID). Si cette option n'est pas utilisée, c'est le GID de groupe suivant, autre qu'un groupe système, qui est utilisé.

source: pwpolicy (optional) - Change the Default Password Policy
fr: pwpolicy (facultative) - Changement de la politique de mot de passe par défaut

source: This command can be used to set custom requirements (policy) such as length and strength for passwords set during the installation - the <systemitem>root</systemitem> password, user passwords and LUKS (disk encryption) password.
fr: Cette commande peut être utilisée pour définir les exigences personnalisées (politique) sur la longueur et la force des mots de passe définis lors de l'installation - le mot de passe <systemitem>root</systemitem>, les mots de passe utilisateurs et les mots de passe LUKS (chiffrement des disques).

source: <command>pwpolicy <replaceable>name</replaceable> [--minlen=<replaceable>length</replaceable>] [--minquality=<replaceable>quality</replaceable>] [--strict|nostrict] [--emptyok|noempty] [--changesok|nochanges]</command>
fr: <command>pwpolicy <replaceable>nom</replaceable> [--minlen=<replaceable>longueur</replaceable>] [--minquality=<replaceable>qualité</replaceable>] [--strict|nostrict] [--emptyok|noempty] [--changesok|nochanges]</command>

source: The <systemitem>libpwquality</systemitem> library is used to check minimum password requirements (length and quality). You can use the <command>pwscore</command> and <command>pwmake</command> commands provided by the <package>libpwquality</package> package to check the quality score of your chosen password, or to create a random password with a given score. See the <systemitem>pwscore(1)</systemitem> and <systemitem>pwmake(1)</systemitem> man pages for details about these commands.
fr: La bibliothèque <systemitem>libpwquality</systemitem> est utilisée pour vérifier les exigences minimum sur les mots de passe (force et qualité). Vous pouvez utiliser les commandes <command>pwscore</command> et <command>pwmake</command> fournies par le paquet <package>libpwquality</package> pour vérifier la qualité de votre mot de passe ou pour créer un mot de passe aléatoire d'un niveau de qualité donné. Consultez les pages de manuel <systemitem>pwscore(1)</systemitem> et <systemitem>pwmake(1)</systemitem> pour des détails sur ces commandes.

source: This command must be used inside the <command>%anaconda</command> section. See <xref linkend="sect-kickstart-commands-anaconda" /> for details.
fr: Cette commande doit être utilisée dans la section <command>%anaconda</command>. Reportez-vous à la <xref linkend="sect-kickstart-commands-anaconda" /> pour les détails.

source: <replaceable>name</replaceable>
fr: <replaceable>nom</replaceable>
