Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: This option is used when composing installation trees and has no effect on the installation process itself. It tells the compose tools to not look at the package group information when mirroring trees so as to avoid mirroring large amounts of unnecessary data.
fr: Cette option est utilisée lors de la composition d'arbres d'installation et n'a pas d'effet sur le processus d'installation lui-même. Elle indique à l'outil de composition de ne pas prendre en considération l'information de groupe de paquets lors de la duplication (mirroring) des arbres de manière à ne pas dupliquer de grande quantité d'informations inutiles.

source: Storage and Partitioning
fr: Stockage et partitionnement

source: Commands in this section are used to determine your system's storage options and partitioning.
fr: Les commandes de cette section servent à déterminer les options des stockage de votre système et son partitionnement.

source: autopart (optional) - Automatic Partitioning
fr: autopart (facultative) - Partitionnement automatique

source: Automatically creates partitions: a root (<filename class="partition">/</filename>) partition (1 GB or larger), a <filename class="partition">swap</filename> partition, and an appropriate <filename class="partition">/boot</filename> partition for the architecture. On large enough drives (50&nbsp;GB and larger), this also creates a <filename class="partition">/home</filename> partition.
fr: Crée automatiquement des partitions : une partition racine (<filename class="partition">/</filename>) (1 Go ou plus), une partition d'échange <filename class="partition">swap</filename> et une partition de démarrage <filename class="partition">/boot</filename> appropriée à l'architecture. Sur de grands disques (50 Go et plus), cela crée aussi une partition utilisateurs <filename class="partition">/home</filename>.

source: The <command>autopart</command> option cannot be used together with the <command>part/partition</command>, <command>raid</command>, <command>logvol</command>, or <command>volgroup</command> options in the same Kickstart file.
fr: L'option <command>autopart</command> ne peut pas être utilisée simultanément avec les options <command>part/partition</command>, <command>raid</command>, <command>logvol</command> ou <command>volgroup</command> dans le même fichier Kickstart.

source: Selects one of the predefined automatic partitioning schemes you want to use. Accepts the following values:
fr: Sélectionne, parmi les schéma de partitionnement automatiques pré-définis, celui que vous voulez utiliser. Les valeurs suivantes sont acceptées :

source: <literal>lvm</literal>: The LVM partitioning scheme.
fr: <literal>lvm</literal> : schéma de partitionnement LVM.

source: <literal>btrfs</literal>: The Btrfs partitioning scheme.
fr: <literal>btrfs</literal>: le schéma de partitionnement Btrfs.

source: <literal>plain</literal>: Regular partitions with no LVM or Btrfs.
fr: <literal>plain</literal>: Partitions standard sans LVM ou Btrfs.

source: <literal>thinp</literal>: The LVM Thin Provisioning partitioning scheme.
fr: <literal>thinp</literal> : schéma de partitionnement Allocation fine LVM.

source: The created partitioning scheme will follow the recommended scheme described at <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Le schéma de partitionnement créé suit le schéma recommandé tel que décrit à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.

source: Specify a supported file system (such as <literal>ext4</literal> or <literal>xfs</literal>) to replace the default when doing automatic partitioning.
fr: Spécifie un système de fichiers pris en charge (comme <literal>ext4</literal> ou <literal>xfs</literal>) pour remplacer le système de fichiers par défaut lors du partitionnement automatique.

source: Do not use LVM or Btrfs for automatic partitioning. This option is equal to <option>--type=plain</option>.
fr: N'utilise pas le partitionnement automatique LVM ou Btrfs. Cette option est équivalente à l'option <option>--type=plain</option>.

source: Encrypts all partitions. This is equivalent to checking the <guilabel>Encrypt partitions</guilabel> check box on the initial partitioning screen during a manual graphical installation.
fr: Chiffre toutes les partitions. Ceci est équivalent au fait de cocher <guilabel>Chiffrer</guilabel> dans l'écran initial de partitionnement lors d'une installation graphique manuelle.

source: Provides a default system-wide passphrase for all encrypted devices.
fr: Fournit une phrase de passe par défaut valable pour tous les périphériques chiffrés du système.

source: <option>--escrowcert=<replaceable>URL_of_X.509_certificate</replaceable></option>
fr: <option>--escrowcert=<replaceable>URL_du_certificat_X.509</replaceable></option>

source: Stores data encryption keys of all encrypted volumes as files in <filename>/root</filename>, encrypted using the X.509 certificate from the URL specified with <replaceable>URL_of_X.509_certificate</replaceable>. The keys are stored as a separate file for each encrypted volume. This option is only meaningful if <option>--encrypted</option> is specified.
fr: Stocke les clés de chiffrement des données de tous les volumes chiffrés sous forme de fichiers dans le dossier <filename>/root</filename> en utilisant le certificat X.509 depuis l'URL spécifiée par <replaceable>URL_du_certificat_X.509</replaceable>. Les clés sont stockées sous forme d'un fichier distinct pour chacun des volumes chiffrés. Cette option n'a de signification que si l'option <option>--encrypted</option> est spécifiée.

source: Adds a randomly-generated passphrase to each encrypted volume. Store these passphrases in separate files in <filename>/root</filename>, encrypted using the X.509 certificate specified with <option>--escrowcert</option>. This option is only meaningful if <option>--escrowcert</option> is specified.
fr: Ajoute une phrase de passe générée aléatoirement à chacun des volumes chiffrés. Stocke ces phrases de passe dans des fichiers séparés dans le dossier <filename>/root</filename>, chiffrés en utilisant le certificat X.509 spécifié par l'opion <option>--escrowcert</option>. Cette option n'a de signification que si l'option <option>--escrowcert</option> est spécifiée.

source: Specifies which type of encryption will be used if the <application>Anaconda</application> default <systemitem>aes-xts-plain64</systemitem> is not satisfactory. You must use this option together with the <option>--encrypted</option> option; by itself it has no effect. Available types of encryption are listed in the <citetitle>Fedora Security Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />. Using either <systemitem>aes-xts-plain64</systemitem> or <systemitem>aes-cbc-essiv:sha256</systemitem> is strongly recommended.
fr: Spécifie quel type de chiffrement est utilisé si le type <systemitem>aes-xts-plain64</systemitem> utilisé par défaut par <application>Anaconda</application> ne convient pas. Vous devez utiliser cette option en même temps que l'option <option>--encrypted</option> ; elle n'a pas d'effet par elle-même. Les types de chiffrement disponibles sont listés dans le <citetitle>Guide de la sécurité de &PRODUCT;</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />. L'utilisation, soit de <systemitem>aes-xts-plain64</systemitem>, soit de <systemitem>aes-cbc-essiv:sha256</systemitem> est fortement recommandée.

source: bootloader (required) - Configure Boot Loader
fr: bootloader (requise) - Configuration du chargeur de démarrage

source: Specifies how the boot loader should be installed.
fr: Spécifie comment le chargeur de démarrage doit être installé.

source: You should always use a password to protect your boot loader. An unprotected boot loader can allow a potential attacker to modify the system's boot options and gain unauthorized access to the system.
fr: Vous devez toujours utiliser un mot de passe pour protéger votre chargeur de démarrage. Un chargeur de démarrage non protégé permet à un attaquant potentiel de modifier les options de démarrage du système et d'obtenir un accès non autorisé au système.

source: Some systems require a special partition for installing the boot loader. The type and size of this partition depends on whether the disk you are installing the boot loader to uses the <firstterm>Master Boot Record</firstterm> (MBR) or a <firstterm>GUID Partition Table</firstterm> (GPT) schema. For more information, see <xref linkend="sect-installation-gui-storage-partitioning-bootloader" />.
fr: Quelques systèmes requièrent une partition spéciale pour installer le chargeur de démarrage. Le type et la taille de cette partition varient selon que le disque où vous installez le chargeur de démarrage utilise le schéma de partitionnement <firstterm>Master Boot Record</firstterm> (MBR) ou <firstterm>Table des partitions GUID</firstterm> (GPT). Pour plus d'informations, reportez-vous à la <xref linkend="sect-installation-gui-storage-partitioning-bootloader" />.

source: Specifies additional kernel parameters. To specify multiple parameters, separate them with spaces. For example:
fr: Spécifie des paramètres additionnels du noyau. Pour spécifier plusieurs paramètres, séparez-les par une espace. Par exemple :

source: The <option>rhgb</option> and <option>quiet</option> parameters are always used, even if you do not specify them here or do not use the <option>--append=</option> command at all.
fr: Les paramètres <option>rhgb</option> et <option>quiet</option> sont toujours utilisés, même si vous ne les spécifiez pas ici ou si vous n'utilisez pas du tout la commande <option>--append=</option>.

source: Specifies which drive the boot loader should be written to, and therefore which drive the computer will boot from. If you use a multipath device as the boot drive, specify only one member of the device.
fr: Spécifie sur quel disque le chargeur de démarrage doit être écrit, et par conséquent, depuis quel disque le système doit démarrer. Si vous utilisez un périphérique multichemin (multipath) en tant que disque de démarrage, spécifiez seulement un membre du périphérique.

source: The <option>--boot-drive=</option> option is currently being ignored in &PRODUCT; installations on IBM System&nbsp;z systems using the <application>zipl</application> boot loader. When <application>zipl</application> is installed, it determines the boot drive on its own.
fr: L'option <option>--boot-drive=</option> est actuellement ignorée dans les installation de &PRODUCT; sur des systèmes IBM z utilisant le chargeur de démarrage <application>zipl</application>. Quand <application>zipl</application> est installé, il détermine le disque de démarrage par lui-même.

source: Prevents the installation program from making changes to the existing list of bootable images on UEFI or ISeries/PSeries systems.
fr: Empêche l'installateur d'effectuer des changements à la liste des images bootables sur les systèmes UEFI ou ISeries/PSeries.

source: Specifies which drive is first in the BIOS boot order. For example:
fr: Spécifie quel disque est le premier l'ordre du BIOS. Par exemple :

source: Specifies where the boot record is written. Valid values are the following:
fr: Spécifie où l'enregistrement de démarrage est écrit. Les valeurs acceptables sont les suivantes :

source: <literal>mbr</literal> - The default option. Depends on whether the drive uses the Master Boot Record (MBR) or GUID Partition Table (GPT) scheme:
fr: <literal>mbr</literal> - l'option par défaut. Varie selon que le disque utilise le schéma de partitionnemnt Master Boot Record (MBR) ou Table des partitions GUID (GPT) :

source: On a GPT-formatted disk, this option will install stage 1.5 of the boot loader into the BIOS boot partition.
fr: Sur un disque formaté GPT, cette option installe l'étage 1.5 du chargeur de démarrage dans la partition BIOS boot.

source: On an MBR-formatted disk, stage 1.5 will be installed into the empty space between the MBR and the first partition.
fr: Sur un disque formaté MBR, l'étage 1.5 est installé dans le vide MBR (un espace vide entre le MBR et la première partition du disque).

source: <literal>partition</literal> - Install the boot loader on the first sector of the partition containing the kernel.
fr: <literal>partition</literal> - Installe le chargeur de démarrage sur le premier secteur de la partition contenant le noyau.

source: <literal>none</literal> - Do not install the boot loader.
fr: <literal>none</literal> - N'installe aucun chargeur de démarrage.

source: In most cases, this option does not need to be specified.
fr: Dans la plupart des cas, cette option n'a pas besoin d'être spécifiée.

source: If using <application>GRUB2</application> as the boot loader, sets the boot loader password to the one specified with this option. This should be used to restrict access to the <application>GRUB2</application> shell, where arbitrary kernel options can be passed.
fr: Si <application>GRUB2</application> est utilisé en tant que chargeur de démarrage, définit le mot de passe du chargeur de démarrage. Cela doit être utilisé pour restreindre les accès au shell de <application>GRUB2</application> qui permet de passer des options arbitraires au noyau.

source: If a password is specified, <application>GRUB2</application> will also ask for a user name. The user name is always <literal>root</literal>.
fr: Si un mot de passe est spécifié, <application>GRUB2</application> demande un nom d'utilisateur. Ce nom est toujours <literal>root</literal>.

source: Normally, when you specify a boot loader password using the <option>--password=</option> option, it will be stored in the Kickstart file in plain text. If you want to encrypt the password, use this option and an encrypted password.
fr: Normalement, quand vous spécifiez un mot de passe pour le chargeur de démarrage à l'aide de l'option <option>--password=</option>, ce mot de passe est stocké en clair dans le fichier Kickstart. Si vous désirez le chiffrer, utilisez cette option et un mot de passe chiffré.

source: To generate an encrypted password, use the <command>grub2-mkpasswd-pbkdf2</command> command, enter the password you want to use, and copy the command's output (the hash starting with <literal>grub.pbkdf2</literal>) into the Kickstart file. An example <command>bootloader</command> Kickstart entry with an encrypted password will look similar to the following:
fr: Pour générer un mot de passe chiffré, utilisez la commande <command>grub2-mkpasswd-pbkdf2</command>, entrez le mot de passe et copiez la sortie de la commande (le hachage commençant par <literal>grub.pbkdf2</literal>) dans le fichier Kickstart. Un exemple d'entrée <command>bootloader</command> pour Kickstart avec un mot de passe chiffré ressemble à ceci :

source: Specifies the amount of time the boot loader will wait before booting the default option (in seconds).
fr: Spécifie le temps pendant lequel le chargeur de démarrage attend avant de démarrer l'entrée par défaut (en secondes)

source: Sets the default boot image in the boot loader configuration.
fr: Définit l'image de démarrage par défaut dans la configuration du chargeur de démarrage.

source: Use the <application>extlinux</application> boot loader instead of <application>GRUB2</application>. This option only works on systems supported by <application>extlinux</application>.
fr: Utilise le chargeur de démarrage <application>extlinux</application> au lieu de <application>GRUB2</application>. Cette option ne fonctionne que sur les systèmes pris en charge par <application>extlinux</application>.

source: Do not attempt to install a boot loader. This option overrides all other boot loader configuration; all other boot loader options will be ignored and no boot loader packages will be installed.
fr: N'essaye pas d'installer un chargeur de démarrage. Cette option prévaut sur toute autre configuration du chargeur de démarrage ; toutes les autres options sont ignorées et aucun paquet du chargeur de démarrage n'est installé.

source: Install the boot loader configuration and support files, but do not modify the MBR.
fr: Installe la configuration du chargeur de démarrage et les fichiers support, mais ne modifie par le MBR.

source: btrfs (optional) - Create Btrfs Volume or Subvolume
fr: btrfs (facultative) - Crée un volume ou un sous-volume Btrfs

source: Create a Btrfs volume or subvolume. For a volume, the syntax is:
fr: Crée un volume ou un sous-volume Btrfs. Pour un volume, la syntaxe est la suivante :

source: <command>btrfs <replaceable>mntpoint</replaceable> --data=<replaceable>level</replaceable> --metadata=<replaceable>level</replaceable> [--label=] <replaceable>partitions</replaceable></command>
fr: <command>btrfs <replaceable>point_de_montage</replaceable> --data=<replaceable>niveau</replaceable> --metadata=<replaceable>niveau</replaceable> [--label=] <replaceable>partitions</replaceable></command>

source: One or more partitions can be specified in <replaceable>partitions</replaceable>. When specifying more than one partitions, the entries must be separated by a single space. See <xref linkend="exam-kickstart-create-btrfs" /> for a demonstration.
fr: Une ou plusieurs partitions, séparées par une espace unique, peuvent être spécifiées avec <replaceable>partitions</replaceable>. Reportez-vous à l'<xref linkend="exam-kickstart-create-btrfs" /> pour une démonstration.

source: For a subvolume, the syntax is:
fr: Pour un sous-volume, la syntaxe est :

source: <command>btrfs <replaceable>mntpoint</replaceable> --subvol --name=<replaceable>name</replaceable> <replaceable>parent</replaceable></command>
fr: <command>btrfs <replaceable>point_de_montage</replaceable> --subvol --name=<replaceable>nom</replaceable> <replaceable>parent</replaceable></command>

source: <replaceable>parent</replaceable> should be the identifier of the subvolume's parent volume, <replaceable>name</replaceable> with a name for the subvolume, and <replaceable>mntpoint</replaceable> is the location where the file system is mounted.
fr: <replaceable>parent</replaceable> doit identifier le parent du sous-volume, <replaceable>nom</replaceable> le nom du sous-volume et <replaceable>point_de_montage</replaceable> l'emplacement où le système de fichiers est monté.

source: RAID level to use for file system <emphasis>data</emphasis> (such as <literal>0</literal>, <literal>1</literal>, or <literal>10</literal>). This parameter is optional, has no meaning for subvolumes, and requires more than one physical disk.
fr: Niveau RAID à utiliser pour les <emphasis>données</emphasis> du système de fichiers (p. ex. <literal>0</literal>, <literal>1</literal> ou <literal>10</literal>). Ce paramètre est facultatif, n'a pas de signification pour un sous-volume et requiert plus d'un disque physique.

source: RAID level to use for file system/volume <emphasis>metadata</emphasis> (such as <literal>0</literal>, <literal>1</literal>, or <literal>10</literal>). This parameter is optional, has no meaning for subvolumes, and requires more than one physical disk.
fr: Niveau de RAID à utiliser pour les <emphasis>méta-données</emphasis>du système de fichiers/volume (p. ex. <literal>0</literal>, <literal>1</literal> ou <literal>10</literal>). Ce paramètre est facultatif, n'a pas de signification pour un sous-volume et requiert plus d'un disque physique.

source: Specify a label for the Btrfs file system. If the given label is already in use by another file system, a new label will be created. This option has no meaning for subvolumes.
fr: Spécifie une étiquette pour le système de fichiers Btrfs. Si l'étiquette est déjà utilisée par un autre système de fichiers, une nouvelle étiquette est créée. Cette option n'a pas de signification pour un sous-volume.

source: Create a Btrfs subvolume instead of a volume.
fr: Crée un sous-volume Btrfs plutôt qu'un volume.

source: Set a name for a Btrfs subvolume.
fr: Définit un nom pour le sous-volume Btrfs.

source: Use an existing Btrfs volume (or subvolume) and do not reformat the file system.
fr: Utilise un volume Btrfs (ou un sous-volume) existant et ne reformate pas le système de fichiers.

source: Specifies additional parameters to be passed to the program that makes a filesystem on this volume or subvolume. No processing is done on the list of arguments, so they must be supplied in a format that can be passed directly to the mkfs program. This means multiple options should be comma-separated or surrounded by double quotes, depending on the filesystem.
fr: Spécifie des paramètres additionnels à passer au programme qui crée le système de fichiers sur ce volume ou sous-voulume. Aucun traitement n'est fait sur la liste des arguments, c'est pourquoi ils doivent être fournis dans un format directement exploitable par le programme mkfs. Ceci signifie que les options multiples doivent être séparées par une virgule ou entourées de guillemets, selon le type de système de fichiers.

source: The following example shows how to create a Btrfs volume from member partitions on three disks with subvolumes for <filename class="directory">/</filename> and <filename class="directory">/home</filename>. The main volume is not mounted or used directly in this example.
fr: L'exemple suivant montre comment créer un volume Btrfs à partir des partitions membres sur trois disques avec des sous-volumes pour <filename class="directory">/</filename>et <filename class="directory">/home</filename>. Le volume principal n'est pas monté ou utilisé directement dans cet exemple.

source: Creating Btrfs Volumes and Subvolumes
fr: Création de volumes et de sous-volumes Btrfs

source: clearpart (optional) - Remove All Existing Partitions
fr: clearpart (facultative) - Suppression de toutes les partitions existantes

source: Removes partitions from the system, prior to creation of new partitions. By default, no partitions are removed.
fr: Supprime les partitions du système avant d'en créer de nouvelles. Par défaut, aucune partition n'est supprimée.

source: If the <command>clearpart</command> command is used, then the <command>part --onpart</command> command cannot be used on a logical partition.
fr: Si la commande <command>clearpart</command> est utilisée, alors la commande <command>part --onpart</command> ne peut pas être utilisée sur une partition logique.

source: For a detailed example of partitioning including the <command>clearpart</command> command, see <xref linkend="sect-kickstart-example-advanced-partitioning" />.
fr: Pour un exemple détaillé de partitionnement incluant la commande <command>clearpart</command> command, reportez-vous à la <xref linkend="sect-kickstart-example-advanced-partitioning" />.

source: Erases all partitions from the system.
fr: Éfface toutes les partitions du système.

source: This option will erase all disks which can be reached by the installer, including any attached network storage. Use this option with caution.
fr: Cette option efface tous les disques que l'installateur pour atteindre, y compris les emplacement réseaux de stockage attachés. Utilisez cette option avec prudence.

source: Specifies which drives to clear partitions from. For example, the following clears all the partitions on the first two drives on the primary IDE controller:
fr: Spécifie sur quels disques supprimer les partitions. Par exemple, ce qui suit supprime les partitions des deux premiers disques sur le premier contrôleur IDE :
