Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: All static networking configuration information must be specified on <emphasis>one</emphasis> line; you cannot wrap lines using a backslash (<literal>\</literal>) as you can on a command line.
fr: Toute la configuration réseau statique doit être spécifiée sur <emphasis>une seule </emphasis> ligne; vous ne pouvez pas utiliser la barre oblique inversée (backslash) (<literal>\</literal>) comme vous le feriez sur un ligne de commande.

source: You can also configure multiple nameservers at the same time. To do so, use the <option>--nameserver=</option> options once for each name server you want to configure:
fr: Vous pouvez aussi configurer plusieurs serveurs de noms en même temps. Pour cela, utilisez l'<option>--nameserver=</option> une fois par nom de serveur que vous voulez configurer :

source: Specifies the device to be configured (and eventually activated in <application>Anaconda</application>) with the <command>network</command> command.
fr: Spécifie le périphérique à configurer (et à activer éventuellement dans <application>Anaconda</application>) avec la commande <command>network</command>.

source: If the <option>--device=</option> option is missing on the <emphasis>first</emphasis> use of the <command>network</command> command, the value of the <option>ksdevice=</option> <application>Anaconda</application> boot option is used, if available. Note that this is considered deprecated behavior; in most cases, you should always specify a <option>--device=</option> for every <command>network</command> command.
fr: Si l'option <option>--device=</option> manque à la <emphasis>première </emphasis>utilisation de la commande <command>network</command>, la valeur de l'option de démarrage <option>ksdevice=</option> d'<application>Anaconda</application> est utilisée, si disponible. Notez que ce comportement est en voie d'obsolescence. Vous devez toujours spécifier une option <option>--device=</option> pour chacune des commandes <command>network</command>.

source: The behavior of any subsequent <command>network</command> command in the same Kickstart file is unspecified if its <option>--device=</option> option is missing. Make sure you specify this option for any <command>network</command> command beyond the first.
fr: Le comportement de toute commande <command>network</command> consécutive dans le même fichier Kickstart n'est pas spécifié si son option <option>--device=</option> manque. Assurez-vous que vous spécifiez cette option pour chacune des commandes <command>network</command> au delà de la première.

source: You can specify a device to be activated in any of the following ways:
fr: Vous pouvez spécifier un périphérique à activer de l'une des façons suivantes :

source: the device name of the interface, for example, <systemitem>em1</systemitem>
fr: le nom de périphérique de l'interface, par exemple, <systemitem>em1</systemitem> ;

source: the MAC address of the interface, for example, <systemitem>01:23:45:67:89:ab</systemitem>
fr: l'adresse MAC de l'interface, par exemple, <systemitem>01:23:45:67:89:ab</systemitem> ;

source: the keyword <literal>link</literal>, which specifies the first interface with its link in the <literal>up</literal> state
fr: le mot clé <literal>link</literal>, qui désigne la première interface connectée avec l'état <literal>up</literal> ;

source: the keyword <literal>bootif</literal>, which uses the MAC address that <application>pxelinux</application> set in the <parameter>BOOTIF</parameter> variable. Set <literal>IPAPPEND 2</literal> in your <filename>pxelinux.cfg</filename> file to have <application>pxelinux</application> set the <parameter>BOOTIF</parameter> variable.
fr: le mot clé <literal>bootif</literal>, qui utilise l'adresse MAC que <application>pxelinux</application> définit dans la variable <parameter>BOOTIF</parameter>. Définissez <literal>IPAPPEND 2</literal> dans le fichier <filename>pxelinux.cfg</filename> pour que <application>pxelinux</application> définisse la variable <parameter>BOOTIF</parameter>.

source: IP address of the device.
fr: adresse IP du périphérique.

source: IPv6 address of the device, in the form of <replaceable>address</replaceable>[/<replaceable>prefix</replaceable> <replaceable>length</replaceable>] - for example, <literal>3ffe:ffff:0:1::1/128 </literal>. If <replaceable>prefix</replaceable> is omitted, <literal>64</literal> will be used. You can also use <literal>auto</literal> for automatic configuration, or <literal>dhcp</literal> for DHCPv6-only configuration (no router advertisements).
fr: Adresse IPv6 du périphérique dans le format <replaceable>adresse</replaceable>[/<replaceable>préfixe</replaceable> <replaceable>longueur</replaceable>] - par exemple, <literal>3ffe:ffff:0:1::1/128 </literal>. Si <replaceable>préfixe</replaceable> est omis, <literal>64</literal> est utilisé. Vous pouvez aussi utiliser <literal>auto</literal> pour une configuration automatique, ou <literal>dhcp</literal> pour une configuration DHCPv6-only (DHCPv6-seulement)(pas de publicité de routeur).

source: Default gateway as a single IPv4 address.
fr: Passerelle par défaut sous la forme d'une adresse IPv4 unique.

source: Default gateway as a single IPv6 address.
fr: Passerelle par défaut sous la forme d'une adresse IPv6 unique.

source: Prevents the interface being set as the default route. Use this option when you activate additional devices with the <option>--activate=</option> option, for example, a NIC on a separate subnet for an iSCSI target.
fr: Empêche que cette interface soit prise comme route par défaut. Utilisez cette option lorsque vous activez des périphériques supplémentaires avec l'option <option>--activate=</option>, par exemple, une carte interface réseau (NIC) sur un sous-réseau séparé pour une cible iSCSI.

source: DNS name server, as an IP address. To specify more than one name server, use this parameter multiple times. For example:
fr: Serveur DNS, sous forme d'adresse IP. Pour spécifier plusieurs serveurs, utilisez ce paramètre plusieurs fois. Par exemple :

source: Do not configure any DNS server.
fr: Ne configure aucun serveur de noms.

source: Network mask for the installed system.
fr: Masque de réseau pour le système installé.

source: Host name for the installed system. The host name can be either a <firstterm>fully-qualified domain name</firstterm> (FQDN) in the format <replaceable>hostname</replaceable>.<replaceable>domainname</replaceable>, or a short host name with no domain name. Many networks have a <firstterm>Dynamic Host Configuration Protocol</firstterm> (<systemitem class="protocol">DHCP</systemitem>) service that automatically supplies connected systems with a domain name; to allow the <systemitem class="protocol">DHCP</systemitem> service to assign the domain name to this machine, only specify the short host name.
fr: Nom d'hôte pour le système installé. Le nom d'hôte peut être, soit un <firstterm>nom de domaine complètement qualifié</firstterm> (FQDN) dans le format <replaceable>nom_d_hôte</replaceable>.<replaceable>nom_de_domaine</replaceable>, soit une nom d'hôte court sans nom de domaine. Beaucoup de réseaux disposent d'un service <firstterm>Dynamic Host Configuration Protocol</firstterm> (Protocole de configuration dynamique des hôtes) (<systemitem class="protocol">DHCP</systemitem>) qui attribue automatiquement un nom de domaine à chacun des hôtes connectés au système ; pour autoriser le service <systemitem class="protocol">DHCP</systemitem> à attribuer un nom à cette machine, spécifiez seulement un nom d'hôte court.

source: Specifies additional low-level settings for the network device which will be passed to the <application>ethtool</application> program.
fr: Spécifie d'autres réglages de bas niveau pour le périphérique réseau qui seront passés au programme <application>ethtool</application>.

source: The network ID for wireless networks.
fr: L'identifiant (ID) de réseau pour les réseaux sans fil.

source: The WEP encryption key for wireless networks.
fr: La clé de chiffrement WEP pour les réseaux sans fil.

source: The WPA encryption key for wireless networks.
fr: La clé de chiffrement WPA pour les réseaux sans fil.

source: Whether or not to enable the device at boot time.
fr: S'il faut ou pas activer le périphérique au démarrage.

source: The DHCP class.
fr: La classe DHCP.

source: The MTU of the device.
fr: Le MTU du périphérique.

source: Disable IPv4 on this device.
fr: Désactive IPv4 sur ce périphérique.

source: Disable IPv6 on this device.
fr: Désactive IPv6 sur ce périphérique.

source: When this option is used, the network device specified in the <option>--device=</option> option will be created using slaves defined in the <option>--bondslaves=</option> option. For example:
fr: Lorsque cette option est utilisée, le périphérique réseau spécifié par l'option <option>--device=</option> est créé en utilisant les esclaves définis dans l'option <option>--bondslaves=</option>. Par exemple :

source: The above command will create a bond device named <literal>mynetwork</literal> using the <literal>em1</literal> and <literal>em2</literal> interfaces as its slaves.
fr: La commande précédente crée un périphérique agrégé (bond device) nommé <literal>mynetwork</literal> en utilisant les interfaces <literal>em1</literal> et <literal>em2</literal> comme esclaves.

source: A list of optional parameters for a bonded interface, which is specified using the <command>--bondslaves=</command> and <command>--device=</command> options. Options in this list must be separated by commas ("<literal>,</literal>") or semicolons ("<literal>;</literal>"). If an option itself contains a comma, use a semicolon to separate the options. For example:
fr: Une liste des paramètres additionnels pour une interface agrégée, qui est spécifiée en utilisant les options <command>--bondslaves=</command> et <command>--device=</command>. Les paramètres de cette liste doivent être séparéeès l'un de l'autre par une virgule ("<literal>,</literal>") ou par un point-virgule ("<literal>;</literal>"). Si un paramètre lui-même contient une virgule, utilisez le point-virgule pour séparer les paramètres. Par exemple :

source: Available optional parameters are listed in the <citetitle>Working with Kernel Modules</citetitle> chapter of the <citetitle>Fedora System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Les paramètres facultatifs supplémentaires sont listés dans le chapitre <citetitle>Utiliser les modules du noyau</citetitle> du <citetitle>Guide de l'administrateur système de &PRODUCT;</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: The <option>--bondopts=mode=</option> parameter only supports full mode names such as <literal>balance-rr</literal> or <literal>broadcast</literal>, not their numerical representations such as <literal>0</literal> or <literal>3</literal>.
fr: Les paramètres <option>--bondopts=mode=</option>doivent être fournis sous forme de nom complet de mode tel que <literal>balance-rr</literal> ou <literal>broadcast</literal>, pas dans leur représentation numérique telle que <literal>0</literal> ou <literal>3</literal>.

source: Specifies virtual LAN (VLAN) ID number (802.1q tag) for the device created using the device specified in <option>--device=</option> as a parent. For example, <command>network --device=em1 --vlanid=171</command> will create a virtual LAN device <literal>em1.171</literal>.
fr: Spécifie le numéro d'identification du réseau local virtuel (VLAN) (802.1q tag) pour le périphérique créé en utilisant le périphérique spécifié par l'option <option>--device=</option> en tant que parent. Par exemple, <command>network --device=em1 --vlanid=171</command> crée un périphérique VLAM <literal>em1.171</literal>.

source: Specify a custom interface name for a virtual LAN device. This option should be used when the default name generated by the <option>--vlanid=</option> option is not desirable. This option must be used along with <option>--vlanid=</option>. For example:
fr: Spécifie un nom d'interface personnalisé pour un périphérique VLAN. Cette option doit être utilisée lorsque le nom par défaut généré par l'option <option>--vlanid=</option> n'est pas souhaitable. Cette option doit être utilisée conjointement avec l'option <option>--vlanid=</option>. Par exemple :

source: The above command will create a virtual LAN interface named <literal>vlan171</literal> on the <literal>em1</literal> device with an ID of <literal>171</literal>.
fr: La commande ci-dessus crée une interface de VLAN nommée <literal>vlan171</literal> sur le périphérique <literal>em1</literal> avec un identifiant (ID) égal à <literal>171</literal>.

source: The interface name can be arbitrary (for example, <literal>my-vlan</literal>), but in specific cases, the following conventions must be followed:
fr: Le nom de l'interface peut être arbitraire (par exemple <literal>my-vlan</literal>) ; néanmoins, dans certains cas spécifiques, les conventions suivante doivent être respectées :

source: If the name contains a dot (<literal>.</literal>), it must take the form of <literal><replaceable>NAME</replaceable>.<replaceable>ID</replaceable></literal>. The <replaceable>NAME</replaceable> is arbitrary, but the <replaceable>ID</replaceable> must be the VLAN ID. For example: <literal>em1.171</literal> or <literal>my-vlan.171</literal>.
fr: Si le nom contient un point (<literal>.</literal>), il doit suivre le format <literal><replaceable>NOM</replaceable>.<replaceable>ID</replaceable></literal>. <replaceable>NOM</replaceable> est arbitraire mais <replaceable>ID</replaceable> doit être l'identifiant du VLAN. Par exemple : <literal>em1.171</literal> ou<literal>my-vlan.171</literal>.

source: Names starting with <literal>vlan</literal> must take the form of <literal>vlan<replaceable>ID</replaceable></literal> - for example, <literal>vlan171</literal>.
fr: Les noms qui commencent par <literal>vlan</literal> doivent suivre le format <literal>vlan<replaceable>ID</replaceable></literal> - par exemple, <literal>vlan171</literal>.

source: Team device specified by the <option>--device=</option> option will be created using slaves specified in this option. Slaves are separated by commas. A slave can be followed by its configuration, which is a single-quoted JSON string with double quotes escaped by the <literal>\</literal> character. For example:
fr: Le périphérique en équipe (team device) spécifié par l'option <option>--device=</option> est créé en utilisant les esclaves spécifiés dans cette option. Les noms d'esclaves sont séparés l'un de l'autre par une virgule. Un nom d'esclave peut être suivi de sa configuration, qui est une chaîne JSON entourée de guillemets anglais simples comprenant des guillemets anglais doubles échappés par le caractère <literal>\</literal>. Par exemple :

source: See also the <option>--teamconfig=</option> option.
fr: Voir aussi l'option <option>--teamconfig=</option>.

source: Double-quoted team device configuration which is a single-quoted JSON string with double quotes escaped by the <literal>\</literal> character. The device name is specified by <option>--device=</option> option and its slaves and their configuration by <option>--teamslaves=</option> option. For example:
fr: Configuration d'un périphérique en équipe qui est une chaîne JSON entourée de guillemets anglais simples comprenant des guillemets anglais doubles échappés par le caractères<literal>\</literal>. Le nom du périphérique est spécifié par l'option <option>--device=</option> option et le nom de ses esclaves et de leur configuration par l'option <option>--teamslaves=</option>. Par exemple :

source: When this option is used, the network bridge with device name specified using the <option>--device=</option> option will be created and devices defined in the <option>--bridgeslaves=</option> option will be added to the bridge. For example:
fr: Lorsque cette option est utilisée, le pont réseau avec le nom spécifié par l'option <option>--device=</option> est créé et les périphériques définis par l'option <option>--bridgeslaves=</option> sont ajoutés au pont. Par exemple :

source: An optional comma-separated list of parameters for the bridged interface. Available values are <literal>stp</literal>, <literal>priority</literal>, <literal>forward-delay</literal>, <literal>hello-time</literal>, <literal>max-age</literal>, and <literal>ageing-time</literal>. For information about these parameters, see the <citetitle>bridge setting</citetitle> table in the <systemitem>nm-settings(5)</systemitem> man page or at <ulink url="https://developer.gnome.org/NetworkManager/0.9/ref-settings.html" />. Also see the <citetitle>&PRODUCT; Networking Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />, for general information about network bridging.
fr: Une liste de paramètres additionnels séparés l'un de l'autre par un virgule pour l'interface en pont. Les valeurs disponibles sont <literal>stp</literal>, <literal>priority</literal>, <literal>forward-delay</literal>, <literal>hello-time</literal>, <literal>max-age</literal>, et <literal>ageing-time</literal>. Pour de l'information sur ces paramètres, reportez-vous au tableau <citetitle>bridge setting</citetitle> (configuration du pont) dans la page de manuel <systemitem>nm-settings(5)</systemitem> ou à <ulink url="https://developer.gnome.org/NetworkManager/0.9/ref-settings.html" />. Consultez aussi le <citetitle>Guide réseau de &PRODUCT;</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />, pour une information générale sur le pontage réseau.

source: Console and Environment
fr: Console et environnement

source: The following commands control the environment of the system after the installation finishes - language, keyboard layouts, or the graphical interface.
fr: Les commandes suivantes contrôlent l'environnement du système installé – langues, agencements de claviers, interface graphique, etc.

source: keyboard (optional) - Configure Keyboard Layouts
fr: keyboard (facultative) - Configuration des agencements de clavier

source: Sets one or more available keyboard layouts for the system.
fr: Définit un ou plusieurs agencements de clavier pour le système installé.

source: Specify a <systemitem>VConsole</systemitem> keymap which should be used. Valid names correspond to the list of files in the <filename class="directory">/usr/lib/kbd/keymaps/*</filename> directory, without the <literal>.map.gz</literal> extension.
fr: Spécifie une carte de clavier (keymap) à utiliser pour la <systemitem>VConsole</systemitem>. Les noms valides correspondent à la liste des fichiers présents dans le dossier <filename class="directory">/usr/lib/kbd/keymaps/*</filename>, sans l'extension <literal>.map.gz</literal>.

source: Specify a list of <application>X</application> layouts that should be used as a comma-separated list without spaces. Accepts values in the same format as <systemitem>setxkbmap(1)</systemitem>, either in the <literal><replaceable>layout</replaceable></literal> format (such as <literal>cz</literal>), or in the <literal><replaceable>layout</replaceable> (<replaceable>variant</replaceable>)</literal> format (such as <literal>cz (qwerty)</literal>).
fr: Spécifie une liste des noms d'agencements <application>X</application>, séparés l'un de l'autre par une virgule, qui doivent être utilisés. Accepte les valeurs dans le même format que la commande <systemitem>setxkbmap(1)</systemitem> : soit le format <literal><replaceable>agencement</replaceable></literal> (comme <literal>cz</literal>), soit le format <literal><replaceable>agencement</replaceable> (<replaceable>variante</replaceable>)</literal> (comme <literal>cz (qwerty)</literal>).

source: All available layouts can be viewed on the <systemitem>xkeyboard-config(7)</systemitem> man page under <literal>Layouts</literal>.
fr: Tous les agencements sont visibles dans la page de manuel <systemitem>xkeyboard-config(7)</systemitem> sous le titre <literal>Layouts</literal> (Agencements).

source: Specify a list of layout-switching options (shortcuts for switching between multiple keyboard layouts). Multiple options must be separated by commas without spaces. Accepts values in the same format as <systemitem>setxkbmap(1)</systemitem>.
fr: Spécifie une liste d'options de commutation entre agencements (raccourcis clavier pour commuter parmi de multiples agencements de clavier). Les options multiples doivent être séparées l'une de l'autre pour une virgule sans espace. Accepte les valeurs dans le même format que la commande <systemitem>setxkbmap(1)</systemitem>.

source: Available switching options can be viewed on the <systemitem>xkeyboard-config(7)</systemitem> man page under <literal>Options</literal>.
fr: Les options de commutation disponibles sont visibles dans la page de manuel <systemitem>xkeyboard-config(7)</systemitem> sous le titre <literal>Options</literal>.

source: The following example sets up two keyboard layouts (<literal>English (US)</literal> and <literal>Czech (qwerty)</literal>) using the <option>--xlayouts=</option> option, and allows to switch between them using <keycombo><keycap>Alt</keycap><keycap>Shift</keycap></keycombo>:
fr: L'exemple qui suit définit deux agencements de clavier (<literal>English (US)</literal> et <literal>Czech (qwerty)</literal>) en utilisant l'option <option>--xlayouts=</option> et permet la commutation de l'un à l'autre par la combinaison de touches <keycombo><keycap>Alt</keycap><keycap>Shift</keycap></keycombo>:

source: lang (optional) - Configure Language During Installation
fr: lang (facultative) - Configuration de la langue utilisée durant l'installation

source: Sets the language to use during installation and the default language to use on the installed system.
fr: Définit la langue à utiliser durant l'installation et la langue par défaut du système installé.

source: <command>lang <replaceable>language</replaceable> [--addsupport=]</command>
fr: <command>lang <replaceable>langue</replaceable> [--addsupport=]</command>

source: The file <filename>/usr/share/system-config-language/locale-list</filename> provides a list of the valid <replaceable>language</replaceable> codes in the first column of each line and is part of the <package>system-config-language</package> package.
fr: Le fichier <filename>/usr/share/system-config-language/locale-list</filename> fournit une liste des codes de <replaceable>langue</replaceable> dans la première colonne ; il fait partie du paquet <package>system-config-language</package>.

source: Certain languages (for example, Chinese, Japanese, Korean, and Indic languages) are not supported during text-mode installation. If you specify one of these languages with the <command>lang</command> command and use text mode, the installation process will continue in English, but the installed system will use your selection as its default language.
fr: Certaines langues (par exemple , le chinois, le japonais, le coréen et les langues indo-ariennes) ne sont pas prises en charge lors d'une installation en mode textuel. Si vous spécifiez l'une de ces langues avec la commande <command>lang</command> et que vous utilisez le mode d'installation textuel, le processus continue en anglais, mais le système installé utilisera votre choix comme langue par défaut.

source: Add support for additional languages. Takes the form of comma-separated list without spaces. For example:
fr: Ajoute la prise en charge de langues supplémentaires. Prend la forme d'une liste de noms, séparés l'un de l'autre par une virgule mais sans aucune espace. Par exemple :

source: services (optional) - Configure Services
fr: services (facultative) - Configuration des services
