Repository: jaaf/po_purifier
Catalog: testing_data/Kickstart_Syntax_Reference.po
Languages: fr

source: To clear a multipath device, use the format <literal>disk/by-id/scsi-<replaceable>WWID</replaceable></literal>, where <replaceable>WWID</replaceable> is the <firstterm>world-wide identifier</firstterm> for the device. For example, to clear a disk with WWID <literal>58095BEC5510947BE8C0360F604351918</literal>, use:
fr: Pour supprimer les partitions d'un périphérique multichemin (multipath), utilisez le format <literal>disk/by-id/scsi-<replaceable>WWID</replaceable></literal>, dans lequel <replaceable>WWID</replaceable> est le <firstterm>world-wide identifier</firstterm> (identifiant globalement unique) pour le périphérique. Par exemple, pour supprimer les partitions d'un disque avec l'identifiant globalement unique <literal>58095BEC5510947BE8C0360F604351918</literal>, utilisez :

source: This format is preferable for all multipath devices, but if errors arise, multipath devices that do not use <firstterm>logical volume management</firstterm> (LVM) can also be cleared using the format <literal>disk/by-id/dm-uuid-mpath-<replaceable>WWID</replaceable></literal>, where <replaceable>WWID</replaceable> is the <firstterm>world-wide identifier</firstterm> for the device. For example, to clear a disk with WWID <literal>2416CD96995134CA5D787F00A5AA11017</literal>, use:
fr: Ce format est à préférer pour tous les périphériques multichemins (multipath), mais si des erreurs se produisent, les partitions des périphériques multipath qui n'utilisenet pas le <firstterm>logical volume management</firstterm> (LVM) peuvent également être supprimées en utilisant le format <literal>disk/by-id/dm-uuid-mpath-<replaceable>WWID</replaceable></literal>, où <replaceable>WWID</replaceable> est l'<firstterm>identifiant globalement unique</firstterm> du périphérique. Par exemple, pour effacer les partitions d'un disque avec l'identifiant globalement unique <literal>2416CD96995134CA5D787F00A5AA11017</literal>, utilisez :

source: Never specify multipath devices by device names like <literal>mpatha</literal>. Device names such as this are not specific to a particular disk. The disk named <filename>/dev/mpatha</filename> during installation might not be the one that you expect it to be. Therefore, the <command>clearpart</command> command could target the wrong disk.
fr: Ne spécifiez jamais les périphériques multichemins par leur nom de périphérique tel que <literal>mpatha</literal>. De tels noms de périphériques ne sont pas spécifiques à un disque en particulier. Le disque nommé <filename>/dev/mpatha</filename> pendant l'installation peut ne pas être celui que vous croyez et la commande <command>clearpart</command> peut prendre pour cible le mauvais disque.

source: Specifies which partitions to clear. This option overrides the <option>--all</option> and <option>--linux</option> options if used. Can be used across different drives. For example:
fr: Spécifie quelles partitions supprimer. Cette option prévaut sur les options<option>--all</option> et <option>--linux</option> si utilisées. Peut être utilisée sur plusieurs disques. Par exemple :

source: Create a set disk label when relabeling a disk.
fr: Crée une étiquette de disque lors du ré-étiquetage d'un disque.

source: Erases all Linux partitions.
fr: Supprime toutes les partitions Linux.

source: Do not remove any partitions. This is the default behavior - using this option is the same as not using the <command>clearpart</command> command at all.
fr: Ne supprime aucune partition. C'est le comportement par défaut – utiliser cette option revient à ne pas utiliser la commande <command>clearpart</command> du tout.

source: Using the <command>clearpart --all</command> command in a Kickstart file to remove all existing partitions during the installation will cause <application>Anaconda</application> to pause and prompt you for a confirmation. If you need to perform the installation automatically with no interaction, add the <command>zerombr</command> command to your Kickstart file.
fr: L'utilisation de la commande <command>clearpart --all</command> dans un fichier Kickstart pour supprimer toutes les partitions pendant l'installation conduit <application>Anaconda</application> à marquer une pause et à vous demander confirmation Si vous avez besoin d'effectuer l'installation automatiquement et sans interaction, ajoutez la commande <command>zerombr</command> à votre fichier Kickstart.

source: fcoe (optional) - Configure Fibre Channel Over Ethernet Devices
fr: fcoe (facultative) - Configuration des périphériques « Fibre Channel Over Ethernet » (FCoE)

source: Specify which FCoE devices should be activated automatically in addition to those discovered by <firstterm>Enhanced Disk Drive Services</firstterm> (EDD).
fr: Spécifiez quels périphériques FCoE doivent être activés automatiquement en plus de ceux découverts par <firstterm>Enhanced Disk Drive Services</firstterm> (EDD) (Services de disques durs améliorés).

source: <command>fcoe --nic=<replaceable>name</replaceable> [--dcp= | --autovlan]</command>
fr: <command>fcoe --nic=<replaceable>nom</replaceable> [--dcp= | --autovlan]</command>

source: <option>--nic=</option> (required)
fr: <option>--nic=</option> (requise)

source: Name of the device to be activated.
fr: Nom du périphérique à activer

source: Establish <firstterm>Data Center Bridging</firstterm> (DCB) settings.
fr: Établit les réglages <firstterm>Data Center Bridging</firstterm> (DCB).

source: Discover VLANs automatically.
fr: Découvre les VLANs automatiquement.

source: ignoredisk (optional) - Ignore Specified Disks
fr: ignoredisk (facultative) - Ignore les disques spécifiés

source: Causes the installation program to ignore the specified disks. This is useful if you use autopartition and want to be sure that some disks are ignored. For example, without <command>ignoredisk</command>, attempting to deploy on a SAN cluster the Kickstart would fail, as the installation program detects passive paths to the SAN that return no partition table.
fr: Conduit l'installateur à ignorer les disques spécifiés. Ceci est utile si vous utilisez le partitionnement automatique et voulez être sûr que certains disques sont ignorés. Par exemple, sans la commande <command>ignoredisk</command>, tenter de déployer sur un cluster SAN fait échouer le Kickstart, car l'installateur détecte des chemins passifs vers le SAN qui ne retournent aucune table des partitions.

source: Specify one or more drives to ignore. Multiple drives can be specified as a comma-separated list. For example:
fr: Spécifie un ou plusieurs disques à ignorer en les séparant par une virgule. Par exemple :

source: To ignore a multipath device that does not use <firstterm>logical volume management</firstterm> (LVM), use the format <literal>disk/by-id/dm-uuid-mpath-<replaceable>WWID</replaceable></literal>, where <replaceable>WWID</replaceable> is the <firstterm>world-wide identifier</firstterm> for the device. For example, to ignore a disk with WWID <literal>2416CD96995134CA5D787F00A5AA11017</literal>, use:
fr: Pour ignorer un périphérique multichemin qui n'utilise pas la <firstterm>gestion de volumes logiques</firstterm> (LVM), utilisez le format <literal>disk/by-id/dm-uuid-mpath-<replaceable>WWID</replaceable></literal>, où <replaceable>WWID</replaceable> désigne l'<firstterm>identifiant globalement unique</firstterm> (World-Wide IDentifier) du périphérique. Par exemple, pour ignorer un disque avec un WWID égal à <literal>2416CD96995134CA5D787F00A5AA11017</literal>, utilisez :

source: Multipath devices that use LVM are not assembled until after <application>Anaconda</application> has parsed the Kickstart file. Therefore, you cannot specify these devices in the format <literal>dm-uuid-mpath</literal>. Instead, to ignore a multipath device that uses LVM, use the format <literal>disk/by-id/scsi-<replaceable>WWID</replaceable></literal>, where <replaceable>WWID</replaceable> is the <firstterm>world-wide identifier</firstterm> for the device. For example, to ignore a disk with WWID <literal>58095BEC5510947BE8C0360F604351918</literal>, use:
fr: Les périphériques multichemins qui utilisent LVM ne sont pas assemblés avant qu'<application>Anaconda</application> n'ait analysé le fichier Kickstart. Vous ne pouvez donc pas spécifier ces périphériques avec le format <literal>dm-uuid-mpath</literal>. Au lieu de cela, pour ignorer un périphérique multichemin qui utilise LVM, utilisez le format <literal>disk/by-id/scsi<replaceable>WWID</replaceable></literal>, où <replaceable>WWID</replaceable> est l'<firstterm>identifiant globalement unique</firstterm> pour le périphérique. Par exemple, pour ignorer un disque avec le WWID <literal>58095BEC5510947BE8C0360F604351918</literal>, utilisez :

source: Specifies a list of disks for the installation program to use. All other disks are ignored. For example, to use disk <literal>sda</literal> during installation and ignore all other disks:
fr: Spécifie une liste de disques à utiliser pour l'installation. Tous les autres disques sont ignorés. Par exemple, pour utiliser le disque <literal>sda</literal> pendant l'installation et ignorer tous les autres :

source: To include a multipath device that does not use LVM:
fr: Pour inclure un périphérique multichemin qui n'utilise pas LVM :

source: To include a multipath device that uses LVM:
fr: Pour inclure un périphérique multichemin qui utilise LVM :

source: Allows you to manually navigate the advanced storage screen.
fr: Vous permet de naviguer manuellement dans l'écran de stockage avancé.

source: iscsi (optional) - Configure iSCSI Devices
fr: iscsi (facultative - Configuration des périphériques iSCSI

source: Specifies additional iSCSI storage to be attached during installation. If you use the <command>iscsi</command> command, you must also assign a name to the iSCSI node, using the <command>iscsiname</command> command (see <xref linkend="sect-kickstart-commands-iscsiname" />. The <command>iscsiname</command> command must appear before the <command>iscsi</command> command in the Kickstart file.
fr: Spécifie des stockage SCSI additionnels à attacher durant l'installation. Si vous utilisez la commande <command>iscsi</command>, vous devez donner un nom au nœud SCSI avec la commande <command>iscsiname</command> (voir la <xref linkend="sect-kickstart-commands-iscsiname" />. La commande <command>iscsiname</command> doit apparaître avant la commande <command>iscsi</command> dans le fichier Kickstart.

source: You should configure iSCSI storage in the system BIOS or firmware (iBFT for Intel systems) rather than use the <command>iscsi</command> command if possible. If you do so, <application>Anaconda</application> automatically detects and uses disks configured in BIOS or firmware and no special configuration is necessary in the Kickstart file.
fr: Vous devez, si possible, configurer le stockage iSCSI dans le micrologiciel du système (BIOS ou iBFT pour les systèmes Intel) plutôt qu'utiliser la commande <command>iscsi</command>. En faisant ainsi, <application>Anaconda</application> détecte automatiquement et utilise les disques configurés dans le micrologiciel sans qu'aucune configuration spéciale ne soit nécessaire dans le fichier Kickstart.

source: If you must use the <command>iscsi</command> command, make sure that networking is activated at the beginning of the installation, and that the <command>iscsi</command> command appears in the Kickstart file <emphasis>before</emphasis> you refer to iSCSI disks with commands such as <command>clearpart</command> or <command>ignoredisk</command>.
fr: Si vous devez utiliser la commande <command>iscsi</command>, assurez-vous que le réseau est activé au début de l'installation et que la commande <command>iscsi</command> est, dans le fichier Kickstart, placée <emphasis>avant</emphasis> de faire référence aux disques SCSI avec des commandes telles que <command>clearpart</command> ou <command>ignoredisk</command>.

source: The IP address of the target to connect to.
fr: L'adresse IP de la cible à laquelle se connecter.

source: The port number (typically <literal>3260</literal>).
fr: Le numéro de port (typiquement <literal>3260</literal>).

source: Target <firstterm>IQN</firstterm> (iSCSI Qualified Name).
fr: Cible <firstterm>IQN</firstterm> (iSCSI Qualified Name)(Nom iSCSI qualifié).

source: Bind the connection to a specific network interface instead of using the default one determined by the network layer. Once used, it must be specified in all instances of the <command>iscsi</command> command in the entire Kickstart file.
fr: Lie la connexion à un réseau spécifique plutôt que d'utiliser celui par défaut déterminé par la couche réseau. Une fois utilisée, elle doit être spécifiée dans toutes les instances de la commande <command>iscsi</command> dans le fichier Kickstart tout entier.

source: User name required to authenticate with the target.
fr: Nom d'utilisateur pour s'authentifier auprès de la cible.

source: Password that corresponds with the user name specified for the target.
fr: Mot de passe qui correspond au nom d'utilisateur spécifié pour la cible.

source: User name required to authenticate with the initiator from a target using reverse CHAP authentication.
fr: Nom d'utilisateur requis pour l'authentification auprès de l'initiateur d'une cible en utilisant l'authentification CHAP inversée

source: Password that corresponds with the user name specified for the initiator.
fr: Mot de passe qui correspond à l'utilisateur spécifié pour l'initiateur.

source: iscsiname (optional) - Assign Name to iSCSI Device
fr: iscsiname (facultative) - Assignation d'un nom au périphérique iSCSI

source: Assigns a name to an iSCSI node specified by the <command>iscsi</command> command (<xref linkend="sect-kickstart-commands-iscsi" />). This command is mandatory if you use the <command>iscsi</command> command, and it must be specified <emphasis>before</emphasis> you use <command>iscsi</command>.
fr: Assigne un nom à un nœud iSCSI spécifié par la commande <command>iscsi</command> (<xref linkend="sect-kickstart-commands-iscsi" />). Cette commande est obligatoire si vous utilisez la commande <command>iscsi</command>, et elle doit être spécifiée <emphasis>avant</emphasis> d'utiliser la commande <command>iscsi</command>.

source: logvol (optional) - Create LVM Logical Volume
fr: logvol (facultative) - Création d'un volume logique LVM

source: Create a logical volume for Logical Volume Management (LVM) with the syntax:
fr: Créez un volume logique pour LVM (Gestion de volumes logiques) avec la syntaxe :

source: <command>logvol <replaceable>mntpoint</replaceable> --vgname= --name= [<replaceable>options</replaceable>]</command>
fr: <command>logvol <replaceable>point_de_montage</replaceable> --vgname= --name= [<replaceable>options</replaceable>]</command>

source: Do not use the dash (<literal>-</literal>) character in logical volume and volume group names when installing &PRODUCT; using Kickstart. If this character is used, the installation will finish normally, but the <filename class="directory">/dev/mapper/</filename> directory will list these volumes and volume groups with every dash doubled. For example, a volume group named <literal>volgrp-01</literal> containing a logical volume named <literal>logvol-01</literal> will be listed as <filename>/dev/mapper/volgrp--01-logvol--01</filename>.
fr: N'utilisez pas le caractère trait d'union (<literal>-</literal>) dans les noms de volumes logiques et de groupes de volume en installant &PRODUCT; avec Kickstart. Si ce caractère est utilisé, l'installation se terminera normalement mais le dossier <filename class="directory">/dev/mapper/</filename> listera ces volumes et groupes de volume avec chacun des traits d'union redoublé. Par exemple, un volume logique nommé <literal>logvol-01</literal>, contenu dans un groupe de volume nommé <literal>volgrp-01</literal>, sera listé comme <filename>/dev/mapper/volgrp--01-logvol--01</filename>.

source: This limitation only applies to newly created logical volume and volume group names. If you are reusing existing ones using the <option>--noformat</option> or <option>--useexisting</option> option, their names will not be changed.
fr: Cette limitation ne concerne que les volumes logiques et les groupes de volumes nouvellement créés. Si vous réutilisez des volumes existants en utilisant l'option <option>--noformat</option> ou <option>--useexisting</option>, leur nom ne sera pas changé.

source: For a detailed example of <command>logvol</command> in action, see <xref linkend="sect-kickstart-example-advanced-partitioning" />.
fr: Pour un exemple détaillé de <command>logvol</command> en action, reportez-vous à la <xref linkend="sect-kickstart-example-advanced-partitioning" />.

source: <replaceable>mntpoint</replaceable>
fr: <replaceable>point_de_montage</replaceable>

source: Replace with the volume's mount point. This name can take the following forms:
fr: Remplacez par le point de montage du volume. Ce nom peut prendre une des formes suivantes :

source: <filename>/<replaceable>path</replaceable></filename>
fr: <filename>/<replaceable>chemin</replaceable></filename>

source: A path to the mount point - for example, <literal>/</literal> or <literal>/home</literal>
fr: Un chemin vers le point de montage - par exemple, <literal>/</literal> ou <literal>/home</literal>

source: The partition is used as swap space.
fr: La partition est utilisée en tant qu'espace d'échange.

source: To determine the size of the swap partition automatically, use the <option>--recommended</option> option:
fr: Pour déterminer la taille de la partition d'échange (swap) automatiquement, ajoutez l'option <option>--recommended</option> :

source: To determine the size of the swap partition automatically but also allow extra space for your system to hibernate, use the <option>--hibernation</option> option:
fr: Pour déterminer la taille de la partition d'échange (swap) automatiquement mais aussi donner de l'espace supplémentaire à votre système pour l'hibernation, utilisez l'option <option>--hibernation</option> :

source: The size assigned will be equivalent to the swap space assigned by <option>--recommended</option> plus the amount of RAM on your system.
fr: La taille assignée est égale à l'espace d'échange assigné par <option>--recommended</option> augmentée de la taille de la RAM de votre système.

source: For the swap sizes assigned by these commands, see the section describing swap in <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Pour les tailles de l'espace d'échange assignées par ces commandes, reportez-vous à la partie qui traite de l'espace d'échange (swap) dans la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.

source: Used only when creating a thin pool volume.
fr: Utilisée seulement lors de la création d'un volume à allocation fine.

source: Use an existing logical volume and do not format it.
fr: Utilise un volume logique existant et ne le formate pas.

source: Use an existing logical volume and format it.
fr: Utilise un volume logique et le formate.

source: Sets the file system type for the logical volume. Valid values are <literal>xfs</literal>, <literal>ext2</literal>, <literal>ext3</literal>, <literal>ext4</literal>, <literal>swap</literal>, and <literal>vfat</literal>. See <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> for information about available file systems.
fr: Définit le type du système de fichiers pour le volume logique. Les valeurs valides sont <literal>xfs</literal>, <literal>ext2</literal>, <literal>ext3</literal>, <literal>ext4</literal>, <literal>swap</literal> et <literal>vfat</literal>. Voir la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> pour de l'information sur les systèmes de fichiers disponibles.

source: Specifies a free form string of options to be used when mounting the filesystem. This string will be copied into the <filename>/etc/fstab</filename> file of the installed system and should be enclosed in quotes. For example:
fr: Spécifie une chaîne de forme libre des options à utiliser lors du montage du système de fichiers. Cette chaîne est copiée dans le fichier <filename>/etc/fstab</filename> du système installé et doit être bordée par des guillemets anglais simples. Par exemple :

source: Specifies additional parameters to be passed to the program that makes a filesystem on this logical volume. No processing is done on the list of arguments, so they must be supplied in a format that can be passed directly to the mkfs program. This means multiple options should be comma-separated or surrounded by double quotes, depending on the filesystem.
fr: Spécifie des paramètres additionnels à passer au programme qui crée le système de fichiers sur ce volume logique. Aucun traitement n'est effectué, c'est pourquoi ils doivent être fournis dans un format reconnu par le programme mkfs. Cela signifie que les options multiples doivent être séparées par une virgule ou bordées de guillemets doubles, selon le type de système de fichiers.

source: Sets a label for the logical volume.
fr: Définit une étiquette pour le volume logique.

source: Grow the volume to fill available space (if any), or up to the limit set by the <option>--maxsize=</option> option.
fr: Agrandit le volume pour occuper tout l'espace (s'il en reste) ou l'occuper jusqu'à la limite définie par l'option <option>--maxsize=</option>.

source: The size of the logical volume in megabytes. This option can not be used together with the <option>--percent=</option> option.
fr: La taille du volume logique en mégaoctets. Cette option peut être utilisée simultanément avec l'option <option>--percent=</option>.

source: Specify the amount by which to grow the logical volume, as a percentage of the free space in the volume group after any statically-sized logical volumes are taken into account. This option can not be used together with the <option>--size=</option> and <option>--grow</option> options.
fr: Spécifie la quantité de laquelle agrandir le volume logique sous forme de pourcentage de l'espace libre dans le groupe de volumes après que la taille des volumes de taille statique a été prise en compte. Cette option ne peut pas être utilisée simultanément avec les options <option>--size=</option> et <option>--grow</option>.

source: When creating a new logical volume, you must either specify its size statically using the <option>--size=</option> option, or as a percentage of remaining free space using the <option>--percent=</option> option. You can not use both of these options on the same logical volume.
fr: Lors de la création d'un volume logique, vous devez spécifier sa taille, soit statiquement avec l'option <option>--size=</option>, soit sous forme de pourcentage de l'espace libre résiduel avec l'option <option>--percent=</option>. Vous ne pouvez pas utiliser ces deux options à la fois pour le même volume logique.

source: The maximum size in megabytes when the logical volume is set to grow. Specify an integer value here such as <literal>500</literal> (do not include the unit).
fr: Définit la taille maximum du volume logique en mégaoctets lorsque celui-ci est appelé à s'agrandir par l'option grow. Spécifiez une valeur entière ici comme par exemple <literal>500</literal> (n'ajoutez pas l'unité).
