Repository: jaaf/po_purifier
Catalog: testing_data/SourceSpoke.po
Languages: fr

source: Installation Source
fr: Source d'installation

source: The <guilabel>Installation Source</guilabel> screen allows you to specify a location (local or on the network) from which packages will be downloaded and installed on your system. This screen will be configured automatically in most cases, but you can change your settings or add additional sources.
fr: L'écran <guilabel>Source d'installation</guilabel> vous permet de spécifier un emplacement (local ou sur le réseau) à partir duquel les paquets seront téléchargés et installés sur votre système. Cet écran est configuré automatiquement dans la plupart des cas, mais vous pouvez changer vos réglages ou ajouter d'autres sources.

source: Normally, when you first enter the <guilabel>Installation Summary</guilabel> screen, the installer will attempt to configure an installation source based on the type of media you used to boot. The full &PRODUCT; Server DVD will configure the source as local media, the netinst ISO image will configure the closest network mirror, etc. This process takes some time, especially if the default source is a network mirror. If you plan to use a custom installation source, use the <option>inst.askmethod</option> boot option to skip the initial configuration; this will allow you to enter this screen immediately. See <xref linkend="sect-boot-options-sources" /> for information about boot options.
fr: Normalement, lorsque vous entrez dans l'écran <guilabel>Résumé de l'installation</guilabel> pour la première fois, l'installateur essaye de configurer une source d'installation en se basant sur le type de média que vous avez utilisé pour démarrer. Le DVD &PRODUCT; Server complet configure la source en tant que média local, l'image ISO netinst configure le miroir réseau le plus proche, etc. Ce processus prend un certain temps, en particulier, si la source par défaut est un miroir réseau. Si vous envisagez d'utiliser une source d'installation personnalisée, utilisez l'option de démarrage <option>inst.askmethod</option> pour passer la configuration initiale ; cela vous permet d'entrer dans cet écran immédiatement. Voir la <xref linkend="sect-boot-options-sources" /> pour plus d'information sur les options de démarrage.

source: The following options are available. Note that not all of them may be displayed.
fr: Les options suivantes sont disponibles ; notez qu'elles ne peuvent toutes être affichées :

source: Auto-detected installation media
fr: Auto-détection du média d'installation

source: This is the option selected by default if you started the installer from media containing an installation source, such as a live DVD. No additional configuration is necessary. You can click the <guilabel>Verify</guilabel> button check the media integrity.
fr: C'est l'option sélectionnée par défaut si vous avez démarré l'installateur d'un média contenant une source d'installation, tel qu'un DVD live. Aucune configuration supplémentaire n'est requise. Vous pouvez cliquer sur le bouton <guilabel>Vérifier</guilabel> pour vérifier l'intégrité du média.

source: ISO file
fr: Fichier ISO

source: This option will appear if the installation program detected a partitioned hard drive with mountable file systems during boot. Select this option, click the <guibutton>Choose an ISO</guibutton> button, and browse to the installation ISO file's location on your system. You can click the <guilabel>Verify</guilabel> button to check the file's integrity.
fr: Cette option apparaît si l'installateur a détecté un disque dur partitionné avec un système de fichiers montable lors du démarrage. Sélectionnez cette option, cliquez sur le bouton <guibutton>Choisissez une ISO</guibutton> et utilisez le navigateur de fichiers pour trouver le fichier ISO sur votre système. Vous pouvez cliquer sur le bouton <guilabel>Vérifier</guilabel> pour vérifier l'intégrité du fichier ISO.

source: On the network
fr: Sur le réseau

source: Use this option to download packages to be installed from a network location instead of local media. This is the default selection on network installation media.
fr: Utilisez cette option pou télécharger les paquets à installer d'un emplacement réseau plutôt que d'un média local. C'est la sélection par défaut pour un média d'installation réseau.

source: In most cases, the <guilabel>Closest mirror</guilabel> option available from the protocol selection drop-down menu is preferable. If this option is selected, packages for your system will be downloaded from the most suitable location (mirror).
fr: Dans la plupart des cas, l'option <guilabel>Miroir le plus proche</guilabel> disponible dans le menu de sélection du protocole est préférable. Si cette option est sélectionnée, les paquets à installer seront téléchargés du miroir le plus approprié.

source: To manually configure a network-based installation source, use the drop-down menu to specify the protocol to be used when downloading packages. This setting depends on the server you want to use. Then, type the server address (without the protocol) into the address field. If you choose NFS, a second input field will appear where you can specify custom <guilabel>NFS mount options</guilabel>.
fr: Pour configurer manuellement une source d'installation basée sur le réseau, utilisez le menu déroulant pour spécifier le protocole à utiliser pour le téléchargement des paquets. Ce réglage dépend du serveur que vous voulez utiliser. Ensuite, tapez l'adresse du serveur (sans le protocole) dans le champ d'adresse. Si vous choisissez NFS, un deuxième champ apparaît où vous pouvez spécifier des <guilabel>Options de montage NFS</guilabel> personnalisées.

source: When selecting an NFS installation source, you must specify the address with a colon (<literal>:</literal>) character separating the host name from the path. For example:
fr: Lors de la sélection d'une installation NFS, vous devez spécifier l'adresse avec un caractère deux-points (<literal>:</literal>) entre le nom d'hôte et le chemin. Par exemple :

source: <literal><replaceable>server.example.com</replaceable>:<replaceable>/path/to/directory</replaceable></literal>
fr: <literal><replaceable>server.example.com</replaceable>:<replaceable>/chemin/du/répertoire</replaceable></literal>

source: To configure a proxy for an HTTP or HTTPS source, click the <guibutton>Proxy setup</guibutton> button. Check <guilabel>Enable HTTP proxy</guilabel> and type the URL into the <guilabel>Proxy URL</guilabel> box. If the proxy server requires authentication, check <guilabel>Use Authentication</guilabel> and enter your user name and password. Click <guibutton>OK</guibutton> to finish the configuration.
fr: Pour spécifier un serveur mandataire pour une source HTTP ou HTTPS, cliquez sur le bouton <guibutton>Configuration du proxy</guibutton>. Cochez <guilabel>Activer le proxy HTTP</guilabel> et entrez l'URL dans la boîte <guilabel>URL de proxy</guilabel>. Si le serveur mandataire requiert une authentification, cochez la case <guilabel>Utiliser l'authentication</guilabel> et entrez votre nom d'utilisateur et votre mot de passe. Cliquez sur le bouton <guibutton>OK</guibutton> pour terminer la configuration.

source: If your HTTP or HTTPS URL refers to a repository mirror list, mark the check box under the address field.
fr: Si votre URL HTTP ou HTTPS fait référence à une liste de dépôts miroir, cochez la case sous le champ d'adresse.

source: You can also specify additional repositories in the <guilabel>Additional repositories</guilabel> section to gain access to more installation environments and software add-ons. All environments and add-ons will be available for selection in <xref linkend="sect-installation-gui-software-selection" /> once you finish configuring the sources.
fr: Vous pouvez également spécifier des dépôts supplémentaires dans la section <guilabel>Dépôts supplémentaires</guilabel> pour avoir accès à plus d'environnements d'installation et de modules logiciels additionnels. Tous les environnements et tous les modules additionnels sont sélectionnables dans l'écran objet de la <xref linkend="sect-installation-gui-software-selection" /> une fois que vous en avez terminé avec la configuration des sources.

source: To add a repository, click the <guibutton>+</guibutton> button. To delete a repository, select one in the list and click the <guibutton>-</guibutton> button. Click the arrow icon to revert to the previous list of repositories, i.e. to replace current entries with those that were present at the time you entered the <guilabel>Installation Source</guilabel> screen. To activate or deactivate a repository, click the check box in the <guilabel>Enabled</guilabel> column at each entry in the list.
fr: Pour ajouter un dépôt, cliquez sur le bouton <guibutton>+</guibutton>. Pour supprimer un dépôt, sélectionnez-le dans la liste et cliquez sur le bouton <guibutton>-</guibutton>. Cliquez sur le bouton marqué d'une flèche circulaire pour revenir à la liste d'origine, c'est à dire à la liste telle qu'elle était au moment où vous êtes entré dans l'écran <guilabel>Source d'installation</guilabel>. Pour activer ou désactiver un dépôt, cochez, ou décochez, la case à côté de l'entrée dans la colonne <guilabel>Activé</guilabel>.

source: You can name your additional repository and configure it the same way as the primary repository on the network using the input fields on the right side of the section.
fr: Vous pouvez attribuer un nom à vos dépôts additionnels et les configurer tout comme les dépôts primaires sur le réseau en utilisant les champs de saisie à droite de la sélection.

source: Once you have selected your installation source, click <guilabel>Done</guilabel> in the top left corner to return to <xref linkend="sect-installation-gui-installation-summary" />.
fr: Une fois la sélection de vos sources d'installation faite, cliquez sur le bouton <guilabel>Fait</guilabel> en haut à gauche pour retourner à l'écran de la <xref linkend="sect-installation-gui-installation-summary" />.
