Repository: jaaf/po_purifier
Catalog: testing_data/StorageSpoke.po
Languages: fr

source: Installation Destination
fr: Destination de l'installation

source: The <guilabel>Installation Destination</guilabel> screen allows you to configure storage options - namely, which disks will be used as the installation target for your &PRODUCT; installation. At least one disk must always be selected for the installation to proceed.
fr: L'écran <guilabel>Cible de 2 MB 3 Mio MBR 7 MiB function() function(as) l'installation</guilabel> vous permet de configurer les options de stockage – c'est à dire quels disques seront utilisés en tant que cible pour votre installation de &PRODUCT;. Il faut toujours sélectionner au moins un disque pour que l'installation soit possible.

source: For information about the theory and concepts behind disk partitioning in Linux, see <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Pour de l'information sur les concepts du partitionnement sous Linux, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.

source: If you plan to use a disk which already contains some data - for example, if you want to shrink an existing Microsoft Windows partition and install &PRODUCT; as a second system or if you are upgrading a previous release of &PRODUCT;, make sure to back up any important data first. Manipulating partitions always carries a risk - if the process is interrupted or fails for any reason (installer error, hardware failure, power outage, etc.), any data already on the disk may become impossible to recover.
fr: Si vous envisagez d'utiliser un disque qui contient déjà des données – par exemple si vous désirez rétrécir une partition Microsoft Windows existante et y installer &PRODUCT; en tant que second système ou si vous allez procéder à la montée en version de &PRODUCT;, commencez par sauvegarder vos données importantes. La manipulation des partitions n'est jamais sans risque – si le processus est interrompu pour une raison ou pour une autre (erreur de l'installateur, panne de matériel, perte d'alimentation électrique, etc.), tout ou partie des données sur le disque peut devenir irrécupérable.

source: In the top part of the screen, all locally available storage devices (SATA, IDE and SCSI hard drives, USB flash drives, etc.) are displayed in the <guilabel>Local Standard Disks</guilabel> section. Local disks are detected when the installer starts - any storage devices connected after the installation has started will not be shown.
fr: Dans la partie supérieure de l'écran, tous les périphériques de stockage disponibles (disques durs SATA, IDE et SCSI, disques flash USB, etc.) sont affichés dans la section <guilabel>Disques locaux standard</guilabel>. Les disques locaux sont sélectionnés lorsque l'installateur démarre – un périphérique raccordé après le démarrage de l'installation n'apparaît pas.

source: If you need to configure additional local storage devices, select <guilabel>I will configure partitioning</guilabel> and press <guilabel>Done</guilabel> to move to <xref linkend="sect-installation-gui-manual-partitioning" />. Then, connect any new hard drives you want to make available during the installation, and press the button marked by a circular arrow in the set of controls below the list of mount points on the left side of the screen. In the dialog window that opens, press <guilabel>Rescan Disks</guilabel> and wait until the scanning process completes. Then, press <guilabel>OK</guilabel> to return to <xref linkend="sect-installation-gui-storage-partitioning" />; all detected disks including any new ones will be displayed in the <guilabel>Local Standard Disks</guilabel> section.
fr: Si vous avez besoin de configurer des périphérique de stockage additionnels, cochez la case <guilabel>Je voudrais configurer le partitionnement</guilabel> et cliquez sur le bouton <guilabel>Fait</guilabel> pour passer au partitionnement manuel tel que décrit à la <xref linkend="sect-installation-gui-manual-partitioning" />. Ensuite, connectez tous les disques durs que vous voulez mettre à disposition de l'installateur et cliquez sur le bouton marqué d'une flèche circulaire dans le jeu de contrôles en bas de la liste des points de montage sur la partie gauche de l'écran. Dans la fenêtre de dialogue qui s'affiche, cliquez sur <guilabel> Réanalyser les disques</guilabel> et attendez que le processus d'analyse se termine. Ensuite, cliquez sur <guilabel>OK</guilabel> pour retourner dans l'écran de partitionnement décrit à la <xref linkend="sect-installation-gui-storage-partitioning" />; tous les disques détectés y compris les nouveaux sont affichés dans la section <guilabel>Disques locaux standard</guilabel>.

source: The <guilabel>Specialized &amp; Network Disks</guilabel> section below shows advanced network storage (such as iSCSI and FCoE disks) currently configured. When you first open this screen, no such devices will be displayed because they can not be automatically detected; to search for network storage devices <guilabel>Add a disk</guilabel> button and proceed with <xref linkend="sect-installation-gui-installation-destination" />. Any network storage you configure will then show up in the <guilabel>Specialized &amp; Network Disks</guilabel> the same way local disks are shown above.
fr: La section <guilabel>Disques spéciaux et réseau</guilabel> en dessous affiche les périphériques de stockage avancés réseau (tel que des disques iSCSI ou FCoE) déjà sélectionnés. Lorsque vous ouvrez cet écran pour la première fois, aucun de ces périphériques n'est affiché car ces derniers ne peuvent être détectés automatiquement. Pour rechercher un périphérique de stockage réseau, cliquez sur le bouton <guilabel>Ajouter un disque</guilabel> et suivez les instructions de la <xref linkend="sect-installation-gui-installation-destination" />. Tout périphérique de stockage réseau que vous configurerez apparaîtra ensuite dans la section <guilabel>Disques spéciaux et réseaux</guilabel> tout comme les disques locaux dans la section au-dessus.

source: All storage devices which will be used to install &PRODUCT; have a black circle icon with a white check mark on them. Disks not marked by this icon will not be used during the installation - they will be ignored if you choose automatic partitioning, and they will not be available in manual partitioning.
fr: Tous les périphériques de stockage qui seront utilisés pour installer &PRODUCT; sont marqués d'une icône – une coche blanche dans un disque noir. Les disques qui ne sont pas marqués avec cette icône, ne sont pas utilisés pendant l'installation – ils sont ignorés si vous choisissez le partitionnement automatique et ils ne sont pas disponibles pour le partitionnement manuel.

source: USB storage devices such as flash drives and external disks will be shown in the <guilabel>Local Standard Disks</guilabel> as well, and they will be available for selection the same way internal hard drives are. Make sure to <emphasis>not</emphasis> select any removable storage as installation targets unless you really want to do so. If you accidentally use a removable drive to install &PRODUCT; and then unplug it, your system will likely become unusable.
fr: Les périphériques de stockage USB, comme les disques flash et les disques externes sont eux-aussi présentés dans la section <guilabel>Disques locaux standard</guilabel> et ils sont disponibles pour la sélection au même titre que les disques durs locaux. Assurez-vous de ne <emphasis>pas</emphasis> sélectionner un tel périphérique en tant que cible à moins que vous ne le désiriez réellement. Si vous utilisez un périphérique amovible pour installer &PRODUCT; et que vous le déconnectez ensuite, votre système sera probablement inutilisable.

source: Unselected and Selected Disk
fr: Disques sélectionnés et disques non sélectionnés

source: After you select all disks you want to install &PRODUCT;, select one of the two options in the <guilabel>Other Storage Options</guilabel> section:
fr: Après que vous avez sélectionné tous les disques que vous désirez pour installer &PRODUCT;, sélectionnez une des deux options dans la section <guilabel>Autres options de stockage</guilabel> :

source: <guilabel>Automatically configure partitioning</guilabel> - If this option is selected, then after you press <guilabel>Done</guilabel> in the top left corner of the screen, the installer will determine the total amount of space on all selected disks, and it will create a <firstterm>Logical Volume Management</firstterm> (LVM) layout suitable for your system. The specifics of this layout depend on whether your system uses BIOS or UEFI firmware, the total amount of free space on your disks, and the amount of RAM on your system (which determines the size of your swap space).
fr: <guilabel>Configurer automatiquement le partitionnement</guilabel> - si cette option est sélectionnée, après que vous avez cliqué sur le bouton <guilabel>Fait </guilabel> en haut à gauche de l'écran, l'installateur détermine la quantité totale d'espace disponible sur tous les disques sélectionnés et crée un partitionnement <firstterm>Logical Volume Management</firstterm> (LVM) adapté à votre système. Les caractéristiques particulières de ce partitionnement dépendent du micrologiciel de votre machine – BIOS ou UEFI –, de sa quantité totale d'espace disponible sur vos disques et de sa quantité de mémoire RAM – qui détermine la taille de la partition d'échange (swap).

source: With automatic partitioning, you can also select the <guilabel>I would like to make additional space available</guilabel> option below. Use this option if you want to reclaim space from an existing partitioning layout - for example, if a disk you want to use already contains a different operating system, and you want to make this system's partitions smaller to allow more room for &PRODUCT;. The <guilabel>Reclaim space</guilabel> dialog which opens if this option is selected is described later in this section.
fr: En association avec le partitionnement automatique, vous pouvez également sélectionner l'option <guilabel>Je voudrais libérer plus d'espace</guilabel> juste en dessous. Utilisez cette option si vous voulez réclamer de l'espace à un partitionnement existant – par exemple, si un des disques que vous désirez utiliser contient déjà un autre système d'exploitation et que vous voulez rétrécir les partitions que lui sont allouées pour libérer de l'espace pour &PRODUCT;. La fenêtre de dialogue <guilabel>Libérer de l'espace</guilabel> qui s'affiche si cette option est sélectionnée est décrite plus loin dans cette section.

source: <guilabel>I will configure partitioning</guilabel> - Select this option and press <guilabel>Done</guilabel> in the top left corner of the screen to configure your system's partitioning layout manually. This requires some knowledge of the theory behind disk partitions and related concepts, but gives you full control over the way the system will be installed. For instructions for manual partitioning, see <xref linkend="sect-installation-gui-manual-partitioning" />.
fr: <guilabel>Je vais configurer le partitionnement</guilabel> - sélectionnez cette option et cliquez sur le bouton <guilabel>Fait</guilabel>, en haut à gauche de l'écran, pour configurer le partitionnement de votre système à la main. Cela demande une certaine connaissance de la théorie du partitionnement des disques mais vous donne un contrôle total sur la manière d'installer le système. Pour des instructions sur le partitionnement manuel, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning" />.

source: Additionally, you can select <guilabel>Encrypt my data</guilabel>; this will encrypt all partitions except the ones needed to boot the system (such as <filename class="directory">/boot</filename>) using <firstterm>Linux Unified Key Setup</firstterm> (LUKS). Encrypting your hard drive is recommended. For detailed information about LUKS encryption, see the <citetitle>&PRODUCT; Security&nbsp;Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: En option, vous pouvez sélectionner <guilabel>Chiffrer mes données</guilabel> ; cela chiffre toutes vos partitions – sauf celles qui sont nécessaires au démarrage du système comme <filename class="directory">/boot</filename> – en utilisant <firstterm>Linux Unified Key Setup</firstterm> (LUKS). Le chiffrement de votre disque dur est recommandé. Pour des informations détaillées sur le chiffrement LUKS, reportez-vous au <citetitle>Guide de la sécurité de &PRODUCT;</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: If you lose the LUKS passphrase, any encrypted partitions and the data on them will become completely inaccessible. There is no way to recover a lost passphrase. However, if you perform a Kickstart installation, you can save encryption passphrases and create backup encryption passphrases during the installation. See <xref linkend="chap-kickstart-installations" /> for information about Kickstart installations.
fr: Si vous perdez la phrase de passe de LUKS, toutes les partitions chiffrées et les données qu'elles contiennent deviennent complètement inaccessibles. Il n'y a aucune manière de récupérer une phrase de passe perdue. Cependant, si vous réalisez une installation Kickstart, vous pouvez sauvegarder les phrases de passe et créer une sauvegarde des phrases de passe de chiffrement pendant l'installation. Voir le <xref linkend="chap-kickstart-installations" /> pour de l'information sur Kickstart.

source: To control which one of your selected storage devices will contain the <firstterm>boot loader</firstterm>, click the <guilabel>Full disk summary and bootloader</guilabel> link in the bottom left corner of the screen, and follow the instructions in <xref linkend="sect-installation-gui-storage-partitioning-bootloader" />. Note that while in most cases it is sufficient to leave the boot loader in the default location, some configurations (for example, systems which require <firstterm>chain loading</firstterm> from another boot loader) will require the boot drive to be specified manually.
fr: Pour contrôler lequel de vos périphériques de stockage contiendra le <firstterm>chargeur de démarrage</firstterm>, cliquez sur le lien <guilabel>Résumé complet du disque et du chargeur de démarrage </guilabel> en bas à gauche de l'écran et suivez les instructions de la <xref linkend="sect-installation-gui-storage-partitioning-bootloader" />. Notez que, dans la plupart des cas, laisser le chargeur de démarrage dans l'emplacement par défaut convient. Quelques configurations – par exemple, les systèmes qui requièrent un <firstterm>chargement en chaîne</firstterm> à partir d'un autre chargeur de démarrage – demandent que le disque de démarrage soit spécifié à la main.

source: After you select storage devices, choose between automatic and manual partitioning, configure encryption and boot loader location, press <guilabel>Done</guilabel> in the top left corner of the screen. Then, depending on your settings, the following will happen:
fr: Après que vous avez sélectionné les périphériques de stockage, choisissez entre le partitionnement automatique et manuel, configurez le chiffrement et l'emplacement du chargeur de démarrage et cliquez sur le bouton <guilabel>Fait</guilabel> en haut à gauche de l'écran. Alors, selon vos réglages, se produit ce qui suit :

source: If you chose to encrypt your hard drive, the <guilabel>Disk Encryption Passphrase</guilabel> dialog will appear. Enter your chosen passphrase into the <guilabel>Passphrase</guilabel> and <guilabel>Confirm</guilabel> fields. When you do so, the passphrase will be automatically evaluated and its strength will be displayed, along with suggestions on how to make it stronger if the installer has determined it to be weak. For information about creating strong passwords, see <citetitle>&PRODUCT; Security&nbsp;Guide</citetitle>.
fr: Si vous avez choisi de chiffrer le disque dur, la fenêtre de dialogue <guilabel>Phrase de passe pour le chiffrement du disque</guilabel> s'affiche. Entrez la phrase de passe de votre choix dans le champ <guilabel>Phrase de passe</guilabel> et dans le champ <guilabel>Confirmer</guilabel>. Au fur et à mesure que vous saisissez les caractères de votre phrase de passe, sa force est évaluée et affichée avec des suggestions pour la rendre plus forte si elle est considérée trop faible. Pour de l'information sur la manière de créer des mots de passe solides, reportez-vous au <citetitle>Guide de la sécurité de &PRODUCT;</citetitle>.

source: If you selected automatic partitioning and the <guilabel>I would like to make additional space available</guilabel>, or if there is not enough free space on your selected hard drives to install &PRODUCT;, the <guilabel>Reclaim Space</guilabel> dialog will appear. This dialog lists all disk devices you have configured and all partitions on those devices. The bottom right corner of the dialog displays information about how much space the system needs for at least a minimal installation and how much space you have reclaimed.
fr: Si, avec la sélection du partitionnement automatique, vous avez sélectionné <guilabel>Je voudrais libérer plus d'espace</guilabel>, ou s'il n'y a pas assez d'espace libre sur les disques que vous avez sélectionnés pour installer &PRODUCT;, la fenêtre de dialogue <guilabel>Récupérer de l'espace disque</guilabel> s'affiche. Cette fenêtre présente tous les disques que vous avez configurés et, pour chacun d'eux, toutes les partitions qu'il contient. En bas à droite de la fenêtre, la quantité minimale d'espace requise est affichée ainsi que la quantité d'espace que vous avez libérée.

source: If you use the <guilabel>Reclaim Space</guilabel> dialog to <emphasis>delete</emphasis> a partition, all data on that partition will be lost. If you want to preserve your data, use the <guilabel>Shrink</guilabel> option, not the <guilabel>Delete</guilabel> option.
fr: Si vous utilisez la fenêtre de dialogue <guilabel>Récupérer de l'espace disque</guilabel> pour <emphasis>supprimer</emphasis> une partition, toutes les données présentes sur cette partition sont détruites. Si vous voulez préserver ces données, utilisez le bouton <guilabel>Réduire</guilabel>, pas le bouton <guilabel>Supprimer</guilabel>.

source: First, review the displayed list of available storage devices. The <guilabel>Reclaimable Space</guilabel> column shows how much space can be reclaimed from each entry. To reclaim space, select a disk or partition, and press either the <guilabel>Delete</guilabel> button to delete that partition (or all partitions on a selected disk), or <guilabel>Shrink</guilabel> to use free space on a partition while preserving existing data. Alternatively, you can press <guilabel>Delete all</guilabel> in the bottom right corner; this will delete all existing partitions on all disks and make this space available to &PRODUCT;, but all existing data on all disks will be lost.
fr: Commencez par passer en revue la liste des disques affichés. La colonne <guilabel>Espace récupérable</guilabel> indique la quantité d'espace récupérable pour chacune des entrées de la liste. Pour récupérer de l'espace, sélectionnez un disque, ou une partition, et cliquez, soit sur le bouton <guilabel>Supprimer</guilabel>, soit sur le bouton <guilabel>Réduire</guilabel> pour récupérer l'espace libre d'une partition tout en préservant les données existantes. Autrement, vous pouvez cliquer sur le bouton <guilabel>Tout supprimer</guilabel> en bas à droite – cela efface toutes les partitions de tous les disques et rend l'espace qu'elles utilisaient disponible pour installer &PRODUCT; mais, bien sûr, toutes les données de ces partitions sont perdues.

source: After you free enough space for your &PRODUCT; installation, press <guilabel>Reclaim space</guilabel> to finish.
fr: Après que vous avez récupéré assez d'espace pour installer &PRODUCT;, cliquez sur le bouton <guilabel>Récupérer de l'espace</guilabel> en bas à droite pour terminer.

source: No changes to any disks will be made until you press <guilabel>Begin Installation</guilabel> in <xref linkend="sect-installation-gui-installation-summary" />. The <guilabel>Reclaim Space</guilabel> dialog only <emphasis>marks</emphasis> partitions for resizing or deletion, but no such action is performed immediately.
fr: Aucun changement n'est apporté aux disques tant que vous n'avez pas cliqué sur le bouton <guilabel>Démarrer l'installation</guilabel> comme indiqué dans la <xref linkend="sect-installation-gui-installation-summary" />. Dans la fenêtre de dialogue <guilabel>Récupérer de l'espace disque</guilabel> vous ne faites que <emphasis>marquer</emphasis> les partitions pour redimensionnement ou suppression, mais aucune de ces actions n'est effectuée immédiatement.

source: If you selected the <guilabel>I will configure partitioning</guilabel> option, pressing <guilabel>Done</guilabel> will open the <guilabel>Manual Partitioning</guilabel> screen. See <xref linkend="sect-installation-gui-manual-partitioning" /> for further instructions.
fr: Si vous avez sélectionné l'option <guilabel>Je vais configurer le partitionnement</guilabel>, cliquez sur le bouton <guilabel>Fait</guilabel>. L'écran <guilabel>Partitionnement manuel</guilabel> s'affiche. Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning" /> pour la suite des instructions.
