Repository: jaaf/po_purifier
Catalog: testing_data/StorageSpoke_BootLoader.po
Languages: fr

source: Boot Loader Installation
fr: Installation du chargeur d'amorçage

source: &PRODUCT; uses <application>GRUB2</application> (GRand Unified Bootloader version 2) as its boot loader. The boot loader is the first program that runs when the computer starts and is responsible for loading and transferring control to an operating system. <application>GRUB2</application> can boot any compatible operating system (including Microsoft Windows) and can also use chain loading to transfer control to other boot loaders for unsupported operating systems.
fr: &PRODUCT; utilise le chargeur d'amorçage <application>GRUB2</application> (GRand Unified Bootloader version 2). Le chargeur d'amorçage est le premier programme à être exécuté lorsque l'ordinateur démarre. Son rôle est de charger le système d'exploitation et de lui passer le contrôle. <application>GRUB2</application> peut démarrer n'importe quel système d'exploitation compatible (y compris Microsoft Windows). Dans le cas d'un système d'exploitation non pris en charge, il peut aussi avoir recours au chargement en chaîne en passant le contrôle à un autre chargeur de d'amorçage

source: Installing <application>GRUB2</application> may overwrite your existing boot loader.
fr: L'installation de <application>GRUB2</application> peut écraser votre chargeur d'amorçage existant.

source: If you have other operating systems already installed, the &PRODUCT; installer will attempt to automatically detect and configure the boot loader to start them. You can manually configure any additional operating systems after you finish the installation, if they are not detected properly. For instructions on editing <application>GRUB2</application> configuration, see the <citetitle>&PRODUCT; System&nbsp;Administrator's&nbsp;Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />
fr: Si vous avez déjà d'autres systèmes d'exploitation installés, l'installateur de &PRODUCT; cherche à les détecter et à configurer le chargeur d'amorçage pour qu'il en assure le démarrage. Vous pouvez reconfigurer le chargeur de démarrage après l'installation pour qu'il démarre des systèmes d'exploitation additionnels, s'ils ne sont pas correctement détectés. Pour des instructions sur la manière de modifier la configuration de <application>GRUB2</application> , reportez-vous au <citetitle>Guide de l'administrateur de &PRODUCT; </citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: If you are installing Fedora system with more than one disk, you may want to manually specify where the bootloader should be installed. Click the <guilabel>Full disk summary and bootloader</guilabel> link at the bottom of the <guilabel>Installation Destination</guilabel> screen. The <guilabel>Selected Disks</guilabel> dialog will appear. The bootloader will be installed on the device of your choice, or on a UEFI system, the <systemitem class="resource">EFI system partition</systemitem> will be created on that device during guided partitioning.
fr: Si vous installez un système Fedora à plus d'un disque, vous pouvez avoir besoin de spécifier sur lequel de ces disques le chargeur d'amorçage doit être installé. Cliquez sur le lien <guilabel>Résumé complet du disque et du chargeur de démarrage</guilabel> en bas de l'écran <guilabel>Cible de l'installation</guilabel>. La fenêtre de dialogue <guilabel>Disques sélectionnés</guilabel> s'affiche. Le chargeur de démarrage sera installé sur le périphérique de votre choix, ou, sur un système doté du micrologiciel UEFI, une partition <systemitem class="resource">EFI system</systemitem> sera créée sur ce périphérique lors du partitionnement guidé.

source: Boot Device Selection
fr: Sélection du périphérique de démarrage

source: In the <guilabel>Boot</guilabel> column, a "tick" icon marks one of the devices as the intended boot device. To change the boot device, select a device from the list and click the <guilabel>Set as Boot Device</guilabel> button to install the boot loader there instead. Only one device can be set as the boot device.
fr: Dans la colonne <guilabel>Démarrage</guilabel> , cochez la case à coté du périphérique que vous voulez choisir comme périphérique de démarrage, puis cliquez sur le bouton <guilabel>Définir comme périphérique de démarrage</guilabel> pour changer le périphérique de démarrage actuel. Un seul périphérique peut être déclaré comme périphérique de démarrage.

source: To decline installation of a new boot loader, select the device currently marked for boot and click the <guilabel>Do not install bootloader</guilabel> button. This will remove the tick and ensure <application>GRUB2</application> is not installed on any device.
fr: Pour refuser l'installation d'un nouveau périphérique de démarrage, sélectionnez le périphérique marqué pour le démarrage et cliquez sur le bouton the <guilabel>Supprimer</guilabel>. Cela supprime la coche et fait en sorte que <application>GRUB2</application> ne soit installé sur aucun des périphériques.

source: If you choose not to install a boot loader for any reason, you will not be able to boot the system directly, and you must use another boot method, such as a stand-alone commercial boot loader application. Use this option only if you are sure you have another way to boot your system.
fr: Si vous choisissez de ne pas installer de chargeur d'amorçage pour quelque raison que ce soit, vous ne pourrez pas démarrer le système directement, et devrez choisir une autre méthode de démarrage, tel qu'un chargeur d'amorçage commercial « stand alone ». N'utilisez cette option qui si vous êtes sûr de disposer d'un autre moyen pour démarrer votre système.

source: The boot loader may also require a special partition to be created, depending on whether your system uses BIOS or UEFI firmware and also depending on whether the boot drive has a <firstterm>GUID Partition Table</firstterm> (GPT) or a <guilabel>Master Boot Record</guilabel> (MBR, also known as msdos) label. If you use automatic partitioning, the installer will create this partition if needed. For details, see <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Le chargeur d'amorçage peut également nécessiter qu'une partition spéciale soit créée, selon que votre système utilise le micrologiciel BIOS ou le micrologiciel UEFI, mais aussi que votre disque de démarrage est étiqueté comme ayant une <firstterm>table des partitions GUID</firstterm> (GPT) ou une table des partitions <guilabel>Master Boot Record</guilabel> (MBR aussi connue sous le nom de msdos). Si vous utilisez le partitionnement automatique, l'installateur crée cette partition si nécessaire. Pour les détails, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
