Repository: jaaf/po_purifier
Catalog: testing_data/SummaryHub.po
Languages: fr

source: Installation Summary
fr: Résumé de l'installation

source: The <guilabel>Installation Summary</guilabel> screen is the central location for setting up an installation. Most of the options which can be configured during the installation can be accessed from here.
fr: L'écran <guilabel>Résumé de l'installation</guilabel> est l'emplacement central sur lequel configurer une installation. La plupart des options qui peuvent être configurées pendant l'installation sont accessibles ici.

source: If you used a Kickstart option or a boot option to specify an installation repository on a network, but no network is available at the start of the installation, the installer will display the <guilabel>Network Configuration</guilabel> screen for you to set up a network connection prior to displaying the <guilabel>Installation Summary</guilabel> screen.
fr: Si vous avez utilisé une option Kickstart ou une option de démarrage pour spécifier un dépôt d'installation sur un réseau mais qu'aucun réseau n'est disponible au démarrage de l'installation, l'installateur affiche l'écran <guilabel>Configuration du réseau</guilabel> pour vous permettre de configurer une connexion avant d'afficher l'écran <guilabel>Résumé de l'installation</guilabel>.

source: The summary screen consists of several links to other screens, separated into categories. These links can be in several different states, which are graphically indicated:
fr: L'écran <guilabel>Résumé de l'installation</guilabel> est constitué de plusieurs liens qui pointent sur d'autres écrans classés par catégorie. Ces liens peuvent apparaître dans différents états, qui sont indiqués graphiquement :

source: A <emphasis>warning symbol</emphasis> (yellow triangle with an exclamation mark) next to an icon means that a screen requires your attention before you start the installation. This typically happens with the <guilabel>Installation Destination</guilabel> screen, because even though there is a default automatic partitioning variant, you always have to at least confirm this selection, even if you do not want to make any changes.
fr: Un <emphasis>symbole d'avertissement </emphasis> (triangle jaune avec un point d'exclamation) à côté d'une icône indique que l'écran requiert votre attention avant de démarrer l'installation. Typiquement, il apparaît à côté du lien vers l'écran <guilabel>Cible de l'installation</guilabel>, parce que, même s'il existe une variante de partitionnement par défaut, vous devez toujours au minimum la confirmer, même si vous ne voulez y apporter aucun changement.

source: If a link is <emphasis>greyed out</emphasis>, it means that the installer is currently configuring this section, and you must wait for the configuration to finish before accessing that screen. This typically happens when you change the installation source in the <guilabel>Installation Source</guilabel> screen and the installer is probing the new source location and gathering a list of available packages.
fr: Un lien <emphasis>estompé</emphasis> indique que l'installateur est en train de configurer cet écran et que vous devez attendre qu'il ait terminé avant de pouvoir y accéder. Typiquement cela arrive lorsque vous changez la source d'installation dans l'écran <guilabel>Source d'installation</guilabel> et que l'installateur est en train de sonder le nouvel emplacement de la source et de rassembler la liste des paquets disponibles.

source: Screens with <emphasis>black text and no warning symbol</emphasis> mean that this screen does not require your attention. You can still change your settings in these screens, but it is not necessary to do so to complete the installation. This typically happens with localization settings, as these are either detected automatically, or set up on the previous screen where you select your language and locale.
fr: Les liens vers des écrans en <emphasis>texte noir et sans symbole d'avertissement</emphasis> indiquent que ces écrans ne requièrent pas d'attention particulière. Vous pouvez cependant toujours changer les réglages dans ces écrans, mais cela n'est pas indispensable pour démarrer l'installation. Typiquement, cela arrive avec les écrans de réglage des paramètres de localisation car ces derniers sont, soit détectés automatiquement, soit définis dans l'écran précédent où vous avez sélectionné votre langue et votre locale.

source: A warning message is displayed at the bottom of the summary screen, and the <guilabel>Begin Installation</guilabel> button is greyed out, as long as at least one item has not been configured yet.
fr: Un message d'avertissement est affiché en bas de l'écran <guilabel>Résumé de l'installation</guilabel> et le bouton <guilabel>Commencer l'installation</guilabel> est estompé tant qu'aucun item n'a encore été configuré.

source: Icon States in Installation Summary
fr: État des icônes dans le résumé de l'installation

source: Each screen also has an explanatory text below its title, showing settings currently configured in that screen. This text may be concatenated; in that case, move your mouse cursor over it and wait until a tooltip with the full text appears.
fr: Chacun des écrans est aussi doté d'un texte explicatif en dessous de son titre, montrant les réglages déjà faits dans cet écran. Le texte peut être concaténé ; dans ce cas, déplacer le pointeur de votre souris au-dessus de lui et attendez l'apparition d'une info-bulle montrant l'intégralité du texte.

source: Tooltip in the Installation Summary
fr: Info-bulle dans le résumé de l'installation

source: Once you configure everything required for the installation, you can press the <guilabel>Begin Installation</guilabel> button to start installing &PRODUCT;. This will take you to <xref linkend="sect-installation-gui-installation-progress" />. Note that as the text below this button says, nothing will be written to your hard drive before you press this button. You can press <guilabel>Quit</guilabel> at any point; this will discard all changes you made in the installer so far and reboot the system.
fr: Une fois que vous avez configuré tout ce qui est nécessaire à l'installation, vous pouvez cliquer sur le bouton <guilabel>Commencer l'installation</guilabel> pour commencer à installer &PRODUCT;. Cela vous conduit à l'écran de la <xref linkend="sect-installation-gui-installation-progress" />. Notez que, comme l'indique le texte placé sous ce bouton, rien ne sera écrit sur vos disques tant que vous n'aurez pas cliqué sur ce bouton. Vous pouvez cliquer sur le bouton <guilabel>Quitter</guilabel> à tout moment ; cela rejette tous les réglages opérés à ce stade et redémarre le système.
