Repository: jaaf/po_purifier
Catalog: testing_data/Troubleshooting.po
Languages: fr

source: If you made sure you have a connected and properly configured storage device and the message still appears after you reboot the system and start the installation again, it means that the installation program failed to detect the storage. In most cases this message appears when you attempt to install on an SCSI device which has not been recognized by the installation program.
fr: Si vous êtes certain que vous avez connecté et correctement configuré le périphérique de stockage et que le message s'affiche toujours après redémarrage du système et de l'installation, cela signifie que l'installateur ne parvient pas à détecter ce périphérique. Dans la plupart des cas, ce message s'affiche lorsque vous essayez d'installer sur un périphérique iSCSI que n'est pas reconnu par l'installateur.

source: Problems After Installation
fr: Problèmes après l'installation

source: Resetting the Root Password
fr: Réinitialisation du mot de passe « root »

source: If you lost the root password to the system and you have access to the boot loader, you can reset the password by editing the GRUB2 configuration.
fr: Si vous avez perdu votre mot de passe « root » pour accéder au système et que vous avez accès au chargeur de démarrage, vous pouvez réinitialiser le mot de passe en éditant la configuration de GRUB2.

source: Boot your system and wait until the GRUB2 menu appears.
fr: Démarrez votre système et attendez de voir le menu de GRUB2.

source: In the boot loader menu, highlight any entry and press <keycap>e</keycap> to edit it.
fr: Dans le menu du chargeur de démarrage, sélectionnez une entrée quelconque et pressez la touche <keycap>e</keycap> pour éditer cette entrée.

source: Find the line beginning with <literal>linux</literal>. At the end of this line, append the following:
fr: Trouvez la ligne qui commence par <literal>linux</literal>. À la fin de cette ligne, ajoutez ce qui suit :

source: Press <keycap>F10</keycap> or <keycombo><keycap>Ctrl</keycap><keycap>X</keycap></keycombo> to boot the system using the options you just edited.
fr: Pressez la touche <keycap>F10</keycap> ou la combinaison de touches <keycombo><keycap>Ctrl</keycap><keycap>X</keycap></keycombo> pour démarrer le système avec les options que vous venez d'éditer.

source: Once the system boots, you will be presented with a shell prompt without having to enter any user name or password:
fr: Une fois que le système a démarré, l'invite de commande du shell s'affiche sans que vous ayez eu à saisir un mot de passe :

source: Load the installed SELinux policy:
fr: Chargez la politique SELinux installée :

source: Execute the following command to remount your root partition:
fr: Exécutez la commande suivante pour remonter votre partition racine :

source: Reset the root password:
fr: Réinitialisez votre mot de passe « root » :

source: When prompted to, enter your new root password and confirm by pressing the <keycap>Enter</keycap> key. Enter the password for the second time to make sure you typed it correctly and confirm with <keycap>Enter</keycap> again. If both passwords match, a message informing you of a successful root password change will appear.
fr: Lorsque vous y êtes invité, entrez votre nouveau mot de passe « root » et confirmez en pressant la touche <keycap>Entrée</keycap> key. Entrez à nouveau le mot de passe pour être certain de l'avoir saisi correctement et confirmez en pressant à nouveau la touche <keycap>Entrée</keycap>. Si les deux mots de passe correspondent, un message de réussite s'affiche.

source: Remount the root partition again, this time as read-only:
fr: Remontez la partition racine mais cette fois en lecture seule :

source: Reboot the system. From now on, you will be able to log in as the root user using the new password set up during this procedure.
fr: Redémarrez le système. À partir de cet instant, vous êtes en mesure de vous connecter en tant qu'utilisateur « root » en utilisant le nouveau mot de passe défini par la procédure que vous venez de suivre.

source: Are You Unable to Boot With Your RAID Card?
fr: Vous ne parvenez pas à démarrer avec un RAID matériel ?

source: If you have performed an installation and cannot boot your system properly, you may need to reinstall and partition your system's storage differently.
fr: Si vous avez réalisé une installation et que vous ne pouvez démarrer le système correctement, vous devez peut-être réinstaller et partitionner votre espace de stockage différemment.

source: Some BIOS types do not support booting from RAID cards. After you finish the installation and reboot the system for the first time, a text-based screen showing the boot loader prompt (for example, <prompt>grub&gt;</prompt>) and a flashing cursor may be all that appears. If this is the case, you must repartition your system and move your <filename>/boot</filename> partition and the boot loader outside the RAID array. The <filename>/boot</filename> partition and the boot loader must be on the same drive.
fr: Certains types de BIOS ne prennent pas en charge le démarrage sur des cartes RAID. Après que vous avez terminé l'installation et redémarré pour la première fois, vous pouvez tomber seulement sur un écran texte montrant l'invite de commande du chargeur de démarrage (par exemple, <prompt>grub&gt;</prompt>) et un curseur clignotant. Dans ce cas, vous devez refaire le partitionnement de votre système et déplacer votre partition <filename>/boot</filename> et le chargeur de démarrage en dehors de regroupement RAID. La partition <filename>/boot</filename> et le chargeur de démarrage doivent se trouver sur le même disque.

source: Once these changes have been made, you should be able to finish your installation and boot the system properly. For more information about partitioning, see <xref linkend="sect-installation-gui-storage-partitioning" />.
fr: Une fois ces changements apportés, vous devriez être en mesure de finir votre installation et de démarrer le système correctement. Pour plus d'information sur le partitionnement, voir la <xref linkend="sect-installation-gui-storage-partitioning" />.

source: Trouble With the Graphical Boot Sequence
fr: Problèmes avec la séquence de démarrage graphique

source: After you finish the installation and reboot your system for the first time, it is possible that the system stops responding during the graphical boot sequence, requiring a reset. In this case, the boot loader is displayed successfully, but selecting any entry and attempting to boot the system results in a halt. This usually means a problem with the graphical boot sequence; to solve this issue, you must disable graphical boot. To do this, temporarily alter the setting at boot time before changing it permanently.
fr: Après que vous avez terminé l'installation et redémarré le système pour la première fois, il se peut que les système s'arrête de répondre lors de la séquence graphique de démarrage et demande une réinitialisation. Dans ce cas, le chargeur de démarrage est affiché correctement, mais après la sélection d'une entrée, la tentative de démarrage n'aboutit pas : le système est bloqué. Cela signifie généralement qu'il y a un problème avec la séquence de démarrage graphique. Pour résoudre ce problème, vous devez désactiver le démarrage graphique. Pour le faire temporairement, modifiez les réglages au démarrage avant de le faire de manière durable.

source: Disabling Graphical Boot Temporarily
fr: Désactivation temporaire du démarrage graphique

source: Start your computer and wait until the boot loader menu appears. If you set your boot loader timeout period to 0, hold down the <keycap>Esc</keycap> key to access it.
fr: Démarrez votre ordinateur et attendez l'affichage du menu du chargeur de démarrage. Si vous avez réglé le temps d'attente à 0, maintenez préalablement la touche <keycap>Esc</keycap> enfoncée pour y accéder.

source: When the boot loader menu appears, use your cursor keys to highlight the entry you want to boot and press the <keycap>e</keycap> key to edit this entry's options.
fr: Dans le menu du chargeur de démarrage, utilisez les touches de direction pour sélectionner l'entrée sur laquelle vous voulez démarrer et pressez la touche <keycap>e</keycap> pour en éditer les options.

source: In the list of options, find the kernel line - that is, the line beginning with the keyword <literal>linux</literal> (or, in some cases, <literal>linux16</literal> or <literal>linuxefi</literal>). On this line, locate the <literal>rhgb</literal> option and delete it. The option may not be immediately visible; use the cursor keys to scroll up and down.
fr: Dans la liste des options, trouvez la ligne du noyau (kernel) – il s'agit de la ligne qui commence par <literal>linux</literal> (ou, dans certains cas, <literal>linux16</literal> ou <literal>linuxefi</literal>). Sur cette ligne, localisez l'option <literal>rhgb</literal> et effacez-la. L'option peut ne pas être immédiatement visible ; utilisez les touches de direction pour balayer la liste vers le haut et vers le bas.

source: Press <keycap>F10</keycap> or <keycombo><keycap>Ctrl</keycap><keycap>X</keycap></keycombo> to boot your system with the edited options.
fr: Pressez la touche <keycap>F10</keycap> ou la combinaison de touches <keycombo><keycap>Ctrl</keycap><keycap>X</keycap></keycombo> pour démarrer votre système avec les options fraîchement éditées.

source: If the system started successfully, you can log in normally. Then you will need to disable the graphical boot permanently - otherwise you will have to perform the previous procedure every time the system boots. To permanently change boot options, do the following.
fr: Si le système démarre correctement, vous pouvez vous connecter normalement. Ensuite, vous devez désactiver le démarrage graphique durablement – autrement vous devrez refaire la procédure que nous venons de décrire à chaque redémarrage. Pour changer durablement les options de démarrage, faites ce qui est indiqué ci-après :

source: Disabling Graphical Boot Permanently
fr: Désactivation permanente du démarrage graphique

source: Log in to the <systemitem>root</systemitem> account using the <command>su -</command> command:
fr: Connectez-vous au compte <systemitem>root</systemitem> en utilisant la commande <command>su -</command> :

source: Open the <filename>/etc/default/grub</filename> configuration file using a plain text editor such as <application>vim</application>.
fr: Ouvrez le fichier de configuration <filename>/etc/default/grub</filename> avec un éditeur de texte tel que <application>vim</application>.

source: Within the <filename>grub</filename> file, locate the line beginning with <literal>GRUB_CMDLINE_LINUX</literal>. The line should look similar to the following:
fr: Dans le fichier <filename>grub</filename>, localisez la ligne qui commence par <literal>GRUB_CMDLINE_LINUX</literal>. Elle doit ressembler à ceci :

source: On this line, delete the <literal>rhgb</literal> option.
fr: Sur cette ligne, supprimez l'option <literal>rhgb</literal>.

source: Save the edited configuration file.
fr: Sauvegardez le fichier de configuration édité.

source: Refresh the boot loader configuration by executing the following command:
fr: Rafraichissez la configuration du chargeur de démarrage avec la commande suivante :

source: After you finish this procedure, you can reboot your computer. &PRODUCT; will not use the graphical boot sequence any more. If you wish to enable graphical boot, follow the same procedure, add the <literal>rhgb</literal> option to the <literal>GRUB_CMDLINE_LINUX</literal> line in the <filename>/etc/default/grub</filename> file and refresh the boot loader configuration again using the <command>grub2-mkconfig</command> command.
fr: Après avoir terminé cette procédure, vous pouvez redémarrer. &PRODUCT; n'utilisera plus le démarrage graphique. Si vous voulez rétablir le démarrage graphique, suivez la même procédure, mais cette fois, ajoutez l'option <literal>rhgb</literal> – au lieu de la retirer – à la ligne <literal>GRUB_CMDLINE_LINUX</literal> dans le fichier <filename>/etc/default/grub</filename> et rafraichissez la configuration du chargeur de démarrage avec la commande <command>grub2-mkconfig</command>.

source: See the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />, for more information about working with the <application>GRUB2</application> boot loader.
fr: Reportez vous au <citetitle>Guide de l'administrateur système de &PRODUCT;</citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />, pour plus d'informations sur la manière d'utiliser le chargeur de démarrage <application>GRUB2</application>.

source: Booting into a Graphical Environment
fr: Démarrage dans un environnement graphique

source: If you have installed the <application>X Window System</application> and a desktop environment such as <application>GNOME</application>, but are not seeing a graphical desktop environment once you log into your system, you can start it manually using the <command>startx</command> command. Note, however, that this is just a one-time fix and does not change the log in process for future log ins.
fr: Si vous avez installé le système <application>X Window</application> et un environnement de bureau tel que <application>GNOME</application> mais que vous ne vous trouvez pas dans un environnement de bureau graphique après démarrage, vous pouvez le lancer avec la commande <command>startx</command>. Notez néanmoins qu'il s'agit là d'une solution « une seule fois » et que cela ne change pas le processus de connexion pour les démarrages suivants.

source: To set up your system so that you can log in at a graphical login screen, you must change the default <application>systemd</application> target to <literal>graphical.target</literal>. When you are finished, reboot the computer. You will presented with a graphical login prompt after the system restarts.
fr: Pour configurer votre système de manière à vous connecter dans un écran graphique, vous devez changer la cible <application>systemd</application> par défaut en <literal>graphical.target</literal>. Lorsque vous avez terminé, redémarrez votre ordinateur. Un écran de connexion graphique devrait se présenter à vous.

source: Setting Graphical Login as Default
fr: Définir la connexion graphique comme connexion par défaut

source: Open a shell prompt. If you are in your user account, become root by typing the <command>su -</command> command.
fr: Ouvrez un terminal. Si vous êtes dans votre compte utilisateur normal, devenez super utilisateur avec la commande <command>su -</command>.

source: Change the default target to <systemitem>graphical.target</systemitem>. To do this, execute the following command:
fr: Changez la cible par défaut en <systemitem>graphical.target</systemitem>. Pour cela, exécutez la commande suivante :

source: Graphical login is now enabled by default - you will be presented with a graphical login prompt after the next reboot. If you want to reverse this change and keep using the text-based login prompt, execute the following command as <systemitem>root</systemitem>:
fr: La connexion graphique est désormais la connexion par défaut – dès le prochain redémarrage, un écran de connexion graphique vous sera présenté. Si vous voulez revenir à la connexion textuelle, exécutez la commande suivante en tant que super utilisateur <systemitem>root</systemitem> :

source: For more information about targets in <application>systemd</application>, see the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Pour de l'information sur les cibles de <application>systemd</application>, reportez-vous au <citetitle>Guide de l'administrateur système de &PRODUCT; </citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: No Graphical User Interface Present
fr: Pas trouvé d'interface utilisateur graphique

source: If you are having trouble getting <application>X</application> (the <application>X Window System</application>) to start, it is possible that it has not been installed. Some of the pre-set base environments you can select during the installation, such as <guilabel>Minimal install</guilabel> or <guilabel>Web Server</guilabel>, do not include a graphical interface - it has to be installed manually.
fr: Si vous rencontrez un problème avec le démarrage de <application>X</application> (le système <application>X Window</application>), il se peut qu'il ne soit pas installé. Certains environnements pré-définis, que vous pouvez choisir lors de l'installation comme <guilabel>Installation minimale</guilabel> ou <guilabel>Serveur Web</guilabel>, ne comprennent aucune interface graphique – elle doit être installée à la main.

source: If you want <application>X</application>, you can install the necessary packages after the installation using the <application>DNF</application> package manager. For example, to install <application>GNOME</application>, use <command>dnf install gnome-shell</command> as <systemitem class="username">root</systemitem>.
fr: Si vous désirez utiliser <application>X</application>, vous pouvez en installer les paquets nécessaires après l'installation avec le gestionnaire de paquets <application>DNF</application>. Par exemple, pour installer <application>GNOME</application>, utilisez <command>dnf install gnome-shell</command> en tant que super utilisateur <systemitem class="username">root</systemitem>.

source: X Server Crashing After User Logs In
fr: Plantage du serveur X après la connexion de l'utilisateur

source: If you are having trouble with the <application>X</application> server crashing when a user logs in, one or more of your file systems may be full (or nearly full). To verify that this is the problem you are experiencing, execute the following command:
fr: Si votre serveur <application>X</application> se plante après la connexion d'un utilisateur, il se peut qu'un ou plusieurs de vous systèmes de fichiers soient pleins (ou presque pleins). Pour savoir si votre problème vient de là, exécutez la commande suivante :

source: The output will help you diagnose which partition is full - in most cases, the problem will be on the <filename>/home</filename> partition. A sample output of the <command>df</command> command may look similar to the following:
fr: La sortie de la commande devrait vous aider à déterminer quelle partition est pleine – dans la plupart des cas, le problème concerne la partition <filename>/home</filename>. Un exemple de sortie de la commande <command>df</command> est fourni ci-après :

source: In the above example, you can see that the <filename>/home</filename> partition is full, which causes the crash. You can make some room on the partition by removing unneeded files. After you free up some disk space, start <application>X</application> using the <command>startx</command> command.
fr: Dans l'exemple ci-dessus, vous pouvez voir que la partition <filename>/home</filename> est pleine, ce qui occasionne le plantage. Vous pouvez faire un peu de place sur la partition en retirant les fichiers inutiles. Après avoir libéré de l'espace disque, démarrez <application>X</application> avec le commande <command>startx</command>.

source: For additional information about <command>df</command> and an explanation of the options available (such as the <option>-h</option> option used in this example), see the <systemitem>df(1)</systemitem> man page.
fr: Pour plus d'informations sur la commande <command>df</command> et une explication de ses options (comme l'option <option>-h</option> utilisée dans cet exemple), reportez-vous à la page de manuel <systemitem>df(1)</systemitem>.

source: Is Your RAM Not Being Recognized?
fr: Non reconnaissance partielle de la RAM

source: In some cases the kernel does not recognize all of your memory (RAM), which causes the system to use less memory than is installed. You can find out how much RAM is being utilized using the <command>free -m</command> command. If the displayed total amount of memory does not match your expectations, it is likely that at least one of your memory modules is faulty. On BIOS-based systems, you can use the <application>Memtest86+</application> utility to test your system's memory - see <xref linkend="sect-boot-options-memtest" /> for details.
fr: Dans certains cas, le noyau ne reconnait pas toute votre mémoire vive (RAM) ce qui conduit le système à n'utiliser qu'une partie de la mémoire installée. Vous pouvez savoir quelle quantité de mémoire vive est utilisée avec la commande <command>free -m</command>. Si la quantité affichée ne correspond pas à ce que vous espériez, il est probable que l'un de vos modules de mémoire soit défaillant. Sur les systèmes dotés d'un micrologiciel BIOS, vous pouvez utiliser l'utilitaire <application>Memtest86+</application> pour tester la mémoire de votre système – voir la <xref linkend="sect-boot-options-memtest" /> pour les détails.

source: If you have 4GB or more memory installed, but &PRODUCT; only shows around 3.5GB or 3.7GB, you have probably installed a 32-bit version of &PRODUCT; on a 64bit kernel. For modern systems, use the 64-bit (x86_64) version.
fr: Si vous disposez de 4 Go ou plus de mémoire installée et que &PRODUCT; n'en montre que 3,5 à 3,7 Go, vous avez probablement installé une version 32 bits de &PRODUCT; sur un noyau 64 bits. Pour un système récent, utilisez la version 64 bits (x86_64).

source: Some hardware configurations have a part of the system's RAM reserved and unavailable to the main system. Notably, laptop computers with integrated graphics cards will reserve some memory for the GPU. For example, a laptop with 4&nbsp;GB of RAM and an integrated Intel graphics card will show only roughly 3.7&nbsp;GB of available memory, even with a 64-bit system.
fr: Certaines configurations matérielles réservent une partie de la RAM du système qui devient indisponible au système principal. En particulier, les ordinateurs portables avec une carte graphique intégrée réservent un peu de mémoire pour le GPU (processeur graphique). Par exemple, un ordinateur portable avec 4 Go de RAM et une carte graphique Intel intégrée ne montre qu'environ 3,7 Mo de mémoire disponible, même sur un système 64 bits.

source: Additionally, the <application>kdump</application> crash kernel dumping mechanism reserves some memory for the secondary kernel used in case of the primary kernel crashing. This reserved memory will also not be displayed as available when using the <command>free</command> command. For details about <application>kdump</application> and its memory requirements, see the <citetitle>&PRODUCT; System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: En outre, le mécanisme <application>kdump</application> de sauvegarde partielle de la mémoire en cas de plantage du noyau réserve un peu de mémoire pour le noyau secondaire utilisé en cas de plantage du noyau primaire. Cette mémoire réservée n'est pas affichée comme disponible par la commande <command>free</command>. Pour des détails sur <application>kdump</application> et ses exigences en quantité de mémoire, reportez-vous au <citetitle>Guide de l'administrateur système de &PRODUCT; </citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: If you made sure that your memory does not have any issues, you can try and set the amount of memory manually using the <option>mem=</option> kernel option.
fr: Si vous êtes convaincu(e) que votre mémoire ne présente aucun problème, vous pouvez essayer de définir la quantité de mémoire à la main avec l'option du noyau <option>mem=</option>

source: Configuring the Memory Manually
fr: Configuration manuelle de la mémoire
