Repository: jaaf/po_purifier
Catalog: testing_data/Troubleshooting.po
Languages: fr

source: In the list of options, find the kernel line - that is, the line beginning with the keyword <literal>linux</literal> (or, in some cases, <literal>linux16</literal>). Append the following option to the end of this line:
fr: Dans la liste des options, trouvez la ligne du noyau – la ligne qui commence par <literal>linux</literal> (ou, dans certains cas, par <literal>linux16</literal>). Ajoutez l'option suivante à la fin de cette ligne :

source: Replace <replaceable>xx</replaceable> with the amount of RAM you have in megabytes.
fr: Remplacez <replaceable>xx</replaceable> par la quantité de RAM en mégaoctets dont dispose le système.

source: Wait for the system to boot and log in. Then, open a command line and execute the <command>free -m</command> command again. If total amount of RAM displayed by the command matches your expectations, append the following to the line beginning with <literal>GRUB_CMDLINE_LINUX</literal> in the <filename>/etc/default/grub</filename> file to make the change permanent:
fr: Attendez que le système redémarre et connectez-vous. Ensuite, ouvrez une ligne de commande et exécutez la commande <command>free -m</command> à nouveau. Si la quantité totale de RAM affichée correspond à vos attentes, ajoutez ce qui suit à la ligne qui commence par <literal>GRUB_CMDLINE_LINUX</literal> dans le fichier <filename>/etc/default/grub</filename> pour rendre le changement durable.

source: After you updated the file and saved it, refresh the boot loader configuration so that the change will take effect. Run the following command with root privileges:
fr: Après avoir mis à jour le fichier et l'avoir sauvegardé, rafraichissez la configuration du chargeur de démarrage pour que la modification devienne effective. Exécutez la commande suivante en tant que super utilisateur :

source: In <filename>/etc/default/grub</filename>, the above example would look similar to the following:
fr: Dans le fichier <filename>/etc/default/grub</filename>, l'exemple précédent devrait ressembler à ce qui suit :
