Repository: jaaf/po_purifier
Catalog: testing_data/Troubleshooting.po
Languages: fr

source: Troubleshooting
fr: Résolution des probèmes

source: This chapter offers some pointers on how to get help when something goes wrong. It also discusses some common installation problems and their solutions.
fr: Ce chapitre vous indique où chercher pour obtenir de l'aide lorsque quelque chose ne fonctionne pas. Il aborde aussi quelques problèmes courant d'installation et leur solution.

source: Getting Help
fr: Obtenir de l'aide

source: There are many places on the internet which can help you when you encounter a problem not described in this chapter: discussion boards, blogs, IRC, and more. Some of the more popular places where you can find help include:
fr: Il y a de nombreuse places sur l'Internet qui peuvent vous aider lorsque vous rencontrez un problème qui n'est pas abordé dans ce chapitre : forums de discussion, blogs, IRC et plus. Parmi les places les plus populaires pour trouver de l'aide on trouve :

source: <ulink url="https://ask.fedoraproject.org/en/questions/">Ask Fedora</ulink> - Fedora's knowledge base, available in multiple languages
fr: <ulink url="https://ask.fedoraproject.org/en/questions/">Ask Fedora</ulink> – La base de connaissance de Fedora, disponible en plusieurs langues.

source: The #fedora IRC channel on <ulink url="http://freenode.net/">FreeNode</ulink> - one of the main IRC channels used by Fedora users, English only
fr: Le canal IRC #fedora à <ulink url="http://freenode.net/">FreeNode</ulink> – l'un des canaux principaux utilisés par les utilisateurs de Fedora, en anglais uniquement.

source: <ulink url="https://fedoraproject.org/wiki/">Fedora Project Wiki</ulink> - the official wiki for Fedora Project
fr: <ulink url="https://fedoraproject.org/wiki/">Fedora Project Wiki</ulink> – le wiki officiel du projet Fedora

source: <ulink url="http://unix.stackexchange.com/">Stack Exchange</ulink> - an English language Q&amp;A board, not specific to Fedora
fr: <ulink url="http://unix.stackexchange.com/">Stack Exchange</ulink> - un forum de questions réponses en anglais, pas spécifique à Fedora

source: The above list is by no means complete - you can find help in many other places as well. Additional information about available resources such as IRC channels and mailing lists is available at <ulink url="https://fedoraproject.org/wiki/Communicating_and_getting_help" />.
fr: La liste ci-dessus n'est en aucune manière exhaustive – vous pouvez trouver de l'aide dans une multitude d'autres places. Une information complémentaire sur les ressources disponibles comme les canaux IRC et les listes de diffusion est disponible à <ulink url="https://fedoraproject.org/wiki/Communicating_and_getting_help" />.

source: Before you open a new discussion or ask anyone for help on IRC, you should always do some research on your own. If you are encountering an issue, there is usually a good chance that someone else ran into the same problem before you and published a solution somewhere. Opening a discussion about something already explained elsewhere, or asking a common question which has been answered many times before, is not likely to result in a friendly, constructive response.
fr: Avant d'ouvrir une nouvelle discussion ou demander de l'aide sur IRC, vous devez toujours effectuer votre propre recherche. Si vous rencontrez un problème, il est fort probable que quelqu'un d'autre ait rencontré le même problème avant vous et qu'il ait publié une solution quelque part. Ouvrir une discussion sur quelque chose déjà expliqué ailleurs, ou poser une question courante à laquelle il a été répondu de nombreuses fois, ne vous conduira pas à une réponse très amicale et constructive.

source: When you ask for help troubleshooting problems related to the installation, you may be asked to provide log files generated by the installer. The sections below explain which files are generated, what their contents are, and how to transfer them from the installation system.
fr: Quand vous demandez de l'aide pour résoudre un problème relatif à l'installation, on peut vous demander de fournir les journaux générés par l'installateur. Cette section explique quels fichiers sont générés, ce qu'ils contiennent et comment les transférer depuis le système d'installation.

source: Log Files Generated During the Installation
fr: Journaux générés lors de l'installation

source: For debugging purposes, <application>Anaconda</application> logs installation actions into files in the <filename>/tmp</filename> directory. These files are listed in the following table.
fr: Pour des besoins de débogage, <application>Anaconda</application> copie les sorties des commandes d'installation dans des fichiers du dossier <filename>/tmp</filename>. Ces fichiers sont listés dans le tableau suivant.

source: Log Files and Their Contents
fr: Les journaux et leur contenu

source: Log file
fr: Journal

source: Contents
fr: Contenu

source: general <application>Anaconda</application> messages
fr: messages généraux d'<application>Anaconda</application>

source: all external programs run during the installation
fr: tous les programmes externes exécutés durant l'installation

source: extensive storage module information
fr: informations des modules de stockage étendus

source: <application>dnf</application> and <application>rpm</application> package installation messages
fr: message relatifs à l'installation des paquets par <application>dnf</application> et <application>rpm</application>

source: hardware-related system messages
fr: messages système relatifs au matériel

source: If the installation fails, the messages from these files are consolidated into <filename>/tmp/anaconda-tb-<replaceable>identifier</replaceable></filename>, where <replaceable>identifier</replaceable> is a random string.
fr: Si l'installation échoue, les messages écrits dans ces fichiers sont rassemblés dans <filename>/tmp/anaconda-tb-<replaceable>identifiant</replaceable></filename>, où <replaceable>identifiant</replaceable> représente une chaîne aléatoire.

source: Transferring Log Files from the Installation System
fr: Transfert des journaux depuis le système d'installation

source: All of the files described in <xref linkend="sect-troubleshooting-log-files" /> reside in the installation program's RAM disk, which means they are not saved permamently and will be lost once the system is powered down. To store them permanently, copy those files to another system on the network using <command>scp</command> on the system running the installation program, or copy them to a mounted storage device (such as an USB flash drive). Details on how to transfer the log files are below. Note that if you use an USB flash drive or other removable media, you should make sure to back up any data on it before starting the procedure.
fr: Tous les fichiers décrits dans la <xref linkend="sect-troubleshooting-log-files" /> résident dans le disque virtuel de l'installateur, ce qui signifie qu'ils sont sur un média évanescent et qu'ils sont perdus si le système est mis hors énergie. Pour les sauvegarder de manière permanente, copiez-les sur un autre système sur le réseau à l'aide de la commande <command>scp</command> depuis le système d'installation, ou copiez-les sur un périphérique de stockage préalablement monté (comme un disque flash USB). Le détail sur les modalités de ce transfert sont donnés ci-après. Notez que si vous utilisez un disque flash USB, ou tout autre média amovible, vous devriez vous assurer que vous avez sauvegardé toutes les données précieuses qu'il contient avant de commencer.

source: Transferring Log Files Onto a USB Drive
fr: Transfert des journaux sur un disque USB

source: On the system you are installing, press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F2</keycap></keycombo> to access a shell prompt. You will be logged into a root account and you will have access to the installation program's temporary file system.
fr: Sur le système d'installation, pressez les touches <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F2</keycap></keycombo> pour obtenir un invite de commande de shell. Vous serez connecté à un compte « root » et vous aurez accès au système de fichiers temporaire de l'installateur.

source: Connect a USB flash drive to the system and execute the <command>dmesg</command> command. A log detailing all recent events will be displayed. At the bottom of this log, you will see a set of messages caused by the USB flash drive you just connected. It will look like a set of lines similar to the following:
fr: Connectez un disque flash USB au système et exécutez la commande <command>dmesg</command>. Un journal reprenant tous les événements récents est affiché. En bas de ce journal, vous devez voir un jeu de messages consécutifs à la connexion de votre disque USB. Ces messages doivent ressembler à ceci :

source: Note the name of the connected device - in the above example, it is <literal>sdb</literal>.
fr: Notez le nom du périphérique connecté – dans l'exemple ci-dessus, il s'agit de <literal>sdb</literal>.

source: Go to the <filename>/mnt</filename> directory and once there, create new directory which will serve as the mount target for the USB drive. The name of the directory does not matter; this example uses the name <literal>usb</literal>.
fr: Naviguez jusqu'au dossier <filename>/mnt</filename>. Une fois là, créez un nouveau dossier qui servira de point de montage à votre disque USB. Le nom de ce dossier importe peu ; cet exemple utilise le nom <literal>usb</literal>.

source: Mount the USB flash drive onto the newly created directory. Note that in most cases, you do not want to mount the whole drive, but a partition on it. Therefore, do not use the name <literal>sdb</literal> - use the name of the partition you want to write the log files to. In this example, the name <literal>sdb1</literal> is used.
fr: Montez le disque USB sur ce point de montage. Notez que dans la plupart des cas, vous ne montez pas l'ensemble du disque, mais une de ses partitions. Par conséquent, n'utilisez par le nom <literal>sdb</literal> mais le nom de la partition sur laquelle vous voulez copier les journaux. Dans cet exemple le nom utilisé est <literal>sdb1</literal>.

source: You can now verify that you mounted the correct device and partition by accessing it and listing its contents - the list should match what you expect to be on the drive.
fr: Vous pouvez maintenant vérifier que vous avez monté la partition correcte en y accédant et en listant son contenu – cela doit correspondre à ce que vous vous attendez à trouver sur cette partition du disque USB.

source: Copy the log files to the mounted device.
fr: Copiez les journaux sur la partition montée du disque USB.

source: Unmount the USB flash drive. If you get an error message saying that the target is busy, change your working directory to outside the mount (for example, <filename>/</filename>).
fr: Démontez la partition du disque USB. Si vous recevez un message d'erreur disant que le cible est occupée, changez votre dossier de travail vers un dossier en dehors du montage (par exemple, <filename>/</filename>).

source: The log files from the installation are now saved on the USB flash drive.
fr: Les journaux de l'installation sont désormais sauvegardés sur le disque flash USB.

source: Transferring Log Files Over the Network
fr: Transfert des journaux sur le réseau

source: Switch to the <filename class="directory">/tmp</filename> directory where the log files are located:
fr: Naviguez jusqu'au dossier <filename class="directory">/tmp</filename> où se trouvent les journaux :

source: Copy the log files onto another system on the network using the <command>scp</command> command:
fr: Copiez les journaux sur un autre système sur le réseau avec la commande <command>scp</command> :

source: <prompt>#</prompt> <command>scp *log <replaceable>user</replaceable>@<replaceable>address</replaceable>:<replaceable>path</replaceable></command>
fr: <prompt>#</prompt> <command>scp *log <replaceable>utilisateur</replaceable>@<replaceable>adresse</replaceable>:<replaceable>chemin</replaceable></command>

source: Replace <replaceable>user</replaceable> with a valid user name on the target system, <replaceable>address</replaceable> with the target system's address or host name, and <replaceable>path</replaceable> with the path to the directory you wish to save the log files into. For example, if you want to log in as <systemitem class="username">john</systemitem> to a system with an IP address of <systemitem>192.168.0.122</systemitem> and place the log files into the <filename class="directory">/home/john/logs/</filename> directory on that system, the command will have the following form:
fr: Remplacez <replaceable>utilisateur</replaceable> par un nom d'utilisateur valide sur le système cible, <replaceable>adresse</replaceable> par l'adresse du système cible ou son nom d'hôte et <replaceable>chemin</replaceable> par le chemin du dossier dans lequel vous voulez copier les journaux. Par exemple, si vous voulez vous connecter avec le nom <systemitem class="username">john</systemitem> à un système dont l'adresse IP est <systemitem>192.168.0.122</systemitem> et copier les journaux dans le dossier <filename class="directory">/home/john/logs/</filename> sur ce système, la commande doit avoir la forme suivante :

source: When connecting to the target system for the first time, you may encounter a message similar to the following:
fr: Lors de la première connexion au système cible, vous pouvez recevoir un message semblable au message suivant :

source: <computeroutput>The authenticity of host '192.168.0.122 (192.168.0.122)' can't be established.</computeroutput> <computeroutput>ECDSA key fingerprint is a4:60:76:eb:b2:d0:aa:23:af:3d:59:5c:de:bb:c4:42.</computeroutput> <computeroutput>Are you sure you want to continue connecting (yes/no)?</computeroutput>
fr: <computeroutput>The authenticity of host '192.168.0.122 (192.168.0.122)' can't be established. (l'authenticité de l'hôte '192.168.0.122' ne peut être établie)</computeroutput> <computeroutput>ECDSA key fingerprint is a4:60:76:eb:b2:d0:aa:23:af:3d:59:5c:de:bb:c4:42. (l'empreinte SCDSA est a4:60:76:eb:b2:d0:aa:23:af:3d:59:5c:de:bb:c4:42)</computeroutput> <computeroutput>Are you sure you want to continue connecting (yes/no)?(Êtes-vous sûr que vous voulez continuer à vous connecter (oui/non)</computeroutput>

source: Type <literal>yes</literal> and press <keycap>Enter</keycap> to continue. Then, provide a valid password when prompted. The files will start transferring to the specified directory on the target system.
fr: Tapez <literal>yes</literal> (oui) et pressez la touche <keycap>Entrée</keycap> pour continuer. Ensuite, fournissez un mot de passe valide quand on vous y invite. Le transfert des fichiers commence alors vers le dossier spécifié sur la cible.

source: The log files from the installation are now permanently saved on the target system and available for review.
fr: Les journaux de l'installation sont désormais sauvegardés de manière pérenne sur le système cible et disponible pour examen.

source: Trouble Beginning the Installation
fr: Problèmes au démarrage de l'installation

source: Problems with Booting into the Graphical Installation
fr: Problèmes au démarrage de l'installation graphique

source: Systems with some video cards have trouble booting into the graphical installation program. If the installation program does not run using its default settings, it attempts to run in a lower resolution mode. If that still fails, the installation program attempts to run in text mode.
fr: Des systèmes dotés de certaines cartes vidéo ont du mal à démarrer dans l'installateur graphique. Si l'installateur ne fonctionne pas avec ses réglages par défaut, il tente de s'exécuter dans une résolution graphique plus faible. Si cela échoue encore, l'installateur tente de s'exécuter en mode texte.

source: There are several possible solutions to display issues, most of which involve specifying custom boot options. For more information, see <xref linkend="sect-boot-options-installer" />.
fr: Il y a plusieurs solutions possibles aux problèmes d'écran, la plupart desquelles nécessitent des options de démarrage personnalisées. Pour plus d'information, reportez-vous à la <xref linkend="sect-boot-options-installer" />.

source: Use the basic graphics mode
fr: Utilisation du mode graphique de base

source: You can attempt to perform the installation using the basic graphics driver. To do this, edit the installation program's boot options and append <option>inst.xdriver=vesa</option> at the end of the command line.
fr: Vous pouvez essayer d'effectuer l'installation en utilisant le pilote graphique de base. Pour cela, éditez les options de démarrage de l'installateur et ajoutez <option>inst.xdriver=vesa</option> à la fin de la ligne de commande.

source: Specify the display resolution manually
fr: Spécification manuelle de la résolution d'écran

source: If the installation program fails to detect your screen resolution, you can override the automatic detection and specify it manually. To do this, append the <option>inst.resolution=<replaceable>x</replaceable></option> option at the boot menu, where <replaceable>x</replaceable> is your display's resolution (for example, <literal>1024x768</literal>).
fr: Si l'installateur ne parvient pas à détecter votre résolution d'écran, vous pouvez outrepasser la détection automatique et la spécifier à la main. Pour cela, ajoutez l'option <option>inst.resolution=<replaceable>x</replaceable></option> depuis le menu de démarrage, où <replaceable>x</replaceable> est votre résolution d'écran (par exemple, <literal>1024x768</literal>).

source: Use an alternate video driver
fr: Utilisation d'un pilote vidéo alternatif

source: You can also attempt to specify a custom video driver, overriding the installation program's automatic detection. To specify a driver, use the <option>inst.xdriver=<replaceable>x</replaceable></option> option, where <replaceable>x</replaceable> is the device driver you want to use (for example, <literal>nouveau</literal>).
fr: Vous pouvez également essayer de spécifier un pilote vidéo personnalisé, en outrepassant la détection automatique de l'installateur. Pour cela, utilisez l'option <option>inst.xdriver=<replaceable>x</replaceable></option>, où <replaceable>x</replaceable> est le pilote de périphérique que vous voulez utiliser (par exemple, <literal>nouveau</literal>).

source: If specifying a custom video driver solves your problem, you should report it as a bug at <ulink url="https://bugzilla.redhat.com" /> under the <literal>anaconda</literal> component. <application>Anaconda</application> should be able to detect your hardware automatically and use the appropriate driver without your intervention.
fr: Si la spécification d'un pilote vidéo personnalisé résout votre problème, vous devriez rapporter un bug à <ulink url="https://bugzilla.redhat.com" /> sous le composant <literal>anaconda</literal>. <application>Anaconda</application> devrait être capable de détecter votre matériel automatiquement et d'utiliser le pilote approprié sans votre intervention.

source: Perform the installation using VNC
fr: Réalisation d'une installation utilisant VNC

source: If the above options fail, you can use a separate system to access the graphical installation over the network, using the <firstterm>Virtual Network Computing</firstterm> (VNC) protocol. For details on installing using VNC, see <xref linkend="chap-vnc-installations" />.
fr: Si les options présentées ci-dessus échouent, vous pouvez utiliser un système séparé pour accéder à l'installation graphique par le réseau, en utilisant le protocole <firstterm>Virtual Network Computing</firstterm> (VNC) (Informatique virtuelle en réseau). Pour des détails sur la manière d'installer et d'utiliser VNC, reportez-vous au <xref linkend="chap-vnc-installations" />.

source: Serial Console Not Detected
fr: Pas de détection de la console série

source: In some cases, attempting to install in text mode using a serial console will result in no output on the console. This happens on systems which have a graphics card, but no monitor connected. If <application>Anaconda</application> detects a graphics card, it will attempt to use it for a display, even if no display is connected.
fr: Dans certains cas, en essayant d'installer en mode texte à partir d'une console série on n'obtient aucune sortie sur cette console. Cela arrive sur les systèmes qui disposent d'une carte graphique mais qui n'ont pas de moniteur branché. Si <application>Anaconda</application> détecte une carte graphique, il tente de l'utiliser pour l'affichage même si le moniteur n'est pas branché.

source: If you want to perform a text-based installation on a serial console, use the <option>inst.text</option> and <option>console=</option> boot options. See <xref linkend="chap-anaconda-boot-options" /> for more details.
fr: Si vous voulez effectuer un installation en mode texte à partir d'une console, utilisez les options de démarrage <option>inst.text</option> et <option>console=</option>. Voir le <xref linkend="chap-anaconda-boot-options" /> pour plus de détails.

source: Trouble During the Installation
fr: Problèmes lors de l'installation

source: No Disks Detected
fr: Aucun disque détecté

source: In the <guilabel>Installation Destination</guilabel> screen, the following error message may appear at the bottom: <guilabel>No disks detected. Please shut down the computer, connect at least one disk, and restart to complete installation</guilabel>.
fr: Il arrive que le message <guilabel>Aucun disque détecté. Veuillez éteindre votre ordinateur, connecter au moins un disque, puis redémarrer pour terminer l'installation.</guilabel>, soit affiché en bas de l'écran <guilabel>Cible de l'installation</guilabel>.

source: The message indicates that <application>Anaconda</application> did not find any writable storage devices to install to. In that case, first make sure that your system does have at least one storage device attached.
fr: Ce message indique qu' <application>Anaconda</application> n'a pas trouvé de périphérique de stockage inscriptible sur lequel réaliser l'installation. Dans ce cas, assurez-vous que votre système a au moins un disque connecté.

source: If your system uses a hardware RAID controller, verify that the controller is properly configured and working. See your controller's documentation for instructions.
fr: Si vous utilisez un contrôleur RAID matériel, vérifiez que le contrôleur est correctement configuré et fonctionnel. Reportez-vous à la documentation de votre contrôleur pour les instructions.

source: If you are installing into one or more iSCSI devices and there is no local storage present on the system, make sure that all required LUNs (<firstterm>Logical Unit Numbers</firstterm>) are being presented to the appropriate HBA (<firstterm>Host Bus Adapter</firstterm>).
fr: Si vous installez sur un ou plusieurs périphériques iSCSI et qu'aucun périphérique de stockage local n'existe sur le système, assurez-vous que tous les LUNS (<firstterm>Logical Unit Numbers</firstterm> – Numéros d'unité logique) sont présentés au HBA ( (<firstterm>Host Bus Adapter</firstterm> – Adaptateur de bus hôte) approprié.
