Repository: jaaf/po_purifier
Catalog: */CustomSpoke_FileSystems.po
Languages: fr

source: Device, File System and RAID Types
fr: Périphériques, systèmes de fichiers et types RAID

source: &PRODUCT; supports multiple types of devices and file systems. The lists below offer a short description of each available device, file system and RAID type and notes on their usage.
fr: &PRODUCT; prend en charge de multiples types de périphérique et de système de fichiers. La liste ci-dessous fournit une courte description de chacun des types de périphérique , de système de fichiers et de RAID disponibles, ainsi que des notes sur leur emploi.

source: To select a device type or a file system of a partition or a logical volume, select it in the list in <xref linkend="sect-installation-gui-manual-partitioning" /> and select a <guilabel>Device Type</guilabel> and a <guilabel>File System</guilabel> from their respective drop-down menus on the right side of the screen. Then, click <guilabel>Update Settings</guilabel> and repeat this process for all mount points you want to modify.
fr: Pour attribuer un type de périphérique et un système de fichiers à une partition ou à un volume logique, sélectionnez le dans la liste comme expliqué à la <xref linkend="sect-installation-gui-manual-partitioning" />. Puis, sélectionnez un <guilabel>type de périphérique</guilabel> et un <guilabel>système de fichiers</guilabel> en utilisant les listes déroulantes correspondantes sur la partie droite de l'écran. Ensuite, cliquez sur le bouton <guilabel>Mise à jour des paramètres</guilabel> et répétez ce processus pour tous les points de montage que vous voulez modifier.

source: To configure software RAID, make sure that you have enough physical hard drives selected as installation targets (the number of separate drives required for each type of RAID is noted in its description). Then, choose a RAID level when creating or modifying a Btrfs volume or LVM volume group, or select <guilabel>Software RAID</guilabel> as the device type to create software RAID with standard partitions. For detailed instructions, see <xref linkend="sect-installation-gui-manual-partitioning-btrfs" />, <xref linkend="sect-installation-gui-manual-partitioning-lvm" />, and <xref linkend="sect-installation-gui-manual-partitioning-swraid" /> as needed.
fr: Pour configurer un RAID logiciel, assurez-vous que vous disposez de suffisamment de disques durs sélectionnés en tant que cible de l'installation (le nombre de disques séparés nécessaire pour chacun des types RAID est noté dans sa description). Ensuite, choisissez un niveau de RAID lors de la création ou de la modification d'un volume Btrfs ou d'un groupe de volumes LVM, ou sélectionnez <guilabel>RAID logiciel</guilabel> en tant que type de périphérique pour créer un RAID logiciel avec des partitions standard. Pour des instructions détaillées, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-btrfs" />, la <xref linkend="sect-installation-gui-manual-partitioning-lvm" /> et la <xref linkend="sect-installation-gui-manual-partitioning-swraid" /> selon le besoin.

source: Device Types
fr: Types de périphérique

source: <guilabel>Standard Partition</guilabel> - A standard partition can contain a file system or swap space. Standard partitions are most commonly used for <filename class="directory">/boot</filename> and the BIOS Boot and EFI System partitions. LVM logical volumes or Btrfs subvolumes are recommended for most other uses. See <xref linkend="appe-disk-partitions-overview" /> for additional information about the concepts behind physical partitions.
fr: <guilabel>Partition standard</guilabel> – une partition standard peut contenir un système de fichiers ou un espace d'échange (swap). Les partitions standard sont les plus couramment utilisées pour la partition – ou le dossier – <filename class="directory">/boot</filename> et pour les partitions BIOS Boot et EFI System. Les volumes logiques LVM, ou les sous-volumes Btrfs, sont recommandés pour la plupart des autres usages. Reportez-vous à l' <xref linkend="appe-disk-partitions-overview" /> pour une information complémentaire sur la théorie des partitions physiques.

source: <guilabel>LVM</guilabel> - Choosing <guilabel>LVM</guilabel> as the <guilabel>Device Type</guilabel> creates an LVM logical volume and a volume group to contain it (unless one already exists, in which case the new volume is assigned to the existing group). LVM can improve performance when using physical disks and allows you to use multiple disks for a single mount point. For information on how to create a logical volume, see <xref linkend="sect-installation-gui-manual-partitioning-lvm" />. Also see <xref linkend="appe-lvm-overview" /> for some additional information about LVM in general.
fr: <guilabel>LVM</guilabel> – choisir <guilabel>LVM</guilabel> en tant que <guilabel>type de périphérique</guilabel> crée un volume logique LVM et un groupe de volumes pour le contenir (sauf si un groupe de volumes existe déjà, auquel cas il est assigné à ce groupe existant). LVM peut améliorer la performance quand il utilise des disques physiques et permet d'utiliser plusieurs disques pour un seul point de montage. Pour de l'information sur la manière de créer un volume logique, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-lvm" />. Voyez aussi l'<xref linkend="appe-lvm-overview" /> pour des informations complémentaires à propos de LVM en général.

source: <guilabel>LVM Thin Provisioning</guilabel> - Using thin provisioning, you can manage a storage pool of free space, known as a <firstterm>thin pool</firstterm>, which can be allocated to an arbitrary number of devices when needed by applications. The thin pool can be expanded dynamically when needed for cost-effective allocation of storage space.
fr: <guilabel>Allocation fine LVM</guilabel> – en utilisant l'allocation fine vous pouvez gérer un pool d'espace de stockage libre, connu sous le nom de <firstterm>thin pool</firstterm>, qui peut être alloué à un nombre quelconque de périphériques lorsque les applications le requièrent. Le « thin pool » peut être étendu dynamiquement en fonction des besoins pour une allocation efficace d'espace de stockage.

source: <guilabel>RAID</guilabel> - Creating two or more software RAID partitions allows you to create a software RAID device. One RAID partition is assigned to each disk on the system. See <xref linkend="sect-installation-gui-manual-partitioning-swraid" /> for instructions on creating software RAID.
fr: <guilabel>RAID</guilabel> – créer deux, ou plus, partitions RAID logiciel permet de créer un périphérique RAID logiciel. Une partition RAID est assignée à chacun des disques sur le système. Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-swraid" /> pour des instructions sur la manière de créer des partitions RAID logiciel.

source: <guilabel>BTRFS</guilabel> - Btrfs is a file system with several device-like features. It is capable of addressing and managing more files, larger files, and larger volumes than the ext2, ext3, and ext4 file systems. See <xref linkend="sect-installation-gui-manual-partitioning-btrfs" /> for more information about creating Btrfs volumes.
fr: <guilabel>Btrsf</guilabel> – Btrsf est un système de fichiers qui présente plusieurs des fonctionnalités d'un disque. Il est capable d'adresser et de gérer des fichiers plus nombreux et plus grands ainsi que des volumes plus grands que les systèmes de fichiers ext2, ext3 ou ext4. Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-btrfs" /> pour plus d'information sur la manière de créer des volumes Btrfs.

source: File Systems
fr: Systèmes de fichiers

source: <guilabel>ext4</guilabel> - The ext4 file system is based on the ext3 file system and features a number of improvements. These include support for larger file systems and larger files, faster and more efficient allocation of disk space, no limit on the number of subdirectories within a directory, faster file system checking, and more robust journaling. Ext4 is the default and recommended file system used by &PRODUCT; Workstation and Cloud. The maximum supported size of a single ext4 file system is 50 TB.
fr: <guilabel>ext4</guilabel> – le système de fichiers ext4 est basé sur le système de fichiers ext3 et présente un certain nombre d'améliorations. Cela comprend la prise en charge de systèmes de fichiers et de fichiers plus volumineux, une allocation d'espace disque plus rapide et plus efficiente, l'absence de limitation du nombre de sous-dossiers dans un dossier, une vérification plus rapide du système de fichiers et un système de journalisation plus robuste. Ext4 est le système de fichiers par défaut et il est recommandé pour utiliser &PRODUCT; Workstation et &PRODUCT; Cloud. La taille maximum d'un système de fichiers ext4 est de 50 To.

source: <guilabel>ext3</guilabel> - The ext3 file system is based on the ext2 file system and has one main advantage - journaling. Using a journaling file system reduces time spent recovering a file system after a crash, as there is no need to check the file system for metadata consistency by running the <command>fsck</command> utility every time a crash occurs.
fr: <guilabel>ext3</guilabel> – le système de fichiers ext3 est basé sur le système de fichiers ext2 et présente un avantage principal – la journalisation. L'utilisation d'un système de fichiers avec journalisation réduit le temps de récupération du système de fichiers après un plantage car il n'est pas nécessaire de vérifier la cohérence des méta-données en utilisant l'utilitaire <command>fsck</command> à chaque fois qu'un plantage se produit.

source: <guilabel>ext2</guilabel> - An ext2 file system supports standard Unix file types, including regular files, directories, or symbolic links. It provides the ability to assign long file names, up to 255 characters.
fr: <guilabel>ext2</guilabel> – un système de fichiers ext2 prend en charge les types de fichiers standard d'Unix, y compris les fichiers réguliers, les dossiers ou les liens symboliques. Il fournit la possibilité d'assigner aux fichiers des noms d'une longueur atteignant 255 caractères.

source: <guilabel>swap</guilabel> - Swap partitions are used to support virtual memory. In other words, data is written to a swap partition when there is not enough RAM to store the data your system is processing. A swap partition should always be created; see <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> for details such as the recommended size.
fr: <guilabel>swap</guilabel> – les partitions swap (partitions d'échange) sont utilisées pour la prise en charge de la mémoire virtuelle. Dit autrement, les données sont écrites dans une partition d'échange lorsqu'il n'y a plus assez de mémoire RAM pour stocker les données que le système est en train de traiter. Une partition d'échange doit toujours être créée ; reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> pour des détails tels que la taille recommandée.

source: <guilabel>xfs</guilabel> - XFS is a highly scalable, high-performance file system that supports file systems up to 16 exabytes (approximately 16 million terabytes), files up to 8 exabytes (approximately 8 million terabytes), and directory structures containing tens of millions of entries. XFS also supports metadata journaling, which facilitates quicker crash recovery. The maximum supported size of a single XFS file system is 500 TB. Starting with &PRODUCT;&nbsp;22, XFS is the default and recommended file system on &PRODUCT; Server.
fr: <guilabel>xfs</guilabel> – xfs est un système de fichiers de haute adaptabilité à la montée en charge et de haute performance qui peut atteindre une taille de 16 exaoctets (environ 16 millions de téraoctets) et accepte des fichiers de 8 exaoctets (environ 8 millions de téraoctets) ainsi que des structures de dossiers contenant des dizaines de millions d'entrées. xfs prend aussi en charge la journalisation des méta-données, ce qui accélère la récupération après plantage. La taille maximum d'un système de fichiers xfs unitaire est de 500 To. Depuis &PRODUCT; 22, xfs est le système de fichiers par défaut et est recommandé pour les sytèmes &PRODUCT; Server.

source: Note that the size of an XFS file system can not currently be reduced without destroying and recreating the file system. If you expect that you will need to adjust the sizes of your file systems often, using XFS is not recommended, as it makes administration substantially more time-consuming.
fr: Notez que la taille d'un système de fichiers xfs ne peut être réduite sans avoir à le supprimer et à le recréer. Si vous pensez devoir adapter souvent la taille de votre système de fichiers, il n'est pas recommandé d'utiliser xfs, car il rendrait l'administration plus consommatrice de temps.

source: <guilabel>vfat</guilabel> - The VFAT file system is a Linux file system that is compatible with Microsoft Windows long file names on the FAT file system.
fr: <guilabel>vfat</guilabel> – le système de fichiers vfat est un système de fichiers Linux compatible avec les noms de fichier longs de Microsoft Windows sur les système de fichiers FAT.

source: <guilabel>BIOS Boot</guilabel> - A very small partition required for booting from a device with a GUID partition table (GPT) on BIOS systems and UEFI systems in BIOS compatibility mode. See <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> for details.
fr: <guilabel>Bios Boot</guilabel> – une toute petite partition nécessaire au démarrage depuis un périphérique doté d'une table des partitions GUID (GPT) sur les systèmes BIOS et les systèmes UEFI en mode compatible BIOS. Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> pour les détails.

source: <guilabel>EFI System Partition</guilabel> - A small partition required for booting a device with a GUID partition table (GPT) on a UEFI system. See <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> for details.
fr: <guilabel>EFI System</guilabel> – une petite partition pour démarrer depuis un périphérique doté d'une table des partitions GUID (GPT) sur les systèmes UEFI. Reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> pour les détails.

source: Software RAID Types
fr: Types de RAID logiciel

source: <guilabel>RAID0 (Performance)</guilabel> - Distributes data across multiple disks. Level 0 RAID offers increased performance over standard partitions and can be used to pool the storage of multiple disks into one large virtual device. Note that Level 0 RAIDs offer no redundancy and that the failure of one device in the array destroys data in the entire array. RAID 0 requires at least two disks.
fr: <guilabel>RAID0 (performace)</guilabel> – distribue les données sur plusieurs disques. Le niveau 0 de RAID permet une performance accrue par rapport aux partitions standard et peut être utilisé pour mettre en pool l'espace de stockage de plusieurs disques en un grand périphérique virtuel. Notez que le niveau 0 de RAID ne met pas en œuvre la redondance et que la panne d'un disque du regroupement aboutit à la perte des données dans le regroupement tout entier. RAID0 requiert au minimum deux disques.

source: <guilabel>RAID1 (Redundancy)</guilabel> - Mirrors all data from one partition onto one or more other disks. Additional devices in the array provide increasing levels of redundancy. RAID 1 requires at least two disks.
fr: <guilabel>RAID1 (redondance)</guilabel> – duplique toutes les données d'une partition sur un (ou plus) autre(s) disque(s). Les périphériques additionnels dans le regroupement améliorent le niveau de redondance. RAID 1 requiert au moins deux disques.

source: <guilabel>RAID4 (Error Checking)</guilabel> - Distributes data across multiple disks and uses one disk in the array to store parity information which safeguards the array in case any disk within the array fails. Because all parity information is stored on one disk, access to this disk creates a "bottleneck" in the array's performance. Level 4 RAID requires at least three disks.
fr: <guilabel>RAID4 (test d'erreur)</guilabel> – distribue les données sur plusieurs disques et utilise un disque du regroupement pour stocker les informations de parité qui permettent la sauvegarde du regroupement dans le cas de panne d'un disque du regroupement. Comme toutes les informations de parité sont stockées sur un seul disque, cela crée un goulot d'étranglement dans la performance du regroupement. Le niveau 4 de RAID requiert au moins trois disques.

source: <guilabel>RAID5 (Distributed Error Checking)</guilabel> - Distributes data and parity information across multiple disks. Level 5 RAIDs therefore offer the performance advantages of distributing data across multiple disks, but do not share the performance bottleneck of level 4 RAIDs because the parity information is also distributed through the array. RAID 5 requires at least three disks.
fr: <guilabel>RAID5 (test d'erreur distribué)</guilabel> – distribue les données et les informations de parité sur plusieurs disques. Le niveau 5 de RAID présente les avantages de performance de la distribution des données sur plusieurs disques mais ne présente pas le goulot d'étranglement du niveau 4 parce que les informations de parité sont également distribuées sur l'ensemble du regroupement. RAID5 requiert au moins trois disques.

source: <guilabel>RAID6 (Redundant Error Checking)</guilabel> - Level 6 RAIDs are similar to level 5 RAIDs, but instead of storing only one set of parity data, they store two sets. RAID 6 requires at least four disks.
fr: <guilabel>RAID6 (redondance et test d'erreur)</guilabel> – le niveau 6 de RAID est similaire au niveau 5 mais, au lieu de stocker un seul jeu de données de parité, il en stocke deux. RAID6 requiert au moins quatre disques.

source: <guilabel>RAID10 (Performance, Redundancy)</guilabel> - Level 10 RAIDs are nested RAIDs or hybrid RAIDs. They are constructed by distributing data over mirrored sets of disks. For example, a level 10 RAID array constructed from four RAID partitions consists of two mirrored pairs of striped partitions. RAID 10 requires at least four disks.
fr: <guilabel>RAID10 (performance, redondance)</guilabel> – les RAIDs de niveau 10 sont des RAIDs gigognes ou hybrides. Ils sont construits en distribuant les données sur des jeux dupliqués de disques. Par exemple, un RAID de niveau 10, construit à partir de quatre partitions RAID, consiste en deux paires dupliquées de partitions en bandes. RAID10 requiert au moins quatre disques.
