Repository: jaaf/po_purifier
Catalog: */CustomSpoke.po
Languages: fr

source: Manual Partitioning
fr: Partitionnement manuel

source: The <guilabel>Manual Partitioning</guilabel> screen allows you to create a storage configuration for your &PRODUCT; system manually, giving you a greater control over your system's storage.
fr: L'écran <guilabel>Partitionnement manuel</guilabel> vous permet de créer une configuration de stockage pour votre sytème &PRODUCT; à la main, vous donnant ainsi un contrôle plus précis sur cette configuration.

source: In most other installers for both Linux and other operating systems, disk partitioning usually takes a "bottom-up" approach. In these installers, you first create underlying devices such as LVM physical volumes, then you create a layout such as LVM on top of them, then you create file systems on top of logical volumes, and the last step is usually assigning a mount point to each volume as needed.
fr: Dans la plupart des autres installateurs, que ce soit pour Linux ou pour d'autres systèmes d'exploitation, le partitionnement des disques suit une approche « du bas vers le haut ». Dans ces installateurs, vous devez d'abord créer des périphériques sous-jacents tels que des volumes physiques LVM. Ensuite, vous créez sur ceux-ci un partitionnement tel que LVM, puis des systèmes de fichiers sur ces volumes logiques. La dernière étape consiste en général à assigner un point de montage à chacun des volumes en fonction du besoin.

source: <application>Anaconda</application> uses an opposite approach. First, you create all separate mount points you need, and everything needed to create them (creating a volume group, logical volumes inside it, and physical volumes where the volume group will reside) is performed automatically. You can then adjust the automatic settings as you require.
fr: <application>Anaconda</application> adopte une approche opposée. Vous commencez par créer les points de montage dont vous avez besoin, et tout ce qui est nécessaire à leur création (la création d'un groupe de volumes, d'un volume logique à l'intérieur, et de volumes physique où loger le groupe de volumes) est créé automatiquement. Vous pouvez ensuite ajuster les réglages automatiques comme vous le voulez.

source: No permanent changes will be made to your disks during the actual partitioning process. The configuration you have selected will only be written to your system after you press the <guilabel>Begin installation</guilabel> button in <xref linkend="sect-installation-gui-installation-summary" />.
fr: Aucun changement définitif n'est fait sur vos disques durant le processus de configuration du partitionnement. La configuration que vous avez établie n'est écrite sur les disques qu'après que vous avez pressé le bouton <guilabel>Commencer l'installation</guilabel> de l'écran décrit à la <xref linkend="sect-installation-gui-installation-summary" />.

source: When you first open the <guilabel>Manual Partitioning</guilabel> screen, the column on the left side will display all previously existing partitions on all drives which you selected as installation targers in <xref linkend="sect-installation-gui-storage-partitioning" />. If none of the selected drives contain any existing partitions, then a message informing you that no mount points currently exist will appear.
fr: Lorsque vous ouvrez l'écran <guilabel>Partitionnement manuel</guilabel> pour la première fois, le colonne de gauche affiche toutes les partitions pré-existantes de tous les disques que vous avez choisis comme cible de l'installation dans l'écran décrit à la <xref linkend="sect-installation-gui-storage-partitioning" />. Si aucun des disques sélectionnés ne contient de partition, un messages vous informant de l'absence de point de montage s'affiche.

source: Here, you can choose a partitioning scheme such as <guilabel>LVM</guilabel> or <guilabel>BTRFS</guilabel> and click the <guilabel>Click here to create them automatically</guilabel> to prompt the installer to create a basic partitioning layout; this layout follows the guidelines described in <xref linkend="sect-installation-gui-manual-partitioning-recommended" />. The created layout is a basic layout where partition/volume sizes are determined automatically based on the total amount of available space.
fr: À ce stade, vous pouvez choisir un schéma de partitionnement tel que <guilabel>LVM</guilabel> ou <guilabel>Btrfs</guilabel> et cliquer sur le bouton <guilabel>Cliquez ici pour les créer automatiquement</guilabel> pour inviter l'installateur à créer le partitionnement de base ; ce partitionnement est conforme aux directives données à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />. Le partitionnement créé est un partitionnement de base dans lequel la taille des partitions/volumes est déterminée automatiquement en fonction de l'espace total disponible.

source: Click the <guilabel>+</guilabel> button to add a mount point. In the dialog window that opens, choose a mount point such as <filename class="directory">/</filename> or <filename class="directory">/home</filename>, and the desired capacity for the mount point (such as <literal>10GB</literal> or <literal>500MB</literal>). Note that specifying the mount point is mandatory, but you do not have to specify the capacity at this point; this is useful when adding a mount point which you want to make larger than the current available space permits. Then, click <guilabel>Add mount point</guilabel> to add it to the list using the default settings, which means it will be created as a logical volume, and a new volume group will be created for it unless one already exists.
fr: Cliquez sur le bouton <guilabel>+</guilabel> pour ajouter un point de montage. Dans la fenêtre de dialogue qui s'ouvre, choisissez un point de montage tel que <filename class="directory">/</filename> ou <filename class="directory">/home</filename>, ainsi que la capacité souhaitée pour ce point de montage (p. ex. <literal>10 Go</literal> ou <literal>500 Mo</literal>). Notez que, à ce stade, la spécification du point de montage est obligatoire, mais pas la capacité ; cela est utile lorsque vous ajoutez une point de montage auquel vous voulez donner une capacité supérieure à celle autorisée par l'espace libre courant. Ensuite cliquez sur le bouton <guilabel>Ajouter un point de montage</guilabel> pour l'ajouter à la liste avec les réglages par défaut, c'est à dire qu'il est créé en tant que volume logique et qu'un groupe de volumes est créé pour lui sauf s'il en existe déjà un.

source: Then, select the newly created mount point in the list on the left side. A set of controls will display on the right side of the screen, allowing you to change its mount point, the device on which it will physically reside, its capacity, file system, etc. When you change any settings, press <guilabel>Update Settings</guilabel> on the bottom right. This will save the adjusted configuration; you can now create another mount point, or select a different existing one and adjust its settings as well.
fr: Ensuite, sélectionnez dans la liste de gauche le point de montage que vous venez de créer. Un ensemble de contrôles s'affichent sur la partie droite de l'écran, vous permettant de changer son point de montage, le périphérique qui y est monté, sa capacité, son système de fichiers, etc. Une fois vos réglages modifiés, cliquez sur le bouton <guilabel>Mise à jour des paramètres</guilabel> en bas à droite. Cela sauvegarde votre configuration modifiée. Vous pouvez maintenant créer un autre point de montage ou en sélectionner un autre pour le peaufiner lui aussi.

source: For a description of available device and file system types, see <xref linkend="sect-installation-gui-manual-partitioning-filesystems" />.
fr: Pour une description des périphériques disponibles et des types de système de fichiers, voir la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" />.

source: To remove a mount point, select it in the list and press the <guilabel>-</guilabel> button below.
fr: Pour supprimer un point de montage, sélectionnez-le dans la liste et cliquez sur le bouton <guilabel>-</guilabel>, plus bas.

source: The exact steps for configuring your storage depend on your specific needs and your system configuration. Procedures for creating specific layouts are described further in this chapter. Before you start, you should also review <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> and <xref linkend="sect-installation-gui-manual-partitioning-advice" /> for a list of requirements and tips for partitioning your disks for &PRODUCT;.
fr: Les étapes exactes pour configurer votre stockage dépendent de vos besoins propres et de la configuration de votre système. Les procédures pour créer des partitionnements spécifiques sont décrites plus loin dans ce chapitre, Avant de démarrer, vous devriez aussi passer en revue la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> et la <xref linkend="sect-installation-gui-manual-partitioning-advice" /> pour connaître la liste des exigences et des astuces relatives au partitionnement de vos disques pour &PRODUCT;.

source: Below the list of existing mount points are two fields, showing you how much free space is left on your storage devices and how much total space they have.
fr: Sous la liste des points de montage, vous apercevez deux champs qui vous indiquent la quantité d'espace libre qu'il y a sur vos disques et la quantité totale d'espace dont ils disposent.

source: Click the <guilabel><replaceable>X</replaceable> storage devices selected</guilabel> to view a summary of currently selected storage devices; this may help you with orientation in more complicated storage schemas. Devices displayed here are the ones you have selected in <xref linkend="sect-installation-gui-storage-partitioning" />. If you want to add or remove any storage devices from your configuration, return to that screen and change your selection.
fr: Cliquez sur le lien <guilabel><replaceable>X</replaceable> périphérique(s) de stockage sélectionné(s)</guilabel> (où > <replaceable>X</replaceable> est le nombre de disques sélectionnés) pour afficher un résumé des périphériques actuellement sélectionnés ; cela peut vous aider à vous orienter dans des schémas plus complexes. Les périphériques affichés ici, sont ceux que vous avez sélectionnés dans l'écran décrit à la <xref linkend="sect-installation-gui-storage-partitioning" />. Si vous voulez en ajouter ou en retirer à votre configuration, vous devez retourner à cet écran et modifier votre sélection.

source: You can press the <guilabel>Reset All</guilabel> button in the bottom right corner at any time to reset the storage configuration to the state it was in when you last opened the <guilabel>Manual Partitioning</guilabel> screen. This means that if you modify the storage configuration, leave the screen, and then come back, the Reset button will reset the configuration back to the already modified state, discarding only the changes you have made recently, not all changes to the storage configuration since you booted the installer.
fr: À tout moment, vous pouvez cliquer sur le bouton <guilabel>Tout réinitialiser</guilabel> en bas à droite pour rétablir la configuration du stockage dans l'état où elle se trouvait lors de votre dernière ouverture de l'écran <guilabel>Partitionnement manuel</guilabel>. Cela signifie que, si vous modifiez la configuration du stockage, quittez l'écran et y revenez, le bouton <guilabel>Tout réinitialiser</guilabel> rétablit la configuration à un état déjà modifié, n'ignorant que les changements apportés récemment, mais pas tous les changements fait depuis le début de l'installation.

source: To discard all changes, and to also detect any new drives which have not been detected when the installer started (usually when you attached a new drive after you started), press the button marked by a circular arrow in the set of controls below the list of mount points on the left side of the screen. In the dialog window that opens, press <guilabel>Rescan Disks</guilabel> and wait until the scanning process completes. Then, press <guilabel>OK</guilabel> to return to <xref linkend="sect-installation-gui-storage-partitioning" />; all detected disks including any new ones will be displayed in the <guilabel>Local Standard Disks</guilabel> section.
fr: Pour abandonner toutes les modifications, et aussi détecter les nouveaux disques qui n'ont pas été détectés lorsque l'installateur a démarré (ordinairement lorsque vous avez connecté un nouveau disque après le démarrage), cliquez sur le bouton marqué par une flèche circulaire dans le jeu de contrôles placé sous la liste des points de montage sur la partie gauche de l'écran. Dans la fenêtre de dialogue qui s'ouvre, cliquez sur le bouton <guilabel>Réanalyser les disques</guilabel> et attendez la fin du processus d'analyse. Ensuite, cliquez sur le bouton <guilabel>OK</guilabel> pour retourner à l'écran décrit dans la <xref linkend="sect-installation-gui-storage-partitioning" /> ; tous les disques détectés, y compris les nouveaux, sont affichés dans la section <guilabel>Disques locaux standards</guilabel>.

source: Rescan Disks
fr: Réanalyse des disques

source: After you finish configuring your system storage, press <guilabel>Done</guilabel> in the top left corner to save the configuration and return to the <guilabel>Installation Summary</guilabel> screen. At this point, the installer will check if your storage configuration is valid. If an error was detected, a message will be displayed at the bottom of the screen. Click the message to open a dialog window explaining what kind of error has been detected (for example, you put <filename class="directory">/boot</filename> on a Btrfs subvolume, or you did not create a BIOS Boot partition when your system requires one).
fr: Après avoir terminé la configuration de votre système de stockage, cliquez sur le bouton <guilabel>Fait</guilabel> en haut à gauche pour retourner dans l'écran <guilabel>Résumé de l'installation</guilabel>. À ce stade, l'installateur vérifie sur votre configuration est valide. Si une erreur est détectée, un message est affiché en bas de l'écran. Cliquez sur le message pour ouvrir une fenêtre de dialogue qui vous explique la nature de l'erreur faite (par exemple, vous avez placé le dossier <filename class="directory">/boot</filename> sur un volume Btrfs, ou vous n'avez pas créé une partition BIOS Boot alors que votre système en exige une).

source: If such a message is displayed, go back and fix any issues found by the installer; otherwise you will not be able to proceed with the installation. You can also press <guilabel>Done</guilabel> again to return to the <guilabel>Installation Summary</guilabel> anyway, but a storage configuration error will prevent you from starting the actual installation process.
fr: Si un tel message est affiché, revenez en arrière et réglez tous les problèmes signalés par l'installateur ; autrement vous ne pourrez pas commencer l'installation. Vous pouvez aussi cliquer à nouveau sur le bouton <guilabel>Fait</guilabel> pour retourner à l'écran <guilabel>Résumé de l'installation</guilabel> de toute manière, mais une erreur de configuration du stockage vous empêchera de démarrer le processus réel d'installation.

source: If no error message is displayed and if you made any changes since the last time you have visited this screen, a summary dialog will appear, displaying a detailed list of the changes you made. Review the list and click <guilabel>Accept Changes</guilabel> to proceed with <xref linkend="sect-installation-gui-installation-summary" />, or click <guilabel>Cancel &amp; Return to Custom Partitioning</guilabel> if you want to make any more changes.
fr: Si aucun message d'erreur n'est affiché, et si vous avez effectué des changements depuis votre dernière visite de cet écran, une fenêtre de dialogue s'affiche avec un résumé des changements apportés. Passez cette liste en revue et cliquez sur le bouton <guilabel>Accepter les modifications</guilabel> pour passer à l'écran décrit dans la <xref linkend="sect-installation-gui-installation-summary" />, ou cliquez sur le bouton <guilabel>Annuler et retourner au partitionnement personnalisé</guilabel> si vous désirez apporter d'autres modifications.
