Repository: jaaf/po_purifier
Catalog: */CustomSpoke_AddPhysical.po
Languages: fr

source: Creating Standard Partitions
fr: Création de partitions standard

source: <firstterm>Standard partitions</firstterm> are the most common type of partition, with the widest support across operating systems. For example, Microsoft Windows uses exclusively physical partitions and can not natively work with LVM or Btrfs. Most &PRODUCT; partitioning setups will also require at least one standard partition for the <filename class="directory">/boot</filename> directory, and possibly also another standard partition with the BIOS Boot or EFI System file system to store the boot loader.
fr: La <firstterm>partition standard</firstterm> est le type le plus courant de partition, avec la prise en charge la plus large par les systèmes d'exploitation. Par exemple, Microsoft Windows n'utilise que des partitions physiques et ne peut, nativement, travailler avec LVM ou Btrfs. La plupart des configurations de partitionnement de &PRODUCT; nécessitent au moins une partition standard pour le dossier <filename class="directory">/boot</filename> qui contiendra le chargeur de démarrage, et probablement une autre partition standard sur laquelle réside un système de fichiers BIOS Boot ou EFI System.

source: See <xref linkend="appe-disk-partitions-overview" /> for additional information about the concepts behind physical partitions.
fr: Reportez-vous à l'<xref linkend="appe-disk-partitions-overview" /> pour des informations complémentaires sur la théorie des partitions physiques.

source: Create Standard Partition
fr: Création d'une partition standard

source: Follow the procedure below to create mount points on standard physical partitions:
fr: Suivez la procédure ci-dessous pour créer des points de montage sur des partitions standard :

source: Click the <guilabel>+</guilabel> button at the bottom of the list showing existing mount points. A new dialog window will open.
fr: Cliquez sur le bouton <guilabel>+</guilabel> en bas de la liste des points de montage. Une nouvelle fenêtre de dialogue s'ouvre.

source: In the new dialog window, specify a mount point for which you want to create a separate mount point - for example, <filename class="directory">/</filename>. Optionally, specify a size for the partition using standard units such as MB or GB (for example, <literal>50GB</literal>). Then, click <guilabel>Add mount point</guilabel> to add the mount point and return to the main partitioning screen.
fr: Dans cette fenêtre de dialogue, spécifiez un point de montage que vous voulez créer – par exemple, <filename class="directory">/</filename>. En option, vous pouvez spécifier une taille pour la nouvelle partition en utilisant les unités standard telles que Mo ou Go (par exemple, <literal>50 Go</literal>). Cliquez ensuite sur le bouton <guilabel>Ajouter un point de montage</guilabel> pour ajouter le point de montage et retourner à l'écran de partitionnement principal.

source: When creating a swap partition, specify the mount point as <literal>swap</literal>. For a BIOS Boot partition, use <literal>biosboot</literal>. For an EFI System Partition, use <literal>/boot/efi</literal>.
fr: Lors de la création d'un point de montage pour la partition d'échange, spécifiez le point de montage en tant que <literal>swap</literal>. Pour une partition BIOS Boot, utilisez <literal>biosboot</literal>. Pour une partition EFI System, utilisez <literal>/boot/efi</literal>

source: For information about these partition types, see <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.
fr: Pour de l'information sur ces types de partition, reportez-vous à la <xref linkend="sect-installation-gui-manual-partitioning-recommended" />.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume. Select the newly created mount point in the left pane to configure it further, and convert it to a physical partition by changing the <guilabel>Device Type</guilabel> option to <guilabel>Standard Partition</guilabel>. Then, click <guilabel>Update Settings</guilabel> in the bottom right corner of the screen.
fr: Le point de montage a maintenant été créé en utilisant les réglages par défaut, ce qui signifie qu'il a été créé comme un volume logique LVM. Sélectionnez-le dans le panneau de gauche pour le configurer plus en détail et convertissez-le en partition physique en changeant l'option <guilabel>Type de périphérique</guilabel> en <guilabel>partition standard</guilabel>. Ensuite, cliquez sur le bouton <guilabel>Mise à jour des paramètres</guilabel> dans l'angle inférieur droit de l'écran.

source: In the <guilabel>Device(s)</guilabel> section on the right side of the screen, you can see that the partition has been assigned to one or more hard drives. Click the <guilabel>Modify</guilabel> button to configure on which drive this partition will be created.
fr: Dans la section <guilabel>Périphérique(s)</guilabel> à droite de l'écran, vous pouvez constater que plusieurs disques ont été assignés à la partition. Cliquez sur le bouton <guilabel>Modifier</guilabel> pour configurer quels disques seront utilisés pour cette partition.

source: In the <guilabel>Configure Mount Point</guilabel> dialog, you can specify which physical devices (disks) this volume <emphasis>may</emphasis> reside on. You can select one or more disks which will be used to hold this volume by holding down <keycap>Ctrl</keycap> and clicking each disk in the list. If you select multiple disks here, <application>Anaconda</application> will determine where exactly the partition should be created based on how you configured the rest of the installation. If you want to make sure that this partition is placed on a specific hard drive, select only that drive and unselect all others.
fr: Dans la fenêtre de dialogue <guilabel>Configurer le point de montage</guilabel>, vous pouvez spécifier sur quels disques physiques cette partition <emphasis>peut</emphasis> résider. Vous pouvez sélectionner un ou plusieurs disques à utiliser en maintenant la touche <keycap>Ctrl</keycap> enfoncée et en cliquant sur chacun des disques dans la liste. Si vous avez sélectionné plusieurs disques, <application>Anaconda</application> décidera où exactement la partition devra être créée en se basant sur la configuration que vous avez adoptée pour le reste de l'installation. Si vous voulez être sûr que la partition sera placée sur un ensemble donné de disques, ne sélectionnez que ceux-ci et dé-sélectionnez les autres.

source: After you finish configuring the partition's location, click <guilabel>Save</guilabel> to return to the main <guilabel>Manual Partitioning</guilabel> screen.
fr: Une fois la configuration de l'emplacement de votre partition achevée, cliquez sur le bouton <guilabel>Enregistrer</guilabel> pour sauvegarder vos choix et retourner à l'écran <guilabel>Partitionnement manuel</guilabel>.

source: Configure other settings specific to the partition - its <guilabel>Mount Point</guilabel>, <guilabel>Desired Capacity</guilabel>, and <guilabel>File System</guilabel>. Press <guilabel>Update Settings</guilabel> to apply any changes to the configuration.
fr: Continuez la configuration de votre partition – son <guilabel>Point de montage</guilabel>, sa <guilabel>Capacité souhaitée</guilabel> et son <guilabel>Système de fichiers</guilabel>. Cliquez sur le bouton <guilabel>Mise à jour des paramètres </guilabel> pour appliquer les changements à la configuration.

source: Repeat this procedure for any additional standard partitions you want to create.
fr: Répétez cette procédure pour toute partition standard que vous voulez créer.
