Repository: jaaf/po_purifier
Catalog: */CustomSpoke_AddLVM.po
Languages: fr

source: Creating a Logical Volume Managament (LVM) Layout
fr: Créer un partitionnement LVM

source: <firstterm>Logical Volume Management</firstterm> (LVM) presents a simple logical view of underlying physical storage space, such as hard drives or LUNs. Partitions on physical storage are represented as <firstterm>physical volumes</firstterm> that can be grouped together into <firstterm>volume groups</firstterm>. Each volume group can be divided into multiple <firstterm>logical volumes</firstterm>, each of which is analogous to a standard disk partition. Therefore, LVM logical volumes function as partitions which can span multiple physical disks.
fr: Le <firstterm>Logical Volume Management</firstterm> (LVM) (Gestionnaire des volumes logiques) fournit une représentation logique simple de l'espace physique de stockage sous-jacent porté par des périphériques tels que les disques durs ou les LUNs (numéro d'unité logique). Les partitions sur les périphériques physiques sont vues comme des <firstterm>volumes physiques</firstterm> qui peuvent être regroupés dans des <firstterm>groupes de volumes</firstterm>. Chaque groupe de volumes peut alors être divisé en <firstterm>volumes logiques</firstterm>, qui seront utilisés comme des partitions standard de disque. Cela veut dire que les volumes logiques LVM fonctionnent comme des partitions qui peuvent s'étendre sur plusieurs disques physiques.

source: See <xref linkend="appe-lvm-overview" /> for additional information about the concepts behind Logical Volume Management.
fr: Voir l'<xref linkend="appe-lvm-overview" /> pour plus d'information sur la théorie de la gestion de volumes logiques.

source: Some partition types - notably the <filename class="directory">/boot</filename> directory and the BIOS Boot and EFI partitions - can not be placed on logical volumes. Use standard physical volumes for them. See <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> for more information.
fr: Certains types de partition ou certains dossiers - en particulier le dossier <filename class="directory">/boot</filename> et les partitions BIOS Boot et EFI - ne peuvent pas être sur des volumes logiques. Utilisez des volumes physique pour eux. Voir la <xref linkend="sect-installation-gui-manual-partitioning-recommended" /> pour plus d'information.

source: Create LVM Logical Volume
fr: Création de volumes logiques LVM

source: Follow the procedure below to create LVM logical volumes and volume groups.
fr: Suivez la procédure ci-dessous pour créer des volumes logiques LVM et des groupes de volumes.

source: Creating LVM Logical Volumes and Groups
fr: Création de volumes logiques LVM et de groupes de volumes

source: Click the <guilabel>+</guilabel> button at the bottom of the list showing existing mount points. A new dialog window will open.
fr: Cliquez sur le bouton <guilabel>+</guilabel> sous la liste des points de montage existants. Une nouvelle fenêtre de dialogue s'affiche.

source: In the new dialog window, specify a mount point for which you want to create a separate logical volume - for example, <filename class="directory">/</filename>. Optionally, specify a size for the volume using standard units such as MB or GB (for example, <literal>50GB</literal>). Then, click <guilabel>Add mount point</guilabel> to add the volume and return to the main partitioning screen.
fr: Dans la nouvelle fenêtre, spécifiez un point de montage pour lequel vous désirez créer un volume logique séparé – par exemple, <filename class="directory">/</filename>. En option, spécifiez une taille pour le volume en utilisant les unités standard telles que Mo ou Go (par exemple, <literal>50 Go</literal>). Ensuite, cliquez sur le bouton <guilabel>Ajouter un point de montage</guilabel> pour ajouter le volume et revenir à l'écran de partitionnement manuel principal.

source: When creating a mount point for swap on LVM, specify the mount point as <literal>swap</literal>.
fr: Lorsque vous créez un point de montage pour la partition d'échange (swap) sur LVM, choisissez le point de montage <literal>swap</literal>.

source: The mount point has now been created using the default settings, which means it has been created as an LVM logical volume, and a volume group has been created to contain it. Select the newly created mount point in the left pane to configure it further. If you want to use thin provisioning for this volume, change the <guilabel>Device Type</guilabel> option to <guilabel>LVM Thin Provisioning</guilabel>.
fr: Le point de montage est créé en utilisant les réglages par défaut, ce qui signifie qu'il est créé en utilisant un volume logique LVM. De plus un groupe de volumes est créé pour l'accueillir. Sélectionnez le point de montage qui vient d'être créé et utilisez le panneau de droite pour le configurer plus en détail. Si vous désirez l'allocation fine de l'espace pour ce volume, changez l'option <guilabel>Type de volume</guilabel> en <guilabel>Allocation fine LVM</guilabel>.

source: In the <guilabel>Volume Group</guilabel> menu, you can see that the volume has been assigned to an automatically created volume group, which is named after the &PRODUCT; variant you are installing (for example, <literal>fedora-server</literal>. Click the <guilabel>Modify</guilabel> button under the drop-down menu to access the volume group settings.
fr: Dans le menu déroulant intitulé <guilabel>Groupe de volumes</guilabel>, vous pouvez voir que le volume a été assigné à un groupe de volumes créé automatiquement et nommé d'après la variante de &PRODUCT; que vous installez (par exemple , <literal>fedora-server</literal>. Cliquez sur le bouton <guilabel>Modifier </guilabel> sous le menu déroulant pour accéder aux réglages du groupe de volumes.

source: In the <guilabel>Configure Volume Group</guilabel> dialog, you can change the volume group's name, its <guilabel>RAID level</guilabel> (see <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> for information about available RAID types), and you can also specify which physical devices (disks) this volume group should reside on. You can select one or more disks which will be used to hold this volume group by holding down <keycap>Ctrl</keycap> and clicking each disk in the list.
fr: Dans la fenêtre de dialogue <guilabel>Configurer un groupe de volumes</guilabel>, vous pouvez changer le nom du groupe de volumes, son <guilabel>niveau Raid</guilabel> (voir la <xref linkend="sect-installation-gui-manual-partitioning-filesystems" /> pour de l'information sur les types RAID disponibles), et vous pouvez aussi spécifier sur quel disque physique ce volume doit se trouver. Vous pouvez sélectionner un ou plusieurs disques pour contenir ce groupe de volumes en tenant la touche <keycap>Ctrl</keycap> enfoncée et en cliquant sur les disques à sélectionner dans la liste.

source: If you select a redundant RAID type (such as <guilabel>RAID1 (Redundancy)</guilabel>), the volume group will take up twice its actual size on your disks. A 5 GB volume group with RAID1 will take up 10 GB of space.
fr: Si vous sélectionnez un type RAID1 redondant (tel que <guilabel>RAID1 (Redondance)</guilabel>, le groupe de volumes, occupera deux fois sa taille réelle sur les disques ; par exemple, un groupe de volumes RAID1 de 5 Go occupera 10 Go d'espace sur les disques.

source: You can also make sure that the volume group is encrypted by selecting the <guilabel>Encrypt</guilabel> option; this will enable LUKS encryption for the entire volume group. See the <citetitle>&PRODUCT; Security Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />, for information about LUKS disk encryption.
fr: Vous pouvez aussi faire en sorte que le groupe de volumes soit chiffré en sélectionnant l'option <guilabel>chiffré</guilabel> ; cela active le chiffrement pour le groupe de volumes tout entier. Voir le <citetitle>Guide de la sécurité de &PRODUCT;</citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" /> pour des informations sur le chiffrement LUKS.

source: Additionally, you can set a fixed size for the volume group by selecting the <guilabel>Fixed</guilabel> option from the <guilabel>Size policy</guilabel> menu and entering a size for the volume group.
fr: De plus, vous pouvez rendre fixe la taille du groupe de volumes en sélectionnant l'option <guilabel>Défini</guilabel> dans la liste déroulante intitulée <guilabel>Stratégie sur la taille</guilabel> et en saisissant un taille pour le groupe dans le champ voisin.

source: After you finish configuring the volume group settings, click <guilabel>Save</guilabel> to return to the main <guilabel>Manual Partitioning</guilabel> screen.
fr: Après que vous avez fini de configurer le groupe de volumes, cliquez sur le bouton <guilabel>Enregistrer</guilabel> pour retourner à l'écran principal de <guilabel>Partitionnement manuel</guilabel>.

source: The configuration dialog does not allow you to specify the size of the volume group's <firstterm>physical extents</firstterm>. The size will always be set to the default value of 4 MiB. If you want to create a volume group with different physical extents, create it manually by switching to an interactive shell and using the <command>vgcreate</command> command, or use a Kickstart file with the <command>volgroup --pesize=<replaceable>size</replaceable></command> command.
fr: La fenêtre de configuaion ne vous permet pas de spécifier la taille des <firstterm>extensions physiques</firstterm> du groupe de volumes. Cette taille est toujours fixée à une valeur par défaut de 4 Mio. Si vous désirez créer un groupe de volumes avec des extensions physiques différentes, créez le manuellement en passant à un shell interactif et utilisez la commande <command>vgcreate</command>, ou utilisez un fichier Kickstart avec la commande <command>volgroup --pesize= <replaceable>taille</replaceable></command>.

source: If you need to create more than one volume group, open the <guilabel>Volume Group</guilabel> drop-down menu and select the <guilabel>Create a new volume group</guilabel> option. A new dialog window will open, identical to the one described in the previous step. Again, select a name, storage devices, encryption settings, RAID level and size policy for the new group, and click <guilabel>Save</guilabel>. The new volume group will then become available in the <guilabel>Volume Group</guilabel> drop-down menu; you can then go through your existing mount points and change this setting to assign them to a different volume group.
fr: Si vous avez besoin de créer plus d'un groupe de volumes, ouvrez le menu déroulant <guilabel>Groupe de volumes</guilabel> et choisissez l'option <guilabel>Créer un groupe de volumes</guilabel>. Une nouvelle fenêtre de dialogue s'affiche, identique à celle décrite à l'étape précédente. Sélectionnez à nouveau un nom, des périphériques de stockage, les options de chiffrement, les niveaux de RAID et la stratégie sur la taille pour le nouveau groupe et cliquez sur le bouton <guilabel>Enregistrer</guilabel>. Le nouveau groupe de volumes devient alors disponible dans le menu déroulant <guilabel>Groupes de volumes</guilabel>. Vous pouvez ensuite passer vos points de montage en revue et changer ce réglage pour l'assigner à un groupe de volumes différent.

source: Configure other settings specific to the logical volume - its <guilabel>Mount Point</guilabel>, <guilabel>Desired Capacity</guilabel>, <guilabel>File System</guilabel>, and <guilabel>Name</guilabel>. Press <guilabel>Update Settings</guilabel> to apply any changes to the configuration.
fr: Configurez les autres réglages spécifiques au volume logique – son <guilabel>point de montage</guilabel>, sa <guilabel>capacité souhaitée</guilabel>, son <guilabel>système de fichiers</guilabel> et son <guilabel>nom</guilabel>. Cliquez sur le bouton <guilabel>Mise à jour des paramètres</guilabel> pour appliquer les changements apportés à la configuration.

source: Repeat this procedure for any additional logical volumes you want to create. Note that when creating additional LVM logical volumes, a new volume group is not automatically created each time; instead, any additional volumes are assigned to an existing group.
fr: Répétez cette procédure pour tous les volumes logiques que vous voulez créer. Notez qu'à la création d'un volume logique LVM supplémentaire, ce dernier est automatiquement assigné à un nouveau groupe de volumes plutôt qu'à un groupe de volumes existant.

source: For each mount point you create, review its settings and make sure that it is assigned to the correct group, that it has sufficient capacity, and that it has a descriptive name so you can identify the volume later if you need to.
fr: Pour chacun des points de montage que vous avez créés, passez ses réglages en revue et assurez-vous qu'il est assigné au groupe de volumes correct, qu'il a une capacité suffisante et que son nom est suffisamment évocateur pour que vous puissiez facilement l'identifier par la suite.
