Repository: jaaf/po_purifier
Catalog: */Downloading_Fedora.po
Languages: fr

source: Downloading Fedora
fr: Téléchargement de &PRODUCT;

source: Fedora Flavors
fr: Variantes de &PRODUCT;

source: Fedora provides three primary flavors tailored for some specific use cases. <ulink url="https://getfedora.org" /> offers Fedora Cloud for scalable infrastructure, Fedora Server for organizational infrastructure, and Fedora Workstation for the developer and desktop user.
fr: &PRODUCT; fournit trois variantes taillées sur mesure pour des usages spécifiques. La page <ulink url="https://getfedora.org" /> met à votre disposition Fedora Cloud pour une infrastructure évolutive, Fedora Server pour une infrastructure organisationnelle et Fedora Workstation pour le développeur ou l'utilisateur standard d'une station de travail &PRODUCT;

source: For alternative desktop environments or media built for more niche purposes, check out <ulink url="https://spins.fedoraproject.org">Fedora Spins</ulink>.
fr: Pour des environnements de bureau alternatifs ou des médias compilés pour des besoins de niche, allez jeter un coup d'œil à <ulink url="https://spins.fedoraproject.org">Fedora Spins</ulink>.

source: Each of these downloads provides a different set of default packages, but you can add to your system after the initial installation to customize it for your needs. The installation process is the same for all spins and flavors, so you can use this guide for any choice you make.
fr: Chacun de ces téléchargements fournit un jeu différent de paquets, mais vous pouvez en ajouter après l'installation initiale pour personnaliser votre système en fonction de vos besoins. Le processus d'installation est le même pour toutes les alternatives et variantes ; vous pouvez donc utiliser ce guide pour n'importe quel choix que vous ferez.

source: Which Architecture Is My Computer?
fr: Détermination de l'architecture de sa machine

source: Most modern systems are 64&nbsp;bit x86 architecture. If your computer was manufactured after 2007, or you aren't sure, you probably have a <literal>x86_64</literal> system.
fr: L'architecture de la plupart des ordinateurs moderne est x86 64 bits. Si votre ordinateur a été fabriqué après 2007, ou si vous n'êtes par certain, vous avez probablement un système <literal>x86_64</literal>.

source: Changing a Fedora installation from one architecture to another is not supported. Use the following table to determine the architecture of your computer according to the type of processor. Consult your manufacturer's documentation for details on your processor, or resources such as <ulink url="http://ark.intel.com/" /> or <ulink url="http://products.amd.com/" />, if necessary.
fr: Passer une installation de &PRODUCT; d'une architecture à l'autre n'est pas pris en charge. Utilisez le tableau suivant pour déterminer l'architecture de votre ordinateur selon le type du processeur. Consultez le manuel de votre fabricant pour trouver les informations sur votre processeur, ou visitez des ressources en ligne telles que <ulink url="http://ark.intel.com/" /> ou <ulink url="http://products.amd.com/" /> si nécessaire.

source: Processor and architecture types
fr: Types de processeur et d'architecture

source: Processor manufacturer and model
fr: Fabricant et modèle de processeur

source: Architecture type for Fedora
fr: Architecture type for &PRODUCT;

source: some Intel Atom, Core series, Pentium 4, and recent vintage Xeon; AMD Athlon, Duron, some Semprons; and older; VIA C3, C7
fr: Type d'architecture pour &PRODUCT;

source: some Intel Atom, Core 2 series, Core i series and Xeon; AMD: Athlon 64, Athlon II, Sempron64, Phenom series, Fusion series, Bulldozer series and Opteron; Apple MacBook, MacBook Pro, and MacBook Air
fr: Quelques Intel Atom, séries Core 2 , séries Core i et Xeon; AMD: Athlon 64, Athlon II, Sempron64, séries Phenom, séries Fusion, séries Bulldozer et Opteron; Apple MacBook, MacBook Pro, et MacBook Air

source: Media Types
fr: Types de médias

source: Several media types are available. Choose the one that best suits your requirements.
fr: Plusieurs types de médias sont disponibles. Choisissez celui qui correspond le mieux à vos besoins.

source: Live Image
fr: Image « Live »

source: Live images allow you to preview Fedora before installing it. Instead of booting directly into the installer, a live image loads the same environment you'll get after installation. Fedora Workstation and Fedora Spins are live images.
fr: Les images Live vous permettent de vous faire une idée de &PRODUCT; avant de l'installer. Au lieu de démarrer directement l'installateur, un image Live charge un environnement identique à celui dont vous disposerez après l'installation. Fedora Workstation et Fedora Spins sont des images Live.

source: Use a live image to install your favorite system, test Fedora on new hardware, troubleshoot, or share with friends.
fr: Utilisez une image Live pour installer votre système favori, testez &PRODUCT; sur un nouveau matériel, dépannez ou partagez avec des amis.

source: DVD Image
fr: Image DVD

source: DVD images boot directly into the installation enviroment, and allow you to choose from a variety of packages that are provided with it. In Fedora 21, the DVD option is only available in the <productname>Fedora Server</productname> flavor.
fr: Les images DVD démarrent directement dans l'environnement d'installation et vous permettent de choisir parmi une variété de paquets qui sont fournis avec elles. Dans &PRODUCT; 21, l'option DVD est seulement disponible avec la variante <productname>Fedora Server</productname>.

source: Use the Fedora Server DVD image when you want customized Fedora Server installations using an offline installation source.
fr: Utilisez l'image DVD de Fedora Server lorsque vous voulez une installation personnalisée de Fedora Server en utilisant une source hors ligne.

source: netinstall Image
fr: Image d'installation réseau

source: The netinstall image boots directly into the installation environment, and uses the online Fedora package repositories as the installation source. With a netinstall image, you can select a wide variety of packages to create a customized installation of Fedora.
fr: L'image d'installation réseau (netinstall) démarre directement dans l'environnement d'installation et utilise le dépôt des paquets en ligne de &PRODUCT; en tant que source d'installation. Avec une image d'installation réseau, vous pouvez choisir parmi une grande variété de paquets pour créer une installation personnalisée de &PRODUCT;.

source: The Fedora Server netinstall image is a universal one, and can be used to install any Fedora flavor or your own set of favorite packages.
fr: L'image d'installation réseau de Fedora Server est une image universelle. Elle peut être utilisée pour installer n'importe quelle variante de Fedora ou votre propre jeu de paquets.

source: ARM images
fr: Images ARM

source: For many ARM systems, Fedora provides preconfigured filesystem images. Write the image to removable media and boot directly into a Fedora installation that's ready to use.
fr: Pour beaucoup de systèmes ARM, Fedora fournit des images de systèmes de fichiers pré-configurées. Gravez ces images sur un média amovible et démarrez directement dans une installation Fedora prête à l'emploi.

source: ARM devices often require special setup procedures that aren't covered in this guide. Start learning about Fedora ARM at <ulink url="https://fedoraproject.org/wiki/Architectures/ARM" />
fr: Les périphériques ARM requièrent souvent des procédures spéciales de configuration qui ne sont pas couvertes par ce guide. Commencez par apprendre sur Fedora ARM à <ulink url="https://fedoraproject.org/wiki/Architectures/ARM" />.

source: Cloud Images
fr: Images d'informatique en nuage

source: Fedora Cloud images are preconfigured filesystem images with very few packages installed by default. They include special tools for interacting with cloud platforms, and are not intended to be used outside of cloud environments.
fr: Les images d'informatique en nuage de &PRODUCT; sont des images de systèmes de fichiers pré-configurées comprenant très peu de paquets installés par défaut. Elles comprennent des outils particuliers pour interagir avec les plateformes d'informatique en nuage et ne sont pas prévues pour être utilisées en dehors des environnements d'informatique en nuage.

source: Fedora Cloud comes in several varieties. The Fedora Cloud Base image is a minimal base for cloud deployments. The Fedora Cloud Atomic image is a Docker container host that uses <ulink url="http://www.projectatomic.io/">Project Atomic</ulink> technology for updates. A Docker base image for Fedora is also available.
fr: &PRODUCT; Cloud se présente en plusieurs variantes. L'image « &PRODUCT; Cloud Base » est une image minimale de base pour déployer l'informatique en nuage. L'image « &PRODUCT; Cloud Atomic » est un conteneur Docker hôte qui utilise les technologies <ulink url="http://www.projectatomic.io/">Project Atomic</ulink> pour les mises à jour. Une image de base Doker est également disponible pour &PRODUCT;.

source: Cloud images are preconfigured and do not require installation as described in this guide. Get started using Fedora Cloud at <ulink url="http://fedoraproject.org/wiki/Cloud" />
fr: Les images d'informatique en nuage sont pré-configurées et ne requièrent pas d'être installées en suivant ce guide. Apprenez à utiliser &PRODUCT; Cloud sur la page <ulink url="http://fedoraproject.org/wiki/Cloud" />.

source: Boot Images
fr: Images de démarrage

source: The tiny images at <ulink url="https://boot.fedoraproject.org/" /> are written to CDs, USB drives, or even floppy disks. The BFO image loads installation media from Fedora's servers and directly loads an installation environment, like the netinstall ISO.
fr: Les toutes petites images disponibles à <ulink url="https://boot.fedoraproject.org/" /> sont écrites sur des CDs, des disques USB ou même des disquettes souples. L'image BFO, à l'instar de l'ISO netinstall, charge des médias d'installation depuis les serveurs de &PRODUCT; et charge directement un environnement d'installation.

source: BFO images work like PXE deployments, without having to set up a server.
fr: Les images BFO fonctionnent comme les déploiements PXE sans nécessiter la configuration d'un serveur.
