Repository: jaaf/po_purifier
Catalog: */InitialSetupHub.po
Languages: fr

source: Initial Setup
fr: Configuration initiale

source: The <guilabel>Initial Setup</guilabel> screen is shown after the installation finishes and the installed system boots for the first time, before the first login, assuming the following conditions have been met:
fr: L'écran de <guilabel>configuration initiale</guilabel> est affiché, avant la première connexion, après que l'installation s'est terminée et que le système a redémarré pour la première fois, en supposant que les conditions suivantes sont satisfaites :

source: Your software selection contained a graphical environment (for example, you installed the system using a &PRODUCT; Workstation live image).
fr: Votre sélection de logiciels comprend un environnement graphique (par exemple, vous avez réalisé l'installation à partir d'une image live de &PRODUCT; Workstation).

source: The graphical environment you have installed is <emphasis>not</emphasis> <application>GNOME Desktop Environment</application> (it provides its own initial setup utility which is described in <xref linkend="sect-gnome-initial-setup" />).
fr: L'environnement graphique que vous avez installé n'est <emphasis>pas</emphasis> l'<application>environnement de bureau GNOME</application> (ce dernier fournit son propre utilitaire de configuration initiale qui est décrit à la <xref linkend="sect-gnome-initial-setup" />).

source: The <package>initial-setup</package> package has been installed.
fr: Le paquet <package>initial-setup</package> a été installé.

source: You have not configured every screen available in the graphical installer.
fr: Vous n'avez pas configuré tous les écrans disponibles dans l'installateur graphique.

source: <application>Initial Setup</application> allows you to configure several system settings. All of these can also be configured during the installation, but they are not required to finish it. Only the settings which have <emphasis>not</emphasis> been configured during the installation will be shown; for example, if you did not create a non-<systemitem class="username">root</systemitem> user account during the installation, <application>Initial Setup</application> will start after the first reboot, and you will be able to configure one. If you configured all available options during the instalaltion, <application>Initial Setup</application> will not be displayed at all.
fr: L'utilitaire de <application>configuration initiale</application> vous permet d'effectuer plusieurs réglages. Tous ceux-ci peuvent être configurés lors de l'installation, mais ne sont pas indispensables à son achèvement. Seuls les réglages qui n'ont pas été faits durant l'installation sont présentés ; par exemple, si vous n'avez <emphasis>pas</emphasis> créé un compte utilisateur normal (non-<systemitem class="username">root</systemitem>) pendant l'installation, l'utilitaire de <application>configuration initiale</application> démarre après le premier redémarrage et vous permet de le faire. Si vous avez configuré toutes les options disponibles lors de l'installation, l'utilitaire de <application>configuration initiale</application> ne se montre pas du tout.

source: To configure any aspect of the system available in the utility, click any of the links available in the main window (for example, <guilabel>Create User</guilabel>). Each link leads to a separate screen with separate options; these screens are the same ones which were available during the graphical installation. If you need help, press <guilabel>Help</guilabel> in the top left corner to open a new window containing directions for that screen.
fr: Pour configurer tous les aspects du système disponibles dans cet utilitaire, cliquez sur les liens disponibles dans la fenêtre principale (par exemple, <guilabel>Créer un utilisateur</guilabel>). Chacun des liens vous conduit vers un écran distinct avec des options distinctes ; ces écrans sont les mêmes que ceux mis à votre disposition durant l'installation graphique. Si vous avez besoin d'aide, cliquez sur le bouton <guilabel>Aide</guilabel> en haut à gauche pour ouvrir une fenêtre contenant des instructions relatives à cet écran.

source: After you finish configuring any screen, press the <guilabel>Done</guilabel> button in the top left corner to return to the main <application>Initial Setup</application> menu. After you finish configuring all settings, click <guilabel>Finish Configuration</guilabel> in the bottom right corner to save all configured settings. The configuration utility will close and you will be able to log in to the system.
fr: Une fois que vous avez configuré un écran, cliquez sur le bouton <guilabel>Fait</guilabel> en haut à gauche pour retourner au menu de l'utilitaire de <application>configuration initiale</application>. Dès lors que vous avez configuré tous les réglages, cliquez sur le bouton <guilabel>Terminer la configuration</guilabel> en bas à droite pour enregistrer tous vos réglages. L'utilitaire de configuration initiale se ferme et vous pouvez vous connecter au système.

source: It is possible to configure <application>Initial Setup</application> to display all available options, even if they have been already configured during the installation. To do so, you must use a Kickstart file at the start of the installation, and this file must contain the following command:
fr: Il est possible de configurer l'utilitaire de <application>configuration initiale</application> pour qu'il affiche toutes les options disponibles, même si celles-ci ont déjà été configurées durant l'installation. Pour cela, vous devez utiliser un fichier Kickstart au début de l'installation et ce fichier doit contenir les commandes suivantes :

source: The <option>--reconfig</option> option specifies that all options should be displayed. See <xref linkend="chap-kickstart-installations" /> for information about Kickstart installations.
fr: L'option <option>--reconfig</option> spécifie que toutes les options doivent être affichées. Voir le <xref linkend="chap-kickstart-installations" /> pour des informations sur les installation Kickstart.

source: Normally, it is not possible to return to <application>Initial Setup</application> after you close it and log in to the system. You can make it display again (after the next reboot, before a login prompt is displayed), by executing the following command as <systemitem class="username">root</systemitem>:
fr: Normalement, l'utilitaire de <application>configuration initiale</application> n'apparaît plus après que vous l'avez fermé et que vous vous êtes connecté au système. Vous pouvez le faire réapparaître à nouveau au redémarrage suivant (avant que l'invite de connexion n'apparaisse), en exécutant la commande suivante en tant que super utilisateur <systemitem class="username">root</systemitem> :

source: Then, reboot your system.
fr: Ensuite, redémarrez le système.
