Repository: jaaf/po_purifier
Catalog: */Installing_Using_Anaconda.po
Languages: fr

source: Installing Using Anaconda
fr: Installation avec Anaconda

source: This chapter provides step-by-step instructions for installing &PRODUCT; using the <application>Anaconda</application> installer. The bulk of this chapter describes installation using the graphical user interface. A text mode is also available for systems with no graphical display, but this mode is limited in certain aspects (for example, custom partitioning is not possible in text mode).
fr: Ce chapitre vous explique, étape par étape, comment installer &PRODUCT; avec l'installateur <application>Anaconda</application>. La plus grande part de ce chapitre décrit une installation utilisant l'interface utilisateur graphique. Il existe également un mode texte, sans affichage graphique, mais ce mode ne concerne que certains aspects (par exemple, le partitionnement personnalisé n'est pas possible en mode texte).

source: If your system does not have the ability to use the graphical mode, you can:
fr: Si votre système n'est pas capable d'utiliser le mode graphique, vous pouvez :

source: Use Kickstart to automate the installation as described in <xref linkend="chap-kickstart-installations" />
fr: Utiliser Kickstart pour automatiser l'installation comme c'est expliqué au <xref linkend="chap-kickstart-installations" />.

source: Perform the graphical installation remotely by connecting to the installation system from another computer with a graphical display using the <firstterm>VNC</firstterm> (Virtual Network Computing) protocol - see <xref linkend="chap-vnc-installations" />
fr: Effectuer une installation graphique à distance en vous connectant au système d'installation depuis un autre ordinateur doté d'un moniteur et utilisant le protocole <firstterm>VNC</firstterm> (Virtual Network Computing)(Informatique virtuelle en réseau) – voir le <xref linkend="chap-vnc-installations" />.

source: Introduction to Anaconda
fr: Introduction à Anaconda

source: The &PRODUCT; installer, <application>Anaconda</application>, is different from most other operating system installation programs due to its parallel nature. Most installers follow a fixed path: you must choose your language first, then you configure network, then installation type, then partitioning, etc. There is usually only one way to proceed at any given time.
fr: L'installateur de &PRODUCT;, <application>Anaconda</application>, est différent de la plupart des autres installateurs de système d'exploitation de par sa nature parallèle. La plupart des installateurs suivent un chemin défini : vous devez d'abord choisir votre langue, puis configurer le réseau, choisir le type d'installation, le partitionnement, etc. Il y a ordinairement un seul chemin à suivre à un moment donné.

source: In <application>Anaconda</application> you are only required to select your language and locale first, and then you are presented with a central screen, where you can configure most aspects of the installation in any order you like. This does not apply to all parts of the installation process, however - for example, when installing from a network location, you must configure the network before you can select which packages to install.
fr: Avec <application>Anaconda</application>, on vous demande seulement de choisir d'abord votre langue et votre locale. Ensuite, on vous présente un écran central à partir duquel vous pouvez configurer la plupart des aspects de l'installation dans l'ordre qui vous convient. Néanmoins, cela n'est pas vrai pour toutes les parties du processus d'installation – par exemple, lorsque vous installez depuis un emplacement réseau, vous devez configurer le réseau avant de pouvoir choisir les paquets à installer.

source: Some screens will be automatically configured depending on your hardware and the type of media you used to start the installation. You can still change the detected settings in any screen. Screens which have not been automatically configured, and therefore require your attention before you begin the installation, are marked by an exclamation mark. You can not start the actual installation process before you finish configuring these settings.
fr: Certains écrans sont configurés automatiquement en fonction de votre matériel et du type de média utilisé pour démarrer l'installation. Vous avez toujours la possibilité de changer les réglages automatiques dans n'importe quel écran. Les écrans qui n'ont pas été configurés automatiquement, et qui par conséquent requièrent votre attention avant que vous ne commenciez l'installation, sont marqués d'un point d'exclamation. Vous ne pouvez pas démarrer l'installation effective tant que vous n'avez pas fini de configurer ces écrans.

source: Additional differences appear in certain screens; notably the custom partitioning process is very different from other Linux distributions. These differences are described in each screen's subsection.
fr: Des différences additionnelles apparaissent dans certains écrans ; en particulier le processus de partitionnement est très différent de celui des autres distributions. Ces différences sont décrites dans chacune des sous-sections de l'écran.

source: Consoles and Logging During the Installation
fr: Les consoles et la connexion durant l'installation

source: The following sections describe how to access logs and an interactive shell during the installation. This is useful when troubleshooting problems, but should not be necessary in most cases.
fr: La section suivante explique comment accéder aux journaux et à un shell interactif durant l'installation. Cela est utile pour résoudre les problèmes, mais n'est pas nécessaire dans la plupart des cas.

source: Accessing Consoles
fr: Accès aux consoles

source: The &PRODUCT; installer uses the <application>tmux</application> terminal multiplexer to display and control several windows you can use in addition to the main interface. Each of these windows serves a different purpose - they display several different logs, which can be used to troubleshoot any issues during the installation, and one of the windows provides an interactive shell prompt with <systemitem class="username">root</systemitem> privileges, unless this prompt was specifically disabled using a boot option or a Kickstart command.
fr: L'installateur de &PRODUCT; utilise le multiplexeur de terminaux <application>tmux</application> pour afficher et contrôler plusieurs fenêtres que vous pouvez utiliser en plus de l'interface principale. Chacune de ces fenêtres sert un objectif différent – elles affichent plusieurs journaux différents, qui peuvent être utilisés pour résoudre les problèmes durant l'installation, et une de ces fenêtres fournit une invite de commande avec les privilèges du super utilisateur <systemitem class="username">root</systemitem>, sauf si cette invite a été explicitement désactivée par une option de démarrage ou une commande Kickstart.

source: In general, there is no reason to leave the default graphical installation environment unless you need to diagnose an installation problem.
fr: En général, il n'y a pas de raison de quitter l'environnement graphique d'installation par défaut sauf si vous avez besoin de diagnostiquer un problème d'installation.

source: The terminal multiplexer is running in virtual console 1. To switch from the actual installation environment to <application>tmux</application>, press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo>. To go back to the main installation interface which runs in virtual console 6, press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F6</keycap></keycombo>.
fr: Le multiplexeur de terminaux s'exécute dans la console virtuelle 1. Pour commuter de l'environnement d'installation réel vers <application>tmux</application>, pressez la combinaison de touches <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo>. Pour revenir à l'interface d'installation principale qui s'exécute dans la console virtuelle 6, pressez la combinaison de touches <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F6</keycap></keycombo>.

source: If you choose text mode installation, you will start in virtual console 1 (<application>tmux</application>), and switching to console 6 will open a shell prompt instead of a graphical interface.
fr: Si vous avez choisi l'installation en mode texte, vous commencez avec la console 1 (<application>tmux</application>). Le passage à la console 6 ouvre une invite de commande au lieu d'une interface graphique.

source: The console running <application>tmux</application> has 5 available windows; their contents are described in the table below, along with keyboard shortcuts used to access them. Note that the keyboard shortcuts are two-part: first press <keycombo><keycap>Ctrl</keycap><keycap>b</keycap></keycombo>, then release both keys, and press the number key for the window you want to use.
fr: La console dans laquelle s'exécute <application>tmux</application> a 5 fenêtres disponibles ; leur contenu est décrit dans le tableau ci-dessous avec les raccourcis clavier utilisés pour y accéder. Notez que les raccourcis clavier fonctionnent en deux temps : d'abord on presse la combinaison de touches <keycombo><keycap>Ctrl</keycap><keycap>b</keycap></keycombo>, puis on relâche tout pour ensuite presser la touche correspondant au numéro de la fenêtre à utiliser.

source: You can also use <keycombo><keycap>Ctrl</keycap><keycap>b</keycap></keycombo> <keycap>n</keycap> and <keycombo><keycap>Ctrl</keycap><keycap>b</keycap></keycombo> <keycap>p</keycap> to switch to the next or previous <application>tmux</application> window, respectively.
fr: Vous pouvez également utiliser <keycombo><keycap>Ctrl</keycap><keycap>b</keycap></keycombo> <keycap>n</keycap> ou <keycombo><keycap>Ctrl</keycap><keycap>b</keycap></keycombo> <keycap>p</keycap> pour passer à la fenêtre suivante (next) ou précédente (previous) de <application>tmux</application> respectivement.

source: Available tmux Windows
fr: Fenêtres tmux disponibles

source: Shortcut
fr: Raccourci

source: Contents
fr: Contenu

source: Main installation program window. Contains text-based prompts (during text mode installation or if you use VNC direct mode), and also some debugging information.
fr: Fenêtre principale de l'installateur. Contient des invites de commande textuelles (durant l'installation en mode texte ou en mode VNC direct) ainsi que quelques informations de débogage.

source: Interactive shell prompt with <systemitem class="username">root</systemitem> privileges.
fr: Une invite de commande de shell avec les privilèges du super utilisateur <systemitem class="username">root</systemitem>.

source: Installation log; displays messages stored in <filename>/tmp/anaconda.log</filename>.
fr: Journaux d'installation : affiche les messages stockés dans <filename>/tmp/anaconda.log</filename>.

source: Storage log; displays messages related storage devices from kernel and system services, stored in <filename>/tmp/storage.log</filename>.
fr: Journaux de stockage : affiche les messages des services système et noyau relatifs aux périphériques de stockage, stockés dans <filename>/tmp/storage.log</filename>.

source: Program log; displays messages from other system utilities, stored in <filename>/tmp/program.log</filename>.
fr: Journaux des programmes : affiche les messages des autres utilitaires système, stockés dans <filename>/tmp/program.log</filename>.

source: In addition to displaying diagnostic information in <application>tmux</application> windows, <application>Anaconda</application> also generates several log files, which can be transferred from the installation system. These log files are described in <xref linkend="sect-troubleshooting-log-files" />, and directions for transferring them from the installation system are available in <xref linkend="sect-troubleshooting-transferring-logs" />.
fr: En plus d'afficher les informations de diagnostique dans les fenêtres <application>tmux</application>, <application>Anaconda</application> génère également plusieurs journaux, qui peuvent être transférés du système d'installation. Ces journaux sont décrits à la <xref linkend="sect-troubleshooting-log-files" />, et des instructions pour les récupérer du système d'installation sont disponibles à la <xref linkend="sect-troubleshooting-transferring-logs" />.

source: Saving Screenshots
fr: Sauvegarde des captures d'écran

source: You can press <keycombo><keycap>Shift</keycap><keycap>Print Screen</keycap></keycombo> at any time during the graphical installation to capture the current screen. These screenshots are saved to <filename class="directory">/tmp/anaconda-screenshots</filename>.
fr: À tout moment pendant l'installation, vous pouvez presser <keycombo><keycap>Shift</keycap><keycap>Print Screen</keycap></keycombo> pour capturer l'écran courant. Ces captures sont sauvegardées dans le dossier <filename class="directory">/tmp/anaconda-screenshots</filename>.

source: Additionally, you can use the <command>autostep --autoscreenshot</command> command in a Kickstart file to capture and save each step of the installation automatically. See <xref linkend="sect-kickstart-commands-autostep" /> for details.
fr: En outre, vous pouvez utiliser la commande <command>autostep --autoscreenshot</command> dans un fichier Kickstart pour capturer et sauvegarder automatiquement l'écran à chaque étape de l'installation. Voir la <xref linkend="sect-kickstart-commands-autostep" /> pour les détails.

source: Installing in Text Mode
fr: Installation en mode texte

source: Text mode installation offers an interactive, non-graphical interface for installing &PRODUCT;. This may be useful on systems with no graphical capabilities; however, you should always consider the available alternatives before starting a text-based installation. Text mode is limited in the amount of choices you can make during the installation.
fr: L'installation en mode texte met à votre disposition une interface interactive non graphique pour installer &PRODUCT;. Cela peut être utile sur les systèmes qui ne disposent pas de capacités graphiques. Néanmoins, vous devez toujours prendre en considération les alternatives disponibles avec de commencer une installation en mode texte : le nombre de choix que vous pouvez faire en mode texte est en effet limité.

source: There are two alternatives to text mode which can both be used even if the installation system does not have a graphical display. You can either connect to the installation system using VNC and perform an interactive graphical installation remotely (see <xref linkend="chap-vnc-installations" />), or you can create a Kickstart file to perform the installation automatically (see <xref linkend="chap-kickstart-installations" />).
fr: Il y a deux alternatives au mode texte qui peuvent être toutes deux utilisées même si le système d'installation ne dispose pas d'affichage graphique. Vous pouvez, soit vous connecter au système d'installation avec VNC et effectuer une installation graphique interactive à distance (voir le <xref linkend="chap-vnc-installations" />), soit créer un fichier Kickstart pour effectuer une installation automatique (voir le <xref linkend="chap-kickstart-installations" />).

source: Text Mode Installation
fr: Installer en mode texte

source: Installation in text mode follows a pattern similar to the graphical installation: There is no single fixed progression; you can configure many settings in any order you want using the main status screen. Screens which have already been configured, either automatically or by you, are marked as <literal>[x]</literal>, and screens which require your attention before the installation can begin are marked with <literal>[!]</literal>. Available commands are displayed below the list of available options.
fr: L'installation en mode texte suit un modèle similaire à celui de l'installation graphique : il n'y a pas une progression unique figée ; vous pouvez configurer de nombreuses choses dans l'ordre qui vous convient en utilisant l'écran d'état principal. Les écrans qui ont déjà été configurés, soit automatiquement, soit par vous, sont marqués d'un <literal>[x]</literal>, et les écrans qui réclament votre attention avant que l'installation ne commence sont marqués d'un <literal>[!]</literal>. Les commandes disponibles sont affichées sous la liste des options disponibles.

source: Limits of interactive text mode installation include:
fr: L'installation en mode texte interactif présente les limitations suivantes :

source: The installer will always use the English language and the US English keyboard layout. You can configure your language and keyboard settings, but these settings will only apply to the installed system, not to the installation.
fr: L'installateur utilise toujours l'anglais et l'agencement de clavier « US English ». Vous pouvez configurer votre langue et votre agencement de clavier, mais ces réglages ne concernent que le système installé, pas le système d'installation.

source: You can not configure any advanced storage methods (LVM, software RAID, FCoE, zFCP and iSCSI).
fr: Vous ne pouvez configurer aucune des méthodes de stockage avancées (LVM, RAID logiciel, FCoE, zFCP et iSCSI).

source: It is not possible to configure custom partitioning; you must use one of the automatic partitioning settings. You also cannot configure where the boot loader will be installed.
fr: Il n'est pas possible de réaliser un partitionnement personnalisé : vous devez utiliser un des partitionnements pré-établis. Vous ne pouvez pas non plus décider de l'endroit où installer le chargeur de démarrage.

source: To start a text mode installation, boot the installation with the <option>inst.text</option> boot option used either at the boot command line in the boot menu, or in your PXE server configuration. See <xref linkend="chap-booting-the-installation" /> for information about booting and using boot options.
fr: Pour démarrer une installation en mode texte, démarrez l'installation avec l'option de démarrage <option>inst.text</option> que vous aurez définie, soit dans la ligne de commande de démarrage du menu de démarrage, soit dans la configuration d'un serveur PXE. Voir le <xref linkend="chap-booting-the-installation" /> pour des informations sur le démarrage et sur l'utilisation des options de démarrage.

source: Installing in the Graphical User Interface
fr: Installation avec l'interface utilisateur graphique

source: The graphical installation interface is the preferred method of manually installing &PRODUCT;. It allows you full control over all available settings, including custom partitioning and advanced storage configuration, and it is also localized to many languages other than English, allowing you to perform the entire installation in a different language. The graphical mode is used by default when you boot the system from local media (a CD, DVD or a USB flash drive).
fr: La méthode d'installation graphique est la méthode à préférer pour installer &PRODUCT; à la main. Elle vous permet un contrôle total de tous les réglages disponibles, y compris le partitionnement personnalisé et la configuration avancée du stockage. Elle est également possible dans beaucoup de langues autres que l'anglais. Le mode graphique est utilisé par défaut lorsque vous démarrez le système depuis un média local (CD, DVD ou disque USB).

source: The sections below discuss each screen available in the installation process. Note that due to the installer's parallel nature, most of the screens do not have to be completed in the order in which they are described here.
fr: La section qui suit commente chacun des écrans disponibles durant le processus d'installation. Notez que, grâce à la nature parallèle de l'installateur, la plupart des écrans n'ont pas besoin d'être complétés dans l'ordre dans lequel ils sont décrits ici.

source: Each screen in the graphical interface contains a <guilabel>Help</guilabel> button. This button opens the <application>Yelp</application> help browser displaying the section of the <citation>&PRODUCT; Installation Guide</citation> relevant to the current screen.
fr: Chaque écran de l'installation graphique contient un bouton <guilabel>Aide</guilabel>. Un clic sur ce bouton ouvre le navigateur d'aide <application>Yelp</application> qui affiche la section du <citetitle>Guide d'installation de &PRODUCT; </citetitle> en rapport avec l'écran courant.

source: You can also control the graphical installer with your keyboard. Use <keycap>Tab</keycap> and <keycombo><keycap>Shift</keycap><keycap>Tab</keycap></keycombo> to cycle through active control elements (buttons, check boxes, etc.) on the current screen, <keycap>Up</keycap> and <keycap>Down</keycap> arrow keys to scroll through lists, and <keycap>Left</keycap> and <keycap>Right</keycap> to scroll through horizontal toolbars or table entries. <keycap>Space</keycap> or <keycap>Enter</keycap> can be used to select or remove a highlighted item from selection and to expand and collapse drop-down menus.
fr: Vous pouvez également contrôler l'installateur graphique avec votre clavier. Utilisez les touches <keycap>Tab</keycap> et <keycombo><keycap>Maj</keycap><keycap>Tab</keycap></keycombo> pour passer en boucle d'un élément de contrôle à l'autre (boutons, cases à cocher, etc.) sur l'écran courant, les touches de direction <keycap>&darr;</keycap> et <keycap>&uarr;</keycap> pour parcourir les éléments d'une liste, et les touches de direction <keycap>&larr;</keycap> et <keycap>&rarr;</keycap> pour parcourir à l'horizontal les éléments d'une barre d'outil ou d'un tableau. Les touches <keycap>Espace</keycap> ou <keycap>Entrée</keycap> peuvent être utilisées pour sélectionner ou dé-sélectionner un item dans une liste, ou pour déployer et contracter les menus déroulants.

source: Additionally, elements in each screen can be toggled using their respective shortcuts. These shortcuts are highlighted (underlined) when you hold down the <keycap>Alt</keycap> key; to toggle that element, press <keycombo><keycap>Alt</keycap><keycap><replaceable>X</replaceable></keycap></keycombo>, where <replaceable>X</replaceable> is the highlighted letter.
fr: De plus, les éléments dans chacun des écrans peuvent être inversés en utilisant leur raccourci clavier respectif. Ces raccourcis clavier sont soulignés lorsque vous maintenez la touche <keycap>Alt</keycap> enfoncée ; pour inverser l'élément pressez <keycombo><keycap>Alt</keycap><keycap><replaceable>X</replaceable></keycap></keycombo>, où <replaceable>X</replaceable> est la lettre soulignée.

source: Your current keyboard layout is displayed in the top right hand corner. Only one layout is configured by default; if you configure more than layout in the <guilabel>Keyboard Layout</guilabel> screen (<xref linkend="sect-installation-gui-keyboard-layout" />), you can switch between them by clicking the layout indicator.
fr: Votre agencement de clavier courant est affiché dans l'angle supérieur droit. Un agencement de clavier seulement est configuré par défaut ; si vous en configurez d'autres dans l'écran <guilabel>Agencements de clavier</guilabel> (<xref linkend="sect-installation-gui-keyboard-layout" />), vous pouvez passer de l'un à l'autre en cliquant sur l'indicateur d'agencement de clavier.
