Repository: jaaf/po_purifier
Catalog: */Kickstart_Installations.po
Languages: fr

source: Automating the Installation with Kickstart
fr: Automatiser l'installation avec Kickstart

source: Kickstart installations offer a means to automate the installation process, either partially or fully. Kickstart files contain answers to all questions normally asked by the installation program, such as what time zone do you want the system to use, how should the drives be partitioned or which packages should be installed. Providing a prepared Kickstart file when the installation begins therefore allows the you to perform the installation automatically, without need for any intervention from the user. This is especially useful when deploying &PRODUCT; on a large number of systems at once.
fr: Les installations Kickstart offrent la possibilité d'automatiser le processus d'installation, totalement ou partiellement. Les réponses aux questions normalement posées par l'installateur, telles que le fuseau horaire à utiliser, la manière de partitionner le disque et les paquets à installer, sont placées dans un fichier dit « Kickstart ». En fournissant un tel fichier au démarrage de l'installation vous pouvez effectuer l'installation automatiquement, sans avoir besoin d'interagir avec le processus manuellement. Cela est particulièrement utile si vous devez déployer &PRODUCT; sur un grand nombre de systèmes à la fois.

source: All Kickstart scripts and the log files of their execution are stored in the <filename>/tmp</filename> directory to assist with debugging installation issues.
fr: Tous les scripts Kickstart et les journaux de leur exécution sont stockés dans le dossier <filename>/tmp</filename> pour vous aider à résoudre les problèmes rencontrés.

source: How to Perform a Kickstart Installation
fr: Réalisation d'une installation Kickstart

source: Kickstart installations can be performed using a local DVD, a local hard drive, or via NFS, FTP, HTTP, or HTTPS.
fr: Les installations Kickstart peuvent être réalisées en utilisant un DVD local, un disque dur local ou via NFS, FTP, HTTP ou HTTPS.

source: To use Kickstart, you must:
fr: Pour utiliser Kickstart, il faut :

source: Create a Kickstart file.
fr: créer un fichier Kickstart ;

source: Create boot media or configure a network boot (PXE) server which will be used to begin the installation.
fr: créer un média de démarrage ou configurer un serveur réseau de démarrage (PXE) qui sera utilisé pour commencer l'installation ;

source: Make the Kickstart file available on removable media, a hard drive, or a network location.
fr: rendre le fichier Kickstart disponible sur un média amovible, un disque dur ou un emplacement réseau ;

source: Start the Kickstart installation by booting the installer and using a boot option to tell the installer where to find the Kickstart file.
fr: lancer l'installation Kickstart en démarrant l'installateur et en utilisant une option de démarrage pour dire à l'installateur où trouver le fichier Kickstart.

source: This chapter explains these steps in detail.
fr: Ce chapitre explique en détail chacune de ces étapes.

source: Creating a Kickstart File
fr: Création d'un fichier Kickstart

source: The Kickstart file itself is a plain text file, containing keywords listed in <xref linkend="appe-kickstart-syntax-reference" />, which serve as directions for the installation. Any text editor able to save files as ASCII text (such as <application>Gedit</application> or <application>vim</application> on Linux systems or <application>Notepad</application> on Windows systems) can be used to create and edit Kickstart files.
fr: Le fichier Kickstart en lui-même est un fichier de texte contenant les mots clé listés dan l'<xref linkend="appe-kickstart-syntax-reference" /> qui servent de directives pour l'installation. N'importe quel éditeur de texte capable de sauvegarder les fichiers en texte ASCII (tel que <application>Gedit</application> ou <application>vim</application> sur les systèmes Linux ou <application>Notepad</application> sur les systèmes Windows) convient pour créer et éditer un fichier Kickstart.

source: The recommended approach to creating Kickstart files is to perform a manual installation on one system first. After the installation completes, all choices made during the installation are saved into a file named <filename>anaconda-ks.cfg</filename>, located in the <filename class="directory">/root/</filename> directory on the installed system. You can then copy this file, make any changes you need, and use the resulting configuration file in further installations.
fr: L'approche recommandée pour créer un fichier Kickstart et de commencer par réaliser une installation manuelle d'un système. Après que l'installation s'est achevée, tous les choix faits pendant l'installation sont sauvegardés dans un fichier nommé <filename>anaconda-ks.cfg</filename> et situé dans le dossier <filename class="directory">/root/</filename> du système installé. Vous pouvez alors copier ce fichier, le modifier comme vous le souhaitez et utiliser la configuration résultante lors des installations suivantes.

source: When creating a Kickstart file, keep in mind the following:
fr: Lorsque vous créez un fichier Kickstart, sachez que :

source: Lines starting with a pound sign (<literal>#</literal>) are treated as comments and are ignored.
fr: Les lignes commençant par un croisillon (<literal>#</literal>) sont considérés comme des commentaires et ignorées.

source: Sections must be specified <emphasis>in order</emphasis>. Items within the sections do not have to be in a specific order unless otherwise specified. The correct section order is:
fr: Les sections doivent être spécifiées <emphasis>dans l'ordre</emphasis>. Par contre, les items dans les sections n'ont pas besoin de respecter un certain ordre sauf mention contraire. L'ordre correct des sections est le suivant :

source: The command section which contains actual Kickstart commands and options as listed in <xref linkend="appe-kickstart-syntax-reference" />. Note that some commands, such as <command>install</command>, are mandatory, but most commands are optional.
fr: La section des commandes qui contient les commandes réelles de Kickstart et les options telles que présentées dans l'<xref linkend="appe-kickstart-syntax-reference" />. Notez que certaines commandes comme <command>install</command> sont obligatoires mais la plupart d'entre-elles sont facultatives.

source: The <command>%packages</command> section which contains a list of packages and package groups to be installed. See <xref linkend="sect-kickstart-packages" /> for details.
fr: La section <command>%packages</command> qui contient une liste des paquets et des groupes de paquets à installer. Voir la <xref linkend="sect-kickstart-packages" /> pour les détails.

source: The <command>%pre</command> and <command>%post</command> sections, containing a pre-installation and post-installation scripts. These two sections can be in any order and are not mandatory. See <xref linkend="sect-kickstart-preinstall" /> and <xref linkend="sect-kickstart-postinstall" /> for details.
fr: Les sections <command>%pre</command> et <command>%post</command> qui contiennent des scripts de pre et post installation. Ces deux sections peuvent être dans n'importe quel ordre et sont facultatives. Voir la <xref linkend="sect-kickstart-preinstall" /> et la <xref linkend="sect-kickstart-postinstall" /> pour les détails.

source: The <command>%packages</command>, <command>%pre</command> and <command>%post</command> sections must end with <command>%end</command>, otherwise the installation program will refuse the Kickstart file. The main command section has no special ending statement.
fr: Les sections <command>%packages</command>, <command>%pre</command> et <command>%post</command> doivent se terminer par <command>%end</command> autrement l'installateur refuse le fichier Kickstart. La section principale des commandes n'a pas besoin d'instruction de fin particulière.

source: Omitting any required item results in the installation program prompting the user for an answer to the related item, just as the user would be prompted during a typical installation. Once the answer is given, the installation will continue. Note that if the system you are installing has no display, you will not be able to see the prompt, and the installation will appear to have failed.
fr: Lorsqu'un item requis manque, l'installateur invite l'utilisateur à fournir la réponse attendue, de la manière dont il y est invité lors d'une installation normale. Une fois que la réponse est fournie, l'installation reprend. Notez que si le système que vous installez n'a pas d'écran, vous ne pouvez voir l'invite et l'installation reste bloquée.

source: Verifying the Kickstart File
fr: Vérification du fichier Kickstart

source: When creating or customizing your kickstart file, it is useful to verify that it is valid before attempting to use it in an installation. &PRODUCT; includes the <application>ksvalidator</application> command line utility which can be used to do this. This tool is a part of the <package>pykickstart</package> package. To install this package, execute the following command:
fr: Après avoir créé ou personnalisé votre fichier Kickstart, il est utile de vérifier qu'il est valide avant de tenter de l'utiliser pour une installation. &PRODUCT; comprend un utilitaire en ligne de commande appelé <application>ksvalidator</application> pour faire cette vérification. Cet outil fait partie du paquet <package>pykickstart</package>. Pour installer ce paquet, utilisez la commande suivante :

source: After installing the package, you can validate a Kickstart file using the following command:
fr: Après avoir installé le paquet, vous pouvez l'utiliser pour valider un fichier Kickstart avec la commande suivante :

source: <prompt>$</prompt> <command>ksvalidator <replaceable>/path/to/kickstart.ks</replaceable></command>
fr: <prompt>$</prompt> <command>ksvalidator <replaceable>/chemin/de/kickstart.ks</replaceable></command>

source: Replace <replaceable>/path/to/kickstart.ks</replaceable> with the path to the Kickstart file you want to verify.
fr: Remplacez <replaceable>/chemin/de/kickstart.ks</replaceable> par le chemin réel du fichier Kickstart que vous voulez vérifier.

source: For more information about this tool, see the <systemitem>ksvalidator(1)</systemitem> man page.
fr: Pour plus d'information sur cet outil, lisez la page de manuel <systemitem>ksvalidator(1)</systemitem>.

source: Keep in mind that the validation tool has its limitations. The Kickstart file can be very complicated; <application>ksvalidator</application> can make sure the syntax is correct and that the file does not include removed options, but it cannot guarantee the installation will be successful. It also does not attempt to validate the <command>%pre</command>, <command>%post</command> and <command>%packages</command> sections of the Kickstart file.
fr: Soyez conscient que l'outil de validation a ses limites. Le fichier Kickstart peut être très compliqué ; <application>ksvalidator</application> peut vous garantir que la syntaxe est correcte et que le fichier ne contient pas d'option périmée mais il ne peut vous garantir que l'installation va réussir. Il ne cherche pas non plus à valider les sections <command>%pre</command>, <command>%post</command> et <command>%packages</command>.

source: Making the Kickstart File Available
fr: Mise à disposition du fichier Kickstart

source: Once you create a Kickstart file, you can place it in one of the following locations:
fr: Une fois que vous avez réalisé votre fichier Kickstart, vous pouvez le placer dans l'un des emplacements suivants :

source: On <emphasis>removable media</emphasis>, such as a DVD or USB flash drive connected to the installation system
fr: sur un <emphasis>média amovible</emphasis> tel qu'un DVD ou un disque flash USB connecté au système d'installation ;

source: On a <emphasis>hard drive</emphasis> connected to the installation system
fr: sur un <emphasis>disque dur</emphasis> connecté au système d'installation ;

source: On a <emphasis>network share</emphasis> reachable from the installation system
fr: sur un <emphasis>partage réseau </emphasis> accessible par le système d'installation.

source: Normally, a Kickstart file is copied to removable media or a hard drive, or made available on the network. Placing the file in a network location complements the usual approach to Kickstart installations, which is also network-based: the system is booted using a PXE server, the Kickstart file is downloaded from a network share, and software packages specified in the file are downloaded from remote repositories.
fr: Normalement un fichier Kickstart est copié sur un média amovible ou sur un disque dur, ou rendu disponible sur le réseau. Placer le fichier sur un emplacement réseau rend l'installation Kickstart cohérente avec l'installation réseau ; le système démarre en utilisant un serveur PXE, le fichier Kickstart est téléchargé depuis le partage réseau, les paquets spécifiés dans le fichier sont téléchargés depuis les dépôts distants.

source: <xref linkend="chap-pxe-server-setup" /> offers some additional information about preparing for a network-based installation.
fr: Le <xref linkend="chap-pxe-server-setup" /> présente des informations complémentaires sur la manière de préparer une installation réseau.

source: Starting the Kickstart Installation
fr: Démarrage de l'installation Kickstart

source: Once you have everything ready - you have created a valid Kickstart file and you have either local boot media or a PXE server available, you can start the Kickstart installation. You need to use the <option>inst.ks=</option> boot option either in the boot menu (when booting from local media), or add this option to your PXE server configuration. For information about boot options used in Kickstart installations, see <xref linkend="sect-boot-options-kickstart" />.
fr: Une fois que tout est prêt – vous disposez d'un fichier Kickstart validé, vous disposez aussi d'un média de démarrage local ou d'un serveur PXE – vous êtes en mesure de démarrer l'installation. Vous devez utiliser l'option de démarrage <option>inst.ks=</option> soit à partir du menu de démarrage (si vous démarrez d'un média local), soit en ajoutant cette option à la configuration de votre serveur PXE. Pour une plus ample information sur les options utilisables dans les installations Kickstart, reportez-vous à la <xref linkend="sect-boot-options-kickstart" />.
