Repository: jaaf/po_purifier
Catalog: */NetworkSpoke_EditConnection.po
Languages: fr

source: Editing Network Interface Configuration
fr: Édition de la configuration des interfaces réseau

source: This section only details the most important settings for a typical wired connection used during installation. Many of the available options do not have to be changed in most installation scenarios and are not carried over to the installed system. Configuration of other types of networks is broadly similar, although the specific configuration parameters may be different. To learn more about network configuration after installation, see the <citetitle>&PRODUCT; Networking&nbsp;Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Cette section ne traite que des réglages les plus importants pour une connexion typique par câble utilisée lors de l'installation. Beaucoup des options disponibles n'ont pas besoin d'être modifiées dans la plupart des scénarios d'installation et ne sont pas reportées sur le systèmes installé. La configuration d'autres types de réseau est très largement similaire, bien que les paramètres spécifiques de configuration puissent être différents. Pour en savoir plus sur la configuration du réseau après l'installation, reportez-vous au <citetitle>Guide de configuration du réseau de &PRODUCT; </citetitle>, disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: To configure a network connection manually, select that connection in the list on the left side of the screen, and click the <guilabel>Configure</guilabel> button. A dialog will appear that allows you to configure the selected connection. The configuration options presented depends on the connection type - the available options will be slightly different depending on whether it is a physical interface (wired or wireless network interface controller) or a virtual interface (Bond, Team or Vlan) which you previously configured in <xref linkend="sect-installation-gui-network-configuration-virtual-interface" />.. A full description of all configuration settings for all connection types is beyond the scope of this document; see the <citetitle>Networking Guide</citetitle> for details.
fr: Pour configurer une connexion réseau à la main, sélectionnez cette connexion dans la liste à gauche de l'écran et cliquez sur le bouton <guilabel>Configurer</guilabel>. Une fenêtre de dialogue s'ouvre et vous permet de configurer la connexion choisie. Les options de configuration présentées dépendent du type de connexion – les options disponibles sont légèrement différentes selon qu'il s'agit d'une interface physique (contrôleur d'interface réseau câblée ou sans fil) ou d'une interface virtuelle (agrégée, en équipe ou VLAN) que vous avez préalablement configurée en suivant les directives de la <xref linkend="sect-installation-gui-network-configuration-virtual-interface" />. Une description complète de tous les paramètres pour tous les types de connexion déborde des limites que ce document s'est fixées ; reportez-vous au <citetitle>Guide de la configuration réseau de &PRODUCT;</citetitle> pour plus de détails.

source: The most common and useful options in the configuration dialog are:
fr: Les options de configuration les plus courantes et les plus utiles sont :

source: Enable or disable the connection by default
fr: Activation ou désactivation par défaut de la connexion

source: In the <guilabel>General</guilabel> tab of the configuration dialog, you can select or unselect the <guilabel>Automatically connect to this network when it is available</guilabel> check box to allow or disallow this connection to connect by default. When enabled on a wired connection, this means the system will typically connect during startup (unless you unplug the network cable); on a wireless connection, it means that the interface will attempt to connect to any known wireless networks in range.
fr: Dans l'onglet <guilabel>Géneral</guilabel> de la fenêtre de dialogue de configuration, vous pouvez cocher ou décocher la case <guilabel>Se connecter automatiquement à ce réseau lorsqu'il est disponible</guilabel> pour autoriser, ou pas, la connexion à se connecter automatiquement par défaut. . Lorsque l'autorisation est donnée à une connexion câblée, cela signifie que le système se connecte automatiquement lors du démarrage (sauf si vous avez débranché le câble); lorsque cette autorisation est donnée à une connexion sans fil, cela signifie que le système cherche à se connecter à n'importe quel réseau détecté dans l'environnement.

source: Additionally, you can allow or disallow all users on the system from connecting to this network using the <guilabel>All users may connect to this network</guilabel> option. If you disable this option, only <systemitem class="username">root</systemitem> will be able to connect to this network.
fr: De plus, vous pouvez autoriser, ou ne pas autoriser, tous les utilisateurs à se connecter à ce réseau en utilisant l'option <guilabel>Tous les utilisateurs peuvent se connecter à ce réseau</guilabel>. Si vous désactivez cette option, seul le super utilisateur <systemitem class="username">root</systemitem> sera capable de se connecter à ce réseau.

source: It is not possible to only allow a specific user other than <systemitem class="username">root</systemitem> to use this interface, because no other users are created at this point during the installation. If you need a connection for a different user, you must configure it after the installation.
fr: Il n'est pas possible d'autoriser un utilisateur donné autre que <systemitem class="username">root</systemitem> à utiliser cette interface, car aucun utilisateur n'a encore été créé à ce stade de l'installation. Si vous avez besoin d'une connexion pour un autre utilisateur, vous devez la configurer après l'installation.

source: Set up static IPv4 or IPv6 settings
fr: Configuration statique de l'IPv4 ou IPv6

source: By default, both <systemitem class="protocol">IPv4</systemitem> and <systemitem class="protocol">IPv6</systemitem> are set to automatic configuration depending on current network settings. This means that addresses such as the local IP address, DNS address, and other settings will be detected automatically each time the interface connects to a network. In many cases, this is sufficient, but you can also provide static configuration in the <guilabel>IPv4 Settings</guilabel> and <guilabel>IPv6 Settings</guilabel>, respectively.
fr: Par défaut, à la fois, <systemitem class="protocol">IPv4</systemitem> et <systemitem class="protocol">IPv6</systemitem> sont définis pour se configurer automatiquement en fonction des réglages réseau courants. Cela signifie que, les adresses telles que l'adresse IP locale, l'adresse du DNS et les autres réglages sont détectés automatiquement à chaque fois que l'interface se connecte à un réseau. Dans beaucoup de cas cela est suffisant, mais vous pouvez également fournir une configuration statique dans la <guilabel>Configuration IPv4 </guilabel> et dans la <guilabel>Configuration IPv6</guilabel>.

source: To set static network configuration, navigate to one of the settings tabs and select a method other than <guilabel>Automatic</guilabel> (for example, <guilabel>Manual</guilabel>) from the <guilabel>Method</guilabel> drop-down menu. This will enable the <guilabel>Addresses</guilabel> field below.
fr: Pour configurer le réseau, naviguez vers l'un des onglets de configuration et sélectionnez une méthode autre qu'<guilabel>Automatique</guilabel> (par exemple, <guilabel>Manuelle</guilabel>) à partir du menu déroulant <guilabel>Méthode</guilabel>. Cela activera le champ <guilabel>Adresses</guilabel> en dessous.

source: In the <guilabel>IPv6 Settings</guilabel> tab, you can also set the method to <guilabel>Ignore</guilabel> to disable <systemitem class="protocol">IPv6</systemitem> on this interface.
fr: Dans l'onglet <guilabel>Configuration IPv6</guilabel>, vous pouvez aussi choisir la méthode <guilabel>Ignorer</guilabel> pour désactiver l'<systemitem class="protocol">IPv6</systemitem> sur cette interface.

source: Then, click <guilabel>Add</guilabel> on the right side and add a set of settings: <guilabel>Address</guilabel>, <guilabel>Netmask</guilabel> (for <systemitem class="protocol">IPv4</systemitem>), <guilabel>Prefix</guilabel> (for <systemitem class="protocol">IPv6</systemitem>), and <guilabel>Gateway</guilabel>.
fr: Ensuite, cliquez sur le bouton <guilabel>Ajouter</guilabel> sur la droite et ajoutez un ensemble de réglages : <guilabel>Adresse</guilabel>, <guilabel>Masque de réseau</guilabel> (pour l'<systemitem class="protocol">IPv4</systemitem>), <guilabel>Préfixe</guilabel> (pour l'<systemitem class="protocol">IPv6</systemitem>) et <guilabel>Passerelle</guilabel>.

source: The <guilabel>DNS servers</guilabel> field accepts one or more IP addresses of DNS servers - for example, <literal>10.0.0.1,10.0.0.8</literal>.
fr: Le champ <guilabel>Serveurs DNS</guilabel> accepte une ou plusieurs adresses IP de serveurs DNS – par exemple, <literal>10.0.0.1,10.0.0.8</literal>.

source: The final option in both tabs is <guilabel>Require IPv<replaceable>X</replaceable> addressing for this connection to complete</guilabel>. Select this option in the <systemitem class="protocol">IPv4</systemitem> tab to only allow this connection if <systemitem class="protocol">IPv4</systemitem> was successful; the same principle applies to this setting in the <systemitem class="protocol">IPv6</systemitem> tab. If this option remains disabled for both <systemitem class="protocol">IPv4</systemitem> and <systemitem class="protocol">IPv6</systemitem>, the interface will be able to connect if configuration succeeds on either IP protocol.
fr: La dernière option dans les deux onglets est <guilabel>Requiert l'adressage IPv<replaceable>X</replaceable> pour cette connexion</guilabel>. Sélectionnez cette option dans l'onglet <systemitem class="protocol">IPv4</systemitem> pour n'autoriser cette connexion que si l'<systemitem class="protocol">IPv4</systemitem> a réussi ; le même principe s'applique à ce réglage dans l'onglet <systemitem class="protocol">IPv6</systemitem>. Si cette option reste désactivée pour, à la fois, l'<systemitem class="protocol">IPv4</systemitem> et l'<systemitem class="protocol">IPv6</systemitem>, l'interface est capable de se connecter si la configuration réussi dans l'un ou l'autre des protocoles IP.

source: Configure routes
fr: Configuration des routes

source: In the <guilabel>IPv4 Settings</guilabel> and <guilabel>IPv4 Settings</guilabel> tabs, click the <guilabel>Routes</guilabel> button in the bottom right corner to configure routing settings for a specific IP protocol on an interface. A new dialog will open, allowing you to <guilabel>Add</guilabel> a specific route.
fr: Dans les onglets <guilabel>Configuration IPv4</guilabel> et <guilabel>Configuration IPv6 Settings</guilabel>, cliquez sur le bouton <guilabel>Routes</guilabel> dans l'angle inférieur droit pour configurer les routes d'une interface pour un protocole IP spécifique. Une nouvelle fenêtre de dialogue s'ouvre et vous permet d'<guilabel>Ajouter</guilabel> une route spécifique.

source: If you confire at least one static route, you can disallow all routes not specifically configured here by enabling the <guilabel>Ignore automatically obtained routes</guilabel>.
fr: Si vous configurez au moins une route statique, vous pouvez interdire toutes les routes qui n'ont pas été configurées spécifiquement ici en cochant <guilabel>Ignorer les routes obtenues automatiquement</guilabel>.

source: Select <guilabel>Use this connection only for resources on its network</guilabel> to prevent this connection from becoming the default route. This option can be selected even if you did not configure any static routes. Enabling this option means that this route will only be used when necessary to access certain resources, such as intranet pages which require a local or VPN connection. Another (default) route will be used for publicly available resources if possible. Note that unlike the additional routes configured in this dialog, this setting will be transferred to the installed system. Also note that this option is only useful when more than one interface is configured.
fr: Sélectionnez <guilabel>Utiliser cette connexion uniquement pour les ressources sur son réseau</guilabel> pour empêcher cette connexion de devenir la route par défaut. Cette option peut être sélectionnée même si vous n'avez pas configuré de route statique. Activer cette option signifie que cette route ne sera utilisée que quand il sera nécessaire d'accéder à certaines ressources telles que des pages intranet qui requièrent une connexion locale ou VPN. Un autre route (par défaut) sera utilisée pour les ressources disponibles au public si possible. Notez que, contrairement aux routes additionnelles configurées dans ce dialogue, ce réglage est transféré au système installé. Notez aussi que cette option n'est utile que lorsque plus d'une interface sont configurées.

source: When you finish configuring the interface's routing settings, click <guilabel>OK</guilabel> to return to the configuration dialog.
fr: Quand vous en avez terminé avec les réglages de vos interfaces relatifs aux routes, cliquez sur le bouton <guilabel>OK</guilabel> pour revenir au dialogue de configuration.

source: Once you finish configuring the interface, click <guilabel>Save</guilabel> in the configuration window's bottom right corner to save your settings and return to <xref linkend="sect-installation-gui-network-configuration" />.
fr: Une fois la configuration de l'interface terminée, cliquez sur le bouton <guilabel>Sauvegarder</guilabel> dans l'angle inférieur droit de la fenêtre de configuration pour sauvegarder vos réglages et retourner à l'écran décrit dans la <xref linkend="sect-installation-gui-network-configuration" />.
