Repository: jaaf/po_purifier
Catalog: */Network_based_Installations.po
Languages: fr

source: Setting Up an Installation Server
fr: Configuration d'un serveur d'installation

source: This appendix is intended for users with previous Linux experience. If you are a new user, you may want to install using minimal boot media or the distribution DVD instead.
fr: Cette annexe est à l'intention d'utilisateurs possédant une certains expérience de Linux. Si vous êtes nouvel utilisateur, faites plutôt une installation à l'aide du média de démarrage minimal ou du DVD de la distribution.

source: PXE Installation Overview
fr: Vue d'ensemble d'une installation PXE

source: Preboot Execution Environment, or PXE, is a techonology that allows computers to boot directly from resources provided over the network. Installing Fedora over the network means you don't have to create media, and you can install to multiple computers or virtual machine simultaneously. The process involves a number of components and features working together to provide the resources required.
fr: Le « Preboot Execution Environment » (PXE) (Environnement d'exécution de pré-démarrage), est une technologie qui permet à un ordinateur de démarrer directement à partir de ressources fournies par le réseau. Installer Fedora à partir du réseau signifie que vous n'avez pas à créer un média de démarrage, et que vous pouvez installer plusieurs ordinateurs, ou machines virtuelles, simultanément. Ce processus implique un certain nombre de composants et de fonctionnalités qui coopèrent pour fournir les ressources nécessaires.

source: PXE-capable computer
fr: Ordinateur compatible PXE

source: Most modern computers have the capability to network boot. Typically, a function key pressed during boot will bring up a boot selection menu. In environments designed for unattended administration, systems will often be configured to first attempt booting from the network, then boot from local storage, and the installation server is configured to only offer the installation when required. Your computer's manual will provide specific instructions on setting boot priorities.
fr: La plupart des ordinateurs modernes ont la capacité de démarrer directement depuis le réseau. Typiquement, une touche de fonction pressée dans les tous premiers instants du démarrage provoque l'affichage d'un menu de sélection du média de démarrage. Dans des environnements conçus pour une administration à distance, les systèmes sont souvent configurés pour démarrer d'abord depuis le réseau, puis d'un média local, et le serveur d'installation est configuré pour n'offrir l'installation que sur demande. Le manuel de votre ordinateur fournit les informations spécifiques sur la manière de définir les priorités de démarrage.

source: DHCP Server
fr: Serveur DHCP

source: When a system requests an address during network booting, the DHCP server also provides the location of files to boot. A network should have only one DHCP server.
fr: Lorsqu'un système requiert une adresse IP lors du démarrage à partir du réseau, le serveur DHCP fournit également l'emplacement des fichiers de démarrage. Un réseau ne doit avoir qu'un seul serveur DHCP.

source: TFTP Server
fr: Serveur TFTP

source: Because the pre-boot environment is very simple, files must be provided in a very simple way. Trivial File Transfer Protocol, or TFTP, provides the system with the bootloader required to continue the installation process.
fr: Comme l'environnement PXE est très simple, les fichiers doivent être fournis d'une manière très simple. Le « Trivial File Transfert Protocol » (TFTP) (protocole trivial de transfert de fichiers) fournit au système le chargeur de démarrage nécessaire à la poursuite de l'installation.

source: Bootloader
fr: Chargeur de démarrage

source: Because the job of booting an operating system is too complex for the pre-boot environment, a bootloader is used to load the kernel and related files. It also provides configuration information to the installer, and can offer a menu to select from different configurations.
fr: Comme la tâche assignée à un système d'exploitation est trop complexe pour l'environnement PXE, un chargeur de démarrage est utilisé pour charger le noyau et les fichiers associés. Il fournit aussi des informations de configuration à l'installateur et peut aussi offrir un menu pour choisir parmi différentes configurations.

source: Kernel and Initramfs
fr: Noyau et système de fichiers virtuel initial

source: The kernel is the core of any Linux operating system, and the initramfs provides the kernel with required tools and resources. These files are also provided by tftp.
fr: Le noyau, comme son nom l'indique, est le cœur d'un système d'exploitation Linux et le système de fichiers virtuel initial (initramfs) lui fournit les outils et les ressources nécessaires pour le démarrage. Ces fichiers sont aussi fournis par TFTP.

source: Package repository
fr: Dépôts de paquets

source: A Fedora repository must be available for the installation. The example in this section uses the public Fedora mirrors as the repository source, but you can also use a repo on the local network provided by NFS, FTP, or HTTP. Repositories can be configured using the <option>inst.repo=</option> boot option; see <xref linkend="sect-boot-options-sources" /> for details.
fr: Un dépôt Fedora doit être disponible pour l'installation. L'exemple pris dans cette section utilise les miroirs publics de Fedora comme dépôts source, mais vous pouvez aussi utiliser un dépôt situé sur un réseau local accessible par NFS, FTP ou HTTP. Les dépôts peuvent être configurés en utilisant l'option de démarrage <option>inst.repo=</option> ; voir <xref linkend="sect-boot-options-sources" /> pour les détails.

source: DHCP Server Configuration
fr: Configuration du serveur DHCP

source: Installing and configuring dhcpd
fr: Installation et configuration du démon dhcpd

source: Install the dhcp server package.
fr: Installation du paquet dhcp

source: Create a simple configuration for the dhcp server at <filename>/etc/dhcp/dhcpd.conf</filename>
fr: Créez un fichier <filename>/etc/dhcp/dhcpd.conf</filename> simple pour la configuration du serveur dhcp

source: Test your configuration and address any problems you discover.
fr: Testez votre configuration et résolvez tout problème rencontré.

source: Add entries to point clients to their bootloader and the server that provides it to your subnet configuration in <filename>/etc/dhcp/dhcpd.conf</filename>. Because DHCP clients provide the server with identifying information along with their address request, BIOS clients and UEFI clients can each be directed to the correct bootloader.
fr: Ajoutez à votre configuration de sous-réseau dans <filename>/etc/dhcp/dhcpd.conf</filename> des entrées pour diriger les clients sur leur chargeur de démarrage et sur le serveur qui le fournit.

source: Restart the dhcp service to check the configuration and make changes as needed.
fr: Redémarrez le service dhcp pour vérifier la configuration et corrigez si nécessaire.

source: Installing the tftp server
fr: Installation du serveur TFTP

source: Install the tftp server package.
fr: Installation du paquet « serveur TFTP »

source: Start and enable the <systemitem class="resource">tftp socket</systemitem>. <systemitem class="daemon">systemd</systemitem> will automatically start the <systemitem class="daemon">tftpd</systemitem> service when required.
fr: Démarrez et activez le <systemitem class="resource">socket tftp</systemitem>. <systemitem class="daemon">systemd</systemitem> démarre automatiquement le service <systemitem class="daemon">tftpd</systemitem> quand il est requis.

source: Providing and configuring bootloaders for PXE clients
fr: Fourniture et configuration des chargeurs de démarrage pour les clients PXE

source: Getting the bootloader files
fr: Obtention des fichiers des chargeurs de démarrage

source: Get the <package>syslinux</package> bootloader for BIOS clients.
fr: Obtention du chargeur de démarrage <package>syslinux</package> pour les clients BIOS.

source: Install the <package>syslinux</package> package.
fr: Installez le paquet <package>syslinux</package>.

source: Create a directory for the bootloader files, and make them available there.
fr: Créez un dossier pour les fichiers du chargeur de démarrage et placez les y.

source: Get the bootloader files for UEFI systems
fr: Obtention des fichiers du chargeur de démarrage pour les systèmes UEFI

source: Install the <package>shim</package> and <package>grub2-efi</package> packages. If your server is a BIOS system, you <emphasis>must install the packages to a temporary install root</emphasis>. Installing them directly on a BIOS machine will attempt to configure the system for UEFI booting and cause problems.
fr: Installez le paquet <package>shim</package> et le paquet <package>grub2-efi</package>. Si votre serveur est un système BIOS, vous <emphasis>devez installer les paquets sous une racine d'installation temporaire</emphasis>. Les installer directement sur une machine BIOS provoque la tentative de configuration du système pour un démarrage UEFI et crée des problèmes.

source: Configuring client bootloaders
fr: Configuration des chargeurs de démarrage des clients

source: Create a boot menu for BIOS clients at <filename>/var/lib/tftpboot/pxelinux.cfg/default</filename>.
fr: Créez un menu de démarrage pour les clients BIOS dans <filename>/var/lib/tftpboot/pxelinux.cfg/default</filename>.

source: Create a boot menu for UEFI clients at <filename>/var/lib/tftpboot/pxelinux/uefi</filename>.
fr: Créez un menu de démarrage pour les clients UEFI dans <filename>/var/lib/tftpboot/pxelinux/uefi</filename>.

source: Getting the kernel and initrd
fr: Obtention du noyau et du disque virtuel initial (initrd)

source: Downloading the kernel and initrd
fr: Téléchargement du noyau et du disque virtuel initial (initrd)

source: Create a directory for the files.
fr: Créez un dossier pour les fichiers.

source: Download the kernel.
fr: Téléchargez le noyau.

source: Download the initrd
fr: Téléchargez l'initrd.

source: Providing repositories
fr: Fourniture des dépôts

source: The examples in this section use the public Fedora mirrors as the package source. For faster installations, installing to many systems, or more isolated environments, you may wish to maintain a local repository.
fr: Les exemple de cette section utilisent les miroirs publics de Fedora comme sources des paquets. Pour des installations plus rapides, l'installation sur plusieurs systèmes ou des environnements plus isolés, il peut être intéressant de créer un dépôt local.

source: Fedora Infrastructure maintains instructions for a configuring a local mirror at <ulink url="https://fedoraproject.org/wiki/Infrastructure/Mirroring" />. The preferred method for providing repositories is via HTTP, and you can refer to the <citetitle>Fedora System Administrator's Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />, to configure <systemitem class="daemon">httpd</systemitem>.
fr: L'infrastructure de Fedora fournit des instructions pour la configuration d'un miroir local sur la page <ulink url="https://fedoraproject.org/wiki/Infrastructure/Mirroring" />. La méthode préférable pour mettre un dépôt à disposition est via HTTP. Vous pouvez vous reportez au <citetitle>Guide de l'administrateur système de Fedora</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" /> pour configurer <systemitem class="daemon">httpd</systemitem>.

source: Advanced network installations with Cobbler
fr: Installations réseau avancées avec Cobbler

source: For more complex environments, &PRODUCT; offers the <package>cobbler</package> installation server. Tasks like managing kickstart configurtations, coordinating repositories, maintaining dns records, dhcp servers, and even puppet manifests are effectively automated by <package>cobbler</package>.
fr: Pour des environnements plus complexes, &PRODUCT; met le serveur d'installation <package>cobbler</package> à votre disposition. Des tâches telles que la gestion des configurations Kickstart, la coordination des dépôts, la maintenance des enregistrements dns, les serveurs dhcp et même les manifestes puppet sont effectivement pris en charge automatiquement par <package>cobbler</package>.

source: While levaraging all of the features provided by cobbler can be relatively simple, the full functionality of this powerful tool is too broad to be documented in this guide. The cobbler community provides excellent documentation at <ulink url="http://www.cobblerd.org/manuals/2.6.0/" /> to accompany the packages in the Fedora repository.
fr: Bien que la mise en œuvre de toutes les fonctionnalités de cobbler soit relativement simple, la documentation des fonctionnalités de ce puissant outil sort du champ de ce guide. La communauté cobbler met à votre disposition une excellente documentation sur la page <ulink url="http://www.cobblerd.org/manuals/2.6.0/" /> en accompagnement du paquet disponible dans le dépôt de Fedora.
