Repository: jaaf/po_purifier
Catalog: */Preparing_for_Installation.po
Languages: fr

source: Preparing for Installation
fr: Préparation à l'installation

source: This chapter describes the steps you need take before you begin the installation. Not every step must be strictly followed - for example, if you plan to use the default installation settings, you do not need to gather system information such as disk device labels/UUIDs or network information such as the system's IP address. However, you should still go through this chapter, as it also describes the available types of installation media and how to prepare boot media and installation sources.
fr: Ce chapitre décrit les étapes à suivre avant de commencer l'installation. Toutes les étapes ne sont à pas à suivre strictement – par exemple, si vous envisagez d'utiliser les réglages par défaut de l'installateur, vous n'avez pas à rassembler les informations sur le système telles que les étiquettes ou les UUID des disques, ou les informations réseau telles que l'adresse IP du système. Néanmoins, il est conseillé de lire ce chapitre car il décrit aussi les différents types de média d'installation possibles et comment préparer le démarrage sur ces différents médias et sources d'installation.

source: Upgrade or Install?
fr: Montée en version ou installation ?

source: If you already have Fedora installed and want to upgrade your installation to the current version, there are two basic ways to do so:
fr: Si vous disposez déjà d'un système Fedora installé mais d'une version antérieure à la dernière version et que vous voulez passer à la version courante, il y a deux façons basiques de le faire :

source: Automatic upgrade using <application>dnf system upgrade</application>
fr: Montée en version automatique en utilisant <application>dnf system upgrade</application>

source: The preferred way to upgrade your system is an automatic upgrade using the <application>dnf system upgrade</application> utility. For information on performing an automatic upgrade, see <ulink url="https://fedoraproject.org/wiki/DNF_system_upgrade">Fedora Wiki dnf system upgrade</ulink>.
fr: La façon à privilégier pour monter votre système en version est la montée en version automatique utilisant l'utilitaire <application>dnf system upgrade</application>. Pour des informations sur la manière de monter en version automatiquement, reportez-vous à la page <ulink url="https://fedoraproject.org/wiki/DNF_system_upgrade">DNF system upgrade</ulink> du wiki de Fedora.

source: Manual Reinstallation
fr: Réinstallation manuelle

source: You can upgrade to the latest version of Fedora manually instead of relying on <application>dnf system upgrade</application>. This involves booting the installer as if you were performing a clean installation, letting it detect your existing Fedora system, and overwriting the root partition while preserving data on other partitions and volumes. The same process can also be used to reinstall the system, if you need to. For detailed information, see <xref linkend="sect-upgrading-fedora-manual-reinstall" />.
fr: Vous pouvez monter en version jusqu'à la dernière version de Fedora manuellement en vous fiant à <application>dnf system upgrade</application>. Cela implique le démarrage de l'installateur comme si vous étiez en train de faire une véritable installation, le laissant détecter votre système Fedora existant et surcharger votre partition root tout en préservant les données des autres partitions et volumes. Le même processus peut être utilisé pour réinstaller le système, si vous en avez besoin. Pour des informations détaillées, reportez-vous à la <xref linkend="sect-upgrading-fedora-manual-reinstall" />.

source: Always back up your data before performing an upgrade or reinstalling your system, no matter which method you choose.
fr: Faites toujours une sauvegarde de vos données avant de vous lancer dans une montée en version ou une réinstallation, peu importe la méthode que vous choisissez.

source: Downloading Boot and Installation Images
fr: Téléchargement des images de démarrage et d'installation

source: The Fedora Project offers different flavors tailored for some specific use cases. Choose the Fedora flavor best for you, or you can build your own by customizing after the installation, or by using a kickstart file as described in <xref linkend="sect-kickstart-file-create" />. Kickstart installation requires the <literal>netinstall</literal> media type, or a direct installation booting method such as PXE; kickstarts are not supported with live images.
fr: Le projet Fedora vous propose différentes variantes taillées sur mesure pour quelques usages spécifiques. Choisissez la variant de Fedora qui correspond le mieux à vos besoin. Vous pouvez aussi construire votre propre variante en la personnalisant après l'installation ou en utilisant un fichier Kickstart tel que décrit dans la <xref linkend="sect-kickstart-file-create" />. L'installation Kickstart requiert le média de type <literal>netinstall</literal> ou une méthode d'installation par démarrage direct telle que PXE ; Kickstart n'est pas pris en charge par les images live.

source: Read more about Fedora Workstation, Fedora Cloud, Fedora Server and the available media types in <xref linkend="chap-downloading-fedora" />.
fr: Obtenez plus d'information sur Fedora Workstation, Fedora Cloud, Fedora Server et les types de média disponibles en lisant le <xref linkend="chap-downloading-fedora" />.

source: You can also choose a Fedora <firstterm>Spin</firstterm> featuring favorite alternative desktops or tools for specialized tasks at <ulink url="http://spins.fedoraproject.org" />.
fr: Vous pouvez aussi choisir un des Fedora <firstterm>Spins</firstterm> qui proposent des environnements de bureau ou des outils alternatifs pour des tâches spécialisées sur la page <ulink url="http://spins.fedoraproject.org" />.

source: Verifying the Downloaded Image
fr: Vérification de l'image téléchargée

source: Because transmission errors or other problems may corrupt the Fedora image you have downloaded, it is important to verify the file's integrity. After the images are created, an operation is performed on the file that produces a value called a <literal>checksum</literal> using a complex mathematical algorithm. The operation is sufficiently complex that <emphasis>any change</emphasis> to the original file will produce a different checksum.
fr: Des erreurs de transmission ou d'autres problèmes peuvent altérer l'image Fedora que vous téléchargez. Il est important de vérifier l'intégrité de cette image. Après la création d'une image, une opération utilisant un algorithme mathématique complexe est effectuée sur ce fichier et produit une valeur appelée <literal>somme de contrôle</literal> (checksum). Cette opération est suffisamment complexe pour que <emphasis>la moindre variation</emphasis> du fichier original produise une somme de contrôle différente.

source: By calculating the image's <literal>checksum</literal> on your own computer and comparing it to the original <literal>checksum</literal>, you can verify the image has not been tampered with or corrupted. The original checksum values are provided at <ulink url="https://fedoraproject.org/verify" />, and are <command>gpg</command> signed to demonstrate their integrity.
fr: En calculant la <literal>somme de contrôle</literal> de l'image sur votre propre ordinateur et en la comparant à la <literal>somme de contrôle</literal> originale, vous pouvez vérifier que l'image n'a pas été corrompue ou trafiquée. Les sommes des contrôle originales sont disponibles à <ulink url="https://fedoraproject.org/verify" /> et portent une signature <command>gpg</command> qui prouve leur authenticité.

source: Verifying checksums on Windows systems
fr: Vérification des sommes de contrôle sur les systèmes Windows

source: Download the Fedora image of your choice from <ulink url="https://fedoraproject.org/get-fedora" /> and the corresponding checksum file from <ulink url="https://fedoraproject.org/verify " />
fr: Téléchargez l'image Fedora de votre choix depuis <ulink url="https://fedoraproject.org/get-fedora" /> et la somme de contrôle correspondante depuis <ulink url="https://fedoraproject.org/verify " />.

source: Open a <command>powershell</command> session.
fr: Ouvrez une session <command>powershell</command>.

source: Change to the directory containing the downloaded files.
fr: Placez-vous dans le dossier contenant les fichiers téléchargés.

source: Load the resources required to calculate the checksum.
fr: Chargez les ressources nécessaires pour calculer la somme de contrôle

source: Calculate the downloaded image's checksum. This will take a while!
fr: Calculez la somme de contrôle de l'image téléchargée. Cela prend un peu de temps.

source: Compare the calculated checksum to the expected checksum.
fr: Comparez la somme de contrôle produite avec celle que vous avez téléchargée.

source: Verifying checksums on Linux and OSX systems
fr: Vérification des sommes de contrôle sur les systèmes Linux et OSX

source: Open a terminal window, and navigate to the directory with the downloaded files.
fr: Ouvrez un terminal et placez-vous dans le dossier où vous avez téléchargé les fichiers.

source: Use the appropriate utility to verify the image checksum.
fr: Utilisez l'utilitaire approprié pour vérifier la somme de contrôle de l'image :

source: For Linux:
fr: Pour Linux :

source: For OSX:
fr: Pour OSX :

source: Preparing Boot Media
fr: Préparation du média de démarrage

source: Fedora images are <literal>Hybrid ISOs</literal> and can be used to create installation media with both optical and USB disks, for booting on both BIOS and UEFI systems.
fr: Les images de Fedora sont des images <literal>ISO hybrides</literal> et peuvent être écrites sur des disques optiques ou des disques USB pour démarrer aussi bien sur des systèmes BIOS que sur des systèmes UEFI.

source: Note on Universal USB Creators
fr: Note sur les créateurs universel de média USB

source: Universal USB creation tools such as <application>Unetbootin</application> are a historically popular way to create USB installers from ISOs intended for optical media. They typically function by creating a filesystem on the USB drive, extracting files from the image, and writing <application>syslinux</application> bootloader to the device.
fr: Les outils universels de création de média USB tels que <application>Unetbootin</application> constituent un moyen très populaire pour créer des installateurs USB à partir d'images ISO conçues pour des disques optiques. Typiquement, ils procèdent en créant un système de fichiers sur le disque USB, en extrayant les fichiers depuis l'image et en écrivant un chargeur de démarrage <application>syslinux</application> sur ce disque.

source: These methods circumvent the bootloader configuration built into Fedora images, which are pre-partitioned and designed to boot on UEFI systems with SecureBoot enabled as well as BIOS systems. They do not produce a consistent result with Fedora's images, especially for use with UEFI systems.
fr: Ces méthodes circonviennent la configuration du chargeur de démarrage construit dans les images de Fedora qui sont pré-partitionnées et conçues pour démarrer aussi bien sur des systèmes UEFI avec le SecureBoot activé que sur des systèmes BIOS. Ils ne produisent pas un résultat cohérent avec les images de Fedora, en particulier pour utilisation sur des systèmes UEFI.

source: Utilities that use a direct write method, and do not modify the Fedora image, will produce the most consistently successful results.
fr: Les utilitaires qui utilisent une méthode d'écriture directe et ne modifient pas l'image de Fedora produisent de la façon la plus cohérente un résultat correct.

source: Be sure you choose the right device!
fr: Assurez-vous de choisir le bon périphérique.

source: Most media creation methods in this section are destructive. Ensure you do not need any data on the USB stick, and double check you have chosen the correct device before continuing.
fr: La plupart des méthode de création de médias de cette section sont destructifs. Assurez-vous que vous n'avez plus besoin des données sur la clé USB et vérifiez attentivement que vous avez choisi le bon périphérique avant de continuer.

source: Creating USB Media on Windows
fr: Création d'un média de démarrage USB sur Windows

source: Download and run the <ulink url="https://github.com/downloads/openSUSE/kiwi/ImageWriter.exe"><application>SUSE Studio ImageWriter</application></ulink> or <ulink url="http://www.netbsd.org/~martin/rawrite32/"><application>Rawrite32</application></ulink>.
fr: Téléchargez l'utilitaire <ulink url="https://github.com/downloads/openSUSE/kiwi/ImageWriter.exe"><application>SUSE Studio ImageWriter</application></ulink> ou <ulink url="http://www.netbsd.org/~martin/rawrite32/"><application>Rawrite32</application></ulink>, et exécutez-le.

source: Choose the downloaded Fedora image. You may have to change the file selection dialog's options to view ISO or all file types.
fr: Sélectionnez l'image de Fedora que vous avez téléchargée. Il est peut-être nécessaire de modifier le filtre de type de fichiers de votre explorateur pour qu'il affiche les ISOs ou tous les types de fichiers.

source: Choose the USB device you wish to convert to installation media.
fr: Sélectionnez le périphérique USB que vous voulez transformer en média de démarrage.

source: Continue with media creation using the appropriate button. After a few minutes, it will report the process is complete and your installation media will be ready to use.
fr: Lancez la création en cliquant sur le bouton approprié. Au bout de quelques minutes, le créateur vous informe que le processus est terminé et que votre média d'installation est prêt à l'emploi.

source: Creating USB media with <application>GNOME Disks</application>
fr: Création d'un média de démarrage USB avec l'utilitaire <application>GNOME Disks</application>

source: On a system with <application>GNOME</application>, or with the <package>gnome-disk-utility</package> package installed, open <guilabel>Disks</guilabel> using the system menu.
fr: Sur un système <application>GNOME</application>, ou avec le paquet <package>gnome-disk-utility</package> installé, ouvrez <guilabel>Disks</guilabel> à partir du menu système.

source: Click your USB device in the left column.
fr: Cliquez sur le nom de votre périphérique USB dans la colonne de gauche.

source: Click the menu icon in the upper right corner of the window, and choose the <guimenuitem>Restore Disk Image</guimenuitem> option.
fr: Cliquez l'icône du menu dans l'angle supérieur droit de la fenêtre et choisissez l'option <guimenuitem>Restore Disk Image</guimenuitem> (Restaurer l'image du disque).

source: Navigate to your image file and click <guilabel>Start Restoring</guilabel>. After a few minutes, it will report the process is complete and your installation media will be ready to use.
fr: Naviguez jusqu'à votre fichier image et cliquez sur <guilabel>Start Restoring</guilabel> (Démarrer la restauration). Au bout de quelques minutes, l'utilitaire vous informe que le processus est terminé et que votre média est prêt à l'emploi.

source: Creating USB Media on the Linux command line
fr: Création d'un média de démarrage USB en ligne de commande

source: Open a terminal window and insert the usb drive.
fr: Ouvrez un terminal et connectez votre clé (ou disque) USB.

source: Find the <systemitem class="resource">device node</systemitem> assigned to the drive. In the example below, the drive is given <literal>sdd</literal>.
fr: Recherchez le <systemitem class="resource">nom de périphérique</systemitem> assigné à votre clé (ou disque). Dans notre exemple ci-dessous, il s'agit de <literal>sdd</literal>.

source: Use the <command>dd</command> utility to write the image. <emphasis>Make sure you have the right drive!</emphasis>
fr: Utilisez l'utilitaire <command>dd</command> pour écrire votre image. <emphasis>Surtout, vérifiez-bien que c'est le bon disque.</emphasis>

source: <prompt>#</prompt> <command>dd if=<replaceable>/path/to/Fedora-Live-Security-x86_64-21.iso</replaceable> of=<replaceable>/dev/sdd</replaceable></command>
fr: <prompt>#</prompt> <command>dd if=<replaceable>/chemin/de/Fedora-Live-Security-x86_64-21.iso</replaceable> of=<replaceable>/dev/sdd</replaceable></command>

source: Creating a Boot CD or DVD
fr: Création d'un CD ou DVD de démarrage

source: In addition to creating a bootable USB flash drive, you can also use the provided ISO images to create bootable optical media (a CD or DVD). This approach may be necessary when installing &PRODUCT; on an older system which can not boot from USB.
fr: En plus de pouvoir créer un média de démarrage USB, vous pouvez aussi utiliser l'image ISO pour créer un média optique de démarrage (CD ou DVD). Cette approche peut s'avérer nécessaire sur les systèmes anciens que ne savent pas démarrer sur USB.

source: The exact steps you need to take to burn a bootable CD or DVD from an ISO image will vary depending on what disc burning software you use. This procedure only offers a general overview.
fr: La procédure exacte de gravure d'un CD ou DVD amorçable à partir d'une image ISO dépend beaucoup du logiciel de gravure que vous utilisez. Cette procédure ne donne qu'une vue d'ensemble.

source: Insert a blank CD or DVD into your system's CD or DVD burner.
fr: Insérez un disque vierge dan votre graveur.

source: Open your system's burning software - for example, <application>Brasero</application> on &PRODUCT; systems with <application>GNOME</application> desktop environment, or <application>Nero</application> on Windows systems. In the software's main menu, find an option which lets you burn an ISO image to a disc. For example, in <application>Brasero</application>, this option is <guilabel>Burn image</guilabel> in the main menu on the left side of the window.
fr: Lancez votre logiciel de gravure - par exemple, <application>Brasero</application> sur les systèmes &PRODUCT; utilisant l'environnement de bureau <application>GNOME</application> ou <application>Nero</application> sur les systèmes Windows. Dans le menu principal du logiciel, recherchez l'entrée qui vous permet de graver une image ISO sur un disque. Par exemple, dans <application>Brasero</application>, cette entrée de menu est <guilabel>Graver une image</guilabel> dans le menu principal sur le coté gauche de la fenêtre de l'application.

source: When prompted, select the ISO image of &PRODUCT; to be burned, and the CD or DVD burner with a blank disc inside (if you have more than one drive).
fr: Dès qu'on vous y invite, sélectionnez l'image ISO de &PRODUCT; à graver et le graveur de CD ou DVD dans lequel se trouve le disque vierge (si vous avez plus d'un graveur).

source: Confirm your selection, and wait for the disc to be burned.
fr: Confirmez votre sélection et attendez que le disque soit gravé.
