Repository: jaaf/po_purifier
Catalog: */Revision_History.po
Languages: fr

source: Revision History
fr: Historique de modification

source: Note that revision numbers relate to the edition of this manual, not to version numbers of Fedora.
fr: Notez que les numéros de révision sont relatifs à l'édition de ce manuel, pas aux numéro de version de Fedora.

source: Fedora 23 Final release
fr: Version finale de Fedora 23

source: Kickstart commands and boot options updated for F23
fr: Commandes Kickstart et options de démarrage mises à jour pour F23

source: Many typo fixes
fr: Beaucoup de corrections de fautes de frappe

source: Fedora 22 Final release
fr: Version finale de Fedora 22

source: References to <application>Yum</application> replaced with <application>DNF</application> (the new default package manager)
fr: Références à <application>Yum</application> remplacées par des références à <application>DNF</application> (le nouveau gestionnaire de paquets)

source: Updates in boot options: <option>inst.dnf</option> replaced with <option>inst.nodnf</option>, added <option>inst.kdump_addon=</option>
fr: Mises à jour des options de démarrage : <option>inst.dnf</option> remplacée par <option>inst.nodnf</option>, ajout de l'option <option>inst.kdump_addon=</option>

source: Updates in Kickstart: <command>%anaconda</command>, <command>%addon</command>, <command>sshkey</command>, <command>pwpolicy</command>
fr: Mises à jour dans Kickstart: <command>%anaconda</command>, <command>%addon</command>, <command>sshkey</command>, <command>pwpolicy</command>

source: Added the <guilabel>Kdump</guilabel> screen to the GUI docs
fr: Ajout de l'écran <guilabel>Kdump</guilabel> aux docs du GUI

source: Fixed Windows checksum steps, BZ#1175759
fr: Correction des étapes de sommes de contrôle de Windows, BZ#1175759

source: Parts of the network boot setup chapter have been updated with correct URLs
fr: Des parties de la configuration du démarrage réseau ont été mises à jour avec les URLs corrects.

source: Updates in Recommended Partitioning Scheme and Advice on Partitions in the Manual Partitioning section of the installation chapter
fr: Mises à jour dans la section sur le schéma de partitionnement recommandé et dans les conseils sur les partitions dans le partitionnement manuel

source: Publishing for Fedora 21
fr: Publication de Fedora 21

source: added info on media types
fr: ajout d'informations sur les types de média

source: Publishing for Fedora 20
fr: Publication de Fedora 20
