Repository: jaaf/po_purifier
Catalog: */UserSpoke.po
Languages: fr

source: Create User
fr: Création d'un utilisateur

source: The <guilabel>Create User</guilabel> screen can be used to create and configure one normal (non-<systemitem class="username">root</systemitem>) user account during the installation. Only one user account can be configured here; if you require more accounts, wait until the installation completes, reboot your system and then create other accounts using either the <command>useradd</command> command in a terminal, or a graphical utility for managing user accounts (for example, the <guimenuitem>Users</guimenuitem> screen in the <guimenu>Settings</guimenu> menu in <application>GNOME</application>).
fr: L'écran <guilabel>Céer un utilisateur</guilabel> est utilisé pour créer et configurer un compte utilisateur normal (non <systemitem class="username">root</systemitem>) pendant l'installation. Un seul compte utilisateur peut être configuré à ce stade ; si vous avez besoin de plusieurs comptes, attendez que l'installation soit achevée, redémarrez votre système et créez d'autres comptes en utilisant, soit la commande <command>useradd</command> dans un terminal, soit l'utilitaire graphique de gestion des comptes utilisateur (par exemple, l'écran <guimenuitem>Utilisateurs</guimenuitem> du menu <guimenu>Tous les paramètres</guimenu> de <application>GNOME</application>).

source: Creating a normal user account is not required to finish the installation; however, it is highly recommended. If you do not create one, you will have to log in to the system as <systemitem class="username">root</systemitem> directly, which is <emphasis>not</emphasis> recommended.
fr: La création d'un compte utilisateur normal n'est pas obligatoire pour achever l'installation. Néanmoins, cette création est fortement recommandée. Si vous ne créez pas un utilisateur normal, vous serez obligé(e) de vous connecter au système en tant que super utilisateur <systemitem class="username">root</systemitem>, ce qui n'est <emphasis>pas</emphasis> recommandé.

source: To configure a user account, fill out the <guilabel>Full name</guilabel> (for example, <literal>John Smith</literal>) and <guilabel>Username</guilabel> (for example, <literal>jsmith</literal>). The <guilabel>username</guilabel> will used to log in from a command line; if you install a graphical environment, then your graphical login manager will use <guilabel>Full name</guilabel>.
fr: Pour configurer un compte utilisateur, saisissez vos <guilabel>nom et prénom</guilabel> (par exemple, <literal>John Smith</literal>) et un <guilabel>nom d'utilisateur</guilabel> (par exemple, <literal>jsmith</literal>). Le <guilabel>nom d'utilisateur</guilabel> est utilisé pour vous connecter en ligne de commande ; si vous utilisez un environnement graphique, le gestionnaire de connexion graphique utilise les <guilabel>nom et prénom</guilabel>.

source: Make sure that the <guilabel>Require a password to use this account</guilabel> check box is enabled, enter a password you want to use for this account into the <guilabel>Password</guilabel> field. The characters you write will be displayed as dots for security. Then, repeat the same password in the <guilabel>Confirm password</guilabel> field below to ensure you entered it properly. Both entered passwords must be the same.
fr: Assurez-vous que la case à cocher <guilabel>Exiger un mot de passe pour utiliser ce compte</guilabel> est cochée, entrez le mot de passe que vous voulez utiliser pour ce compte dans le champ de texte <guilabel>Mot de passe</guilabel>. Les caractères que vous tapez sont affichés sous forme de points par sécurité. Répétez le même mot de passe dans le champ de texte <guilabel>Confirmer le mot de passe</guilabel> en dessous pour vérification ; les deux entrées doivent être identiques.

source: As you enter the password, it will be evaluated and the installer will determine the password's strength. If the installer considers your password weak, a message will appear at the bottom of the screen, explaining which aspect of your chosen password is considered insuficient. For example:
fr: Au fur et mesure que vous entrez les caractères du mot de passe, l'installateur en évalue la force. S'il considère que ce mot de passe est trop faible, un message est affiché en bas de l'écran vous expliquant en quoi votre mot de passe est considéré comme insuffisamment fort. Par exemple :

source: <guilabel>The password you have provided is weak:</guilabel> <guilabel>The password is shorter than 5 characters.</guilabel>
fr: <guilabel>Le mot de passe que vous avez fourni est faible : </guilabel> <guilabel>Le mot de passe comporte moins de 6 caractères. Vous devrez appuyer deux fois sur « Terminé » pour le confirmer.</guilabel>

source: If a message similar to the above appears, it is highly recommended to choose a different, stronger password.
fr: Si un message similaire à celui qui est présenté ci-dessus est affiché, il est fortement recommandé de choisir un mot de passe plus fort.

source: The <guilabel>Make this user administrator</guilabel> check box gives the user you are creatng administrative rights (by adding this user into the <systemitem class="groupname">wheel</systemitem> group), allowing this user to use the <command>sudo</command> command to perform tasks normally only available to <systemitem class="username">root</systemitem> using only the user password, instead of the <systemitem class="username">root</systemitem> password. This may be more convenient, but can also pose a security risk.
fr: La case à cocher <guilabel>Faire de cet utilisateur un administrateur</guilabel> confère à l'utilisateur créé les droits d'administration (en l'ajoutant au groupe <systemitem class="groupname">wheel</systemitem> group) qui lui permettent d'utiliser la commande <command>sudo</command> pour exécuter des tâches normalement réservées à l'utilisateur <systemitem class="username">root</systemitem> en utilisant seulement le mot de passe du l'utilisateur normal plutôt que celui de l'utilisateur <systemitem class="username">root</systemitem>. Cela peut s'avérer plus confortable mais peut aussi poser des problèmes de sécurité.

source: If you give administrator privileges to an user, make sure that the account is protected by a strong password. Never give an user administrator privileges without requiring any password for the account.
fr: Si vous accordez les privilèges de l'administrateur à un utilisateur, assurez-vous que ce compte est protégé par un mot de passe solide. N'accordez jamais les privilèges de l'administrateur à un compte non protégé par un mot de passe.

source: See the <citetitle>&PRODUCT; Security Guide</citetitle>, available at the <ulink url="http://docs.fedoraproject.org/" />, for detailed information about password security including guidelines for selecting strong passwords.
fr: Reportez-vous au <citetitle>Guide de la sécurité de &PRODUCT;</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />, pour des informations détaillées sur la sécurisation des mots de passe y compris des conseils sur la manière de choisir un mot de passe solide.

source: To additional settings, click the <guilabel>Advanced</guilabel> button below the password input fields. A new dialog window titled <guilabel>Advanced User Configuration</guilabel> will open. This dialog is described in the following section.
fr: Pour accéder à des réglages additionnels, cliquez sur le bouton <guilabel>Avancé…</guilabel> sous les champs de saisie du mot de passe. Une nouvelle fenêtre de dialogue intitulée <guilabel>Configuration avancée de l'utilisateur</guilabel> s'affiche. Cette fenêtre de dialogue est décrite à la section suivante.

source: Advanced User Configuration
fr: Configuration avancée de l'utilisateur

source: The <guilabel>Advanced User Configuration</guilabel> dialog allows you to change the following settings for the new user account.
fr: La fenêtre de dialogue intitulée <guilabel>Configuration avancée de l'utilisateur</guilabel> vous permet de changer les paramètres suivants du nouveau compte utilisateur :

source: The user's <guilabel>Home directory</guilabel> (<filename class="directory">/home/<replaceable>username</replaceable></filename> by default).
fr: Le <guilabel>Répertoire utilisateur</guilabel> de ce compte <filename class="directory">/home/<replaceable>nom_d_utilisateur</replaceable></filename> par défaut).

source: The user's ID (UID). The default value is 1000. UIDs 0-999 are reserved by the system so they can not be assigned to an user.
fr: L'identifiant de l'utilisateur (UID). La valeurs par défaut est 1000. Les UIDs entre 0 et 999 sont réservés par le système et ne peuvent être assignés à un utilisateur.

source: The the group ID (GID) of the user's default group. The default group name will be the same as the user name, and its default GID is 1000. GIDs 0-999 are reserved by the system so they can not be assigned to an user's group.
fr: L'identifiant de groupe (GID) du groupe par défaut de l'utilisateur. Le nom du groupe par défaut est identique au nom de l'utilisateur et sa valeur par défaut est 1000. Les GIDs entre 0 et 999 sont réservés par le système et ne peuvent être assignés à un groupe d'utilisateurs.

source: The user's group membership. The user account you are creating will always have one default group membership (the user's default group with an ID set in the <guilabel>Specify a group ID manually</guilabel> field). In the <guilabel>Group Membership</guilabel> field, you can specify additional groups as a comma-separated list. Groups which do not already exist will be created; you can specify custom GIDs for them in parentheses. If you do not specify a custom GID for a new group, it will be assigned automatically.
fr: L'appartenance de l'utilisateur à des groupes. Le compte utilisateur que vous créez est toujours rattaché à un groupe (le groupe par défaut de l'utilisateur avec un identifiant défini dans le champ <guilabel>Définir un identifiant ID de groupe manuellement</guilabel> ). Dans le champ <guilabel>Ajouter l'utilisateur aux groupes suivants :</guilabel>, vous pouvez spécifier des noms de groupes additionnels en les séparant par une virgule. Les groupes qui n'existent pas déjà seront créés ; vous pouvez spécifier un GID personnalisé pour chacun d'eux en le plaçant entre parenthèses. Si vous le spécifiez pas un GID pour un nouveau groupe, il lui en sera assigné un automatiquement.
