Repository: jaaf/po_purifier
Catalog: */VNC_Installations.po
Languages: fr

source: Installing Using VNC
fr: Installation par VNC

source: The graphical installation interface is the recommended method of installing &PRODUCT;. However, in some cases, accessing the graphical interface directly is difficult or impossible. Some systems lack the capability to connect a display and a keyboard, making VNC a necessity for manual (non-Kickstart) installations.
fr: La méthode d'installation graphique est la méthode recommandée pour installer &PRODUCT;. Néanmoins, dans certains cas, accéder à l'interface graphique directement est difficile, voire impossible. Certains systèmes n'offrent pas de moyen de connexion d'un moniteur et d'un clavier. Dans un tel cas, le recours à VNC devient une nécessité pour les installations manuelles (sans Kickstart).

source: To allow manual installations on <firstterm>headless systems</firstterm> (systems without a directly connected display, keyboard and mouse), the <application>Anaconda</application> installation program includes a <firstterm>Virtual Network Computing</firstterm> (VNC) mode which allows the graphical mode of the installation program to run locally, but display on another system connected to the network. The VNC installation provides you with the full range of installation options.
fr: Pour permettre l'installation manuelle sur un système dépourvu de clavier, souris et moniteur directement raccordés (<firstterm>headless systems</firstterm>), l'installateur d'<application>Anaconda</application> inclut un mode virtuel en réseau (<firstterm>Virtual Network Computing</firstterm> – VNC) qui permet au mode d'installation graphique de tourner localement alors que ses entrées (clavier et souris) et sa sortie (moniteur) se font sur un système distant à travers le réseau. L'installation VNC met à votre disposition la totalité des options d'installation.

source: This chapter provides instructions on activating VNC mode on the installation system and connecting to it using a VNC viewer.
fr: Ce chapitre fournit des instructions sur la manière d'activer le mode VNC sur le système d'installation et de s'y connecter en utilisant une visionneuse (client) VNC.

source: Installing a VNC Viewer
fr: Installation d'une visionneuse VNC

source: Performing a VNC installation requires a VNC viewer running on your workstation or another terminal computer. VNC viewers are available in the repositories of most Linux distributions; free VNC viewers are also available for other operating systems such as Windows. On Linux systems, use your package manager to search for a viewer for your distribution.
fr: Effectuer une installation VNC nécessite de disposer d'une visionneuse VNC tournant sur votre station de travail ou sur un autre ordinateur doté d'un terminal. Les visionneuses VNC sont disponibles dans les dépôts de la plupart des distributions de Linux. Des visionneuses VNC libres sont également disponibles pour d'autres systèmes d'exploitation comme Windows. Sur les systèmes Linux, utilisez votre gestionnaire de paquets pour trouver une visionneuse pour votre distribution.

source: The following VNC viewers are available in &PRODUCT;:
fr: Les visionneuses VNC suivantes sont disponibles dans &PRODUCT; :

source: <application>TigerVNC</application> - A basic viewer independent of your desktop environment. Installed as the <package>tigervnc</package> package.
fr: <application>TigerVNC</application> : une visionneuse basique indépendante de votre environnement de bureau ; obtenue par installation du paquet <package>tigervnc</package>.

source: <application>Vinagre</application> - A viewer for the <application>GNOME</application> desktop environment. Installed as the <package>vinagre</package> package.
fr: <application>Vinagre</application> : une visionneuse pour l'environnement de bureau <application>GNOME</application> ; obtenue par installation du paquet <package>vinagre</package>.

source: <application>KRDC</application> - A viewer integrated with the <application>KDE</application> desktop environment. Installed as the <package>kdenetwork-krdc</package> package.
fr: <application>KRDC</application> : une visionneuse intégrée à l'environnement de bureau <application>KDE</application> ; obtenue par installation du paquet <package>kdenetwork-krdc</package>.

source: To install any of the viewers listed above, execute the following command as <systemitem>root</systemitem>:
fr: Pour installer l'une des visionneuses citées ci-dessus, exécutez la commande suivante en tant que super utilisateur « <systemitem>root</systemitem> » :

source: <prompt>#</prompt> <command>dnf install <replaceable>package</replaceable></command>
fr: <prompt>#</prompt> <command>dnf install <replaceable>paquet</replaceable></command>

source: Replace <replaceable>package</replaceable> with the package name of the viewer you want to use (for example, <package>tigervnc</package>).
fr: Remplacez <replaceable>paquet</replaceable> par le nom du paquet correspondant à la visionneuse que vous voulez utiliser (par exemple, <package>tigervnc</package>).

source: Procedures in this chapter assume you are using <application>TigerVNC</application> as your VNC viewer. Specific instructions for other viewers may differ, but the general principles still apply.
fr: Les procédures décrites dans ce chapitre supposent que vous utilisez <application>TigerVNC</application> comme visionneuse VNC. Les instructions pour les autres visionneuses peuvent différer mais les principes généraux restent valables.

source: Performing a VNC Installation
fr: Effectuer une installation VNC

source: The <application>Anaconda</application> installation program offers two modes for VNC installation: <firstterm>Direct mode</firstterm> and <firstterm>Connect mode</firstterm>. The modes differ in the way the connection between the server and viewer is established. After you successfully connect, the installation will progress the same way regardless of the mode you used.
fr: L'installateur <application>Anaconda</application> met à votre disposition deux modes pour les installations VNC : le <firstterm>mode direct</firstterm> et le <firstterm>mode connecté</firstterm>. Ces deux modes diffèrent par la manière dont la connexion entre le client et le serveur est établie. Après que vous vous êtes connecté, l'installation se passe de la même manière dans les deux cas.

source: Direct Mode
fr: Mode direct

source: In this mode, <application>Anaconda</application> is configured to start the installation and wait for an incoming connection from VNC viewer before proceeding. While waiting for an incoming connection, the system's IP address and the port on which the installer expects the connection is displayed on the display or console if available; this implies that you need at least a serial console to connect using this mode, but you can work around this limitation if you know the default VNC port and the system's IP address.
fr: Dans ce mode, <application>Anaconda</application> est configuré pour démarrer l'installation et attendre une connexion entrante depuis la visionneuse VNC avant de continuer. Tandis qu'il attend cette connexion entrante, l'adresse IP et le numéro de port sur lesquels l'installateur écoute sont affichés sur le moniteur ou la console si disponible ; cela implique que vous avez besoin d'au moins une console série pour vous connecter en utilisant ce mode. Vous pouvez néanmoins contourner cette limitation si vous connaissez le port VNC par défaut et l'adresse IP du système.

source: Connect Mode
fr: Mode connecté

source: In this mode, the VNC viewer is started on the remote system in <firstterm>listening mode</firstterm>. The VNC viewer waits for an incoming connection on a specified port. Then, <application>Anaconda</application> is started and the host name/IP address and port number of the viewer are provided using a boot option or a Kickstart command. When the installation begins, the installation program establishes a connection with the listening VNC viewer using the specified host name/IP address and port number. Connect mode is therefore easier to use on systems with no local display or console, but it also may require additional preparation, because the viewer system must be able to accept incoming connections on the specified port, which usually requires changing firewall settings.
fr: Dans ce mode, la visionneuse VNC est démarrée sur le système distant en <firstterm>mode écoute</firstterm>. La visionneuse VNC attend une connexion entrante sur un port spécifié. Ensuite, <application>Anaconda</application> est démarré et le nom d'hôte/l'adresse IP et le numéro de port de la visionneuse sont fournis à l'aide d'une option de démarrage ou une commande Kickstart. Lorsque l'installation démarre, l'installateur établit la connexion avec la visionneuse à l'écoute en utilisant les paramètres fournis (nom d'hôte/adresse IP et numéro de port). Le mode connecté est donc plus facile à utiliser sur les systèmes dépourvus de moniteur ou de console locale, mais il peut nécessiter une préparation supplémentaire, parce que la visionneuse doit être capable d'accepter les connexions entrantes sur le port spécifié, ce qui oblige le plus souvent à modifier les paramètres du pare-feu.

source: Choosing a VNC Installation Mode
fr: Choix d'un mode d'installation VNC

source: Visual and Interactive access to the system
fr: Accès visuel et interactivité avec le système

source: If visual and interactive access to the system being installed is not available, then you should use Connect Mode.
fr: Si un accès visuel et une interactivité avec le système sur lequel l'installation a lieu n'est pas possible, vous devez utiliser le mode connecté.

source: Network Connection Rules and Firewalls
fr: Règles de connexion au réseau et pare-feu

source: If the system being installed is not allowed inbound connections by a firewall, then you must use Connect Mode or disable the firewall. Disabling a firewall may have security implications.
fr: Si le système sur lequel a lieu l'installation se voit interdire par un pare-feu d'accepter les connexions entrantes, alors vous devez utiliser le mode connecté ou désactiver le pare-feu. La désactivation d'un pare-feu est susceptible de dégrader la sécurité.

source: If the remote system running the VNC viewer is not allowed incoming connections by a firewall, then you must use Direct Mode, or disable the firewall. Disabling a firewall may have security implications.
fr: Si le système distant, qui exécute la visionneuse VNC, se voit interdire par un pare-feu d'accepter les connexions entrantes, alors vous devez utiliser le mode direct ou désactiver le pare-feu. La désactivation d'un pare-feu est susceptible de dégrader la sécurité.

source: Installing in VNC Direct Mode
fr: Installation dans le mode VNC direct

source: VNC Direct Mode is when the VNC viewer initiates a connection to the system being installed. <application>Anaconda</application> will tell you when to initiate this connection.
fr: Dans le mode VNC direct, la visionneuse VNC a l'initiative de la connexion au système sur lequel a lieu l'installation. <application>Anaconda</application> vous dit quand initier cette connexion.

source: Starting VNC in Direct Mode
fr: Démarrage de VNC en mode direct

source: Open the VNC viewer (for example, <application>TigerVNC</application>) on the workstation you will be using to connect to the system being installed. A window similar to <xref linkend="figu-vnc-installations-connection-details" /> will be displayed with an input field allowing you to specify an IP address.
fr: Ouvrez la visionneuse VNC (par exemple, <application>TigerVNC</application>) sur la station de travail que vous allez utiliser pour vous connecter au système sur lequel l'installation a lieu. Une fenêtre similaire à celle-ci <xref linkend="figu-vnc-installations-connection-details" /> s'affiche avec un champ de saisie dans lequel vous pouvez saisir une adresse IP.

source: TigerVNC Connection Details
fr: Détails de la connexion avec TigerVNC

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see <xref linkend="sect-boot-menu" />) and append the <option>inst.vnc</option> option to the end of the command line.
fr: Démarrez le système d'installation et attendez l'affichage du menu de démarrage. Dans ce menu, éditez les options de démarrage (voir la <xref linkend="sect-boot-menu" />) et ajoutez l'option <option>inst.vnc</option> à la fin de ligne de commande.

source: Optionally, if you want to restrict VNC access to the installation system, add the <option>inst.vncpassword=<replaceable>PASSWORD</replaceable></option> boot option as well. Replace <replaceable>PASSWORD</replaceable> with the password you want to use for the installation. The VNC password must be between 6 and 8 characters long.
fr: En option, si vous voulez restreindre l'accès VNC au système d'installation, ajoutez également l'option de démarrage <option>inst.vncpassword=<replaceable>MOT_DE_PASSE</replaceable></option>. Remplacez <replaceable>MOT_DE_PASSE</replaceable> par le mot de passe que vous voulez utiliser pour l'installation. Le mot de passe VNC doit comprendre entre 6 et 8 caractères.

source: Use a temporary password for the <option>inst.vncpassword=</option> option. It should not be a real or root password you use on any system.
fr: Utilisez un mot de passe temporaire pour l'option <option>inst.vncpassword=</option>. Cela ne devrait pas être un mot de passe réel que vous utilisez sur un de vos systèmes.

source: Adding VNC Boot Options
fr: Ajout des options de démarrage VNC

source: Start the installation using the edited options. The system will initialize the installation program and start the necessary services. When the system is ready, you will see a message on the screen similar to the following:
fr: Démarrez l'installation avec les nouvelles options. Le système initialise l'installateur et démarre les services requis. Lorsque le système est prêt, vous devez apercevoir un message à l'écran qui ressemble à ceci :

source: Note the IP address and port number (in the above example, <literal>192.168.100.131:5901</literal>).
fr: Notez l'adresse IP et le numéro de port (dans l'exemple ci-dessus, <literal>192.168.100.131:5901</literal>).

source: On the system running the VNC Viewer, enter the IP address and port number obtained in the previous step into the <guilabel>Connection Details</guilabel> dialog in the same format as it was displayed on the screen by the installer. Then, click <guilabel>Connect</guilabel>. The VNC viewer will now connect to the installation system. If you set up a VNC password, enter it when prompted and press <guilabel>OK</guilabel>.
fr: Sur le système sur lequel s'exécute la visionneuse VNC, entrez l'adresse IP et le numéro de port obtenu à l'étape précédente dans la fenêtre de dialogue <guilabel>Détails de la connexion</guilabel> dans le même format. Ensuite, cliquez sur le bouton <guilabel>Connecter</guilabel>. La visionneuse VNC se connecte alors au système d'installation. Si vous avez défini un mot de passe VNC, entrez-le quand vous y êtes invité et pressez le bouton <guilabel>OK</guilabel>.

source: When the connection is successfully established, a new window will open on the system running the VNC viewer, displaying the installation menu. This window will provide full remote access to the installer until the installation finishes and the system reboots for the first time.
fr: Lorsque la connexion est correctement établie, une nouvelle fenêtre s'ouvre sur le système exécutant la visionneuse VNC et affiche le menu d'installation. Cette fenêtre vous fournit un accès distant plein et entier à l'installateur jusqu'à la fin de l'installation et au redémarrage du système pour la première fois.

source: You can then proceed with <xref linkend="chap-installing-using-anaconda" />.
fr: Vous pouvez continuer en suivant les instruction du <xref linkend="chap-installing-using-anaconda" />.

source: Installing in VNC Connect Mode
fr: Installation dans le mode VNC connecté

source: VNC connect mode is when the system being installed initiates a connection to the VNC viewer running on a remote system. Before you start, make sure the remote system is configured to accept incoming connection on the port you want to use for VNC. The exact way to make sure the connection will not be blocked depends on your network and on your workstation's configuration. Information about configuring the firewall in &PRODUCT; is available in the <citetitle>&PRODUCT; Security&nbsp;Guide</citetitle>, available at <ulink url="http://docs.fedoraproject.org/" />.
fr: Dans le mode VNC connecté, le système sur lequel l'installation a lieu initie la connexion à la visionneuse VNC qui tourne sur un système distant. Avant de démarrer, assurez-vous que le système distant est configuré pour accepter les connexions entrantes sur le port que vous voulez utiliser pour VNC. La manière précise de s'assurer que votre connexion ne sera par bloquée dépend de votre réseau et de la configuration de votre station de travail. Des informations sur la manière de configurer le pare-feu dans &PRODUCT; sont disponibles dans le <citetitle>Guide de la sécurité de &PRODUCT;</citetitle> disponible à <ulink url="http://docs.fedoraproject.org/" />.

source: Starting VNC in Connect Mode
fr: Démarrage de VNC en mode connecté

source: Start the VNC viewer on the client system in listening mode. For example, on &PRODUCT; using <application>TigerVNC</application>, execute the following command:
fr: Démarrez la visionneuse VNC sur le système client en mode écoute. Par exemple, sur &PRODUCT;, en utilisant <application>TigerVNC</application>, exécutez la commande suivante :

source: Replace <replaceable>PORT</replaceable> with the port number you want to use for the connection.
fr: Remplacez <replaceable>PORT</replaceable> par le numéro du port que vous voulez utiliser pour la connexion.

source: The terminal will display a message similar to the following example:
fr: Le terminal affiche un message similaire au message de l'exemple suivant :

source: TigerVNC Viewer Listening
fr: Visionneuse TigerVNC Viewer à l'écoute

source: When this message is displayed, the VNC viewer is ready and waiting for an incoming connection from the installation system.
fr: Quand ce message est affiché, la visionneuse VNC est prête et attend les connexions entrantes du système d'installation.

source: Boot the installation system and wait for the boot menu to appear. In the menu, edit boot options (see <xref linkend="sect-boot-menu" />) and append the following options to the end of the command line:
fr: Démarrez le système d'installation et attendez l'affichage du menu de démarrage. Dans le menu, éditez les options de démarrage (voir la <xref linkend="sect-boot-menu" />) et ajoutez les options suivantes à la fin de la ligne de commande :

source: <option>inst.vnc inst.vncconnect=<replaceable>HOST</replaceable>:<replaceable>PORT</replaceable></option>
fr: <option>inst.vnc inst.vncconnect=<replaceable>HÔTE</replaceable>:<replaceable>PORT</replaceable></option>

source: Replace <replaceable>HOST</replaceable> with the IP address of the system running the listening VNC viewer, and <replaceable>PORT</replaceable> with the port number that the VNC viewer is listening on.
fr: Remplacez <replaceable>HÔTE</replaceable> par l'adresse IP du système qui exécute la visionneuse VNC à l'écoute et <replaceable>PORT</replaceable> par le numéro du port sur lequel la visionneuse écoute.

source: Start the installation. The system will initialize the installation program and start the necessary services. Once the initialization is finished, <application>Anaconda</application> will attempt to connect to the IP address and port you provided in the previous step.
fr: Démarrez l'installation. Le système initialise l'installateur et démarre les services requis. Une fois l'installation terminée, <application>Anaconda</application> essaye de se connecter à l'adresse IP et avec le numéro de port que vous avez fourni à l'étape précédente.

source: Kickstart Considerations
fr: Considérations relatives à Kickstart

source: Commands for using a VNC installation are also available in Kickstart installations. Using just the <command>vnc</command> command will set up an installation using Direct Mode. Options are available to set up an installation using Connect Mode. For more information about the <command>vnc</command> command and options used in Kickstart files, see <xref linkend="appe-kickstart-syntax-reference" />.
fr: Les commandes pour réaliser une installation VNC sont également disponibles pour Kickstart. La commande <command>vnc</command> seule configure une installation VNC en mode direct. Des options sont disponibles pour configurer une installation en mode connecté. Pour plus d'information sur la commande <command>vnc</command> et les options à utiliser dans un fichier Kickstart, voir l'<xref linkend="appe-kickstart-syntax-reference" />.

source: Considerations for Headless Systems
fr: Considération relatives aux systèmes dépourvus d'interface utilisateur

source: When installing headless systems, the only choices are an automated Kickstart installation or an interactive VNC installation using connect mode. For more information about automated Kickstart installation, see <xref linkend="appe-kickstart-syntax-reference" />. The general process for an interactive VNC installation is described below.
fr: Lors de l'installation sur des systèmes dépourvus d'interface utilisateur (moniteur, clavier et souris), les seuls choix possibles sont une installation Kickstart automatique ou une installation VNC interactive en mode connecté. Pour plus d'information sur les installations Kickstart automatiques, voir l'<xref linkend="appe-kickstart-syntax-reference" />. Le processus pour une installation VNC interactive est décrit ci-dessous.

source: Set up a PXE server that will be used to start the installation. Information about installing and performing basic configurating of a PXE server can be found in <xref linkend="chap-pxe-server-setup" />.
fr: Configurez un serveur PXE qui sera utilisé pour démarrer l'installation. Vous pouvez trouver les informations sur la manière d'installer un serveur PXE et d'assurer sa configuration de base au <xref linkend="chap-pxe-server-setup" />.

source: Configure the PXE server to use the boot options for a connect mode VNC installation. For information on these boot options, see <xref linkend="sect-vnc-installations-connect-mode" />.
fr: Configurez le serveur PXE pour utiliser les options de démarrage d'une installation VNC en mode connecté. Pour des informations sur ces options de démarrage, reportez-vous à la <xref linkend="sect-vnc-installations-connect-mode" />.

source: Follow the procedure for a VNC Installation using connect mode as described in the <xref linkend="proc-vnc-installations-connect-mode" />. However, when directed to boot the system, boot it from the PXE server.
fr: Suivez la <xref linkend="proc-vnc-installations-connect-mode" />. Néanmoins, lorsqu'il vous est demandé de démarrer le système, faites le depuis le serveur PXE.
